[
    {
        "flair": "",
        "title": "[POEM] Piece A Shit by Sam Pink",
        "author": "jxrha",
        "date": 1654158074.0,
        "score": 8934,
        "description": "",
        "comments": [
            {
                "user": "Deleted",
                "comment": "I love this poem.  It reminds me of the pettiness and self pity I can wrap myself in sometimes, as if the car that cut me off was an act of personal insult or something.   This wonderful little poem allowed me to laugh at myself.",
                "score": 261,
                "date": 1654184876.0
            },
            {
                "user": "weavetwigs",
                "comment": "When I see a poem \n\n& it has the shadow of a cell phone in the corner\n\nit’s like\n\nwhat the fuck man.",
                "score": 514,
                "date": 1654193625.0
            },
            {
                "user": "FrostyTheSasquatch",
                "comment": "I love how divisive this poem is. This is some dada stuff right here!",
                "score": 185,
                "date": 1654167718.0
            },
            {
                "user": "pantsaloon",
                "comment": "My heart was not ready for this",
                "score": 208,
                "date": 1654158172.0
            },
            {
                "user": "Shit_4_Brainz",
                "comment": "Look at all of this sub’s top posts, wtf has happened",
                "score": 221,
                "date": 1654166122.0
            },
            {
                "user": "TheBostonCorgi",
                "comment": "Lmao, this is a solid reminder not all poetry has to take itself 100% seriously",
                "score": 216,
                "date": 1654173902.0
            },
            {
                "user": "anclro1",
                "comment": "Still better than rupi kaur",
                "score": 91,
                "date": 1654179448.0
            },
            {
                "user": "Sir_quakalot",
                "comment": "I prefer this over the hundreds of love/ heartbreak poems that are posted here",
                "score": 66,
                "date": 1654182219.0
            },
            {
                "user": "Lianidis",
                "comment": "I just wanna know, did this poem take up the entire page?",
                "score": 18,
                "date": 1654178474.0
            },
            {
                "user": "Deleted",
                "comment": "Poetry has truly reached its peak",
                "score": 60,
                "date": 1654164943.0
            },
            {
                "user": "SacrMx47",
                "comment": "Art that incites division and stokes debate is just good art. It makes you think effortlessly",
                "score": 14,
                "date": 1654187180.0
            },
            {
                "user": "ventoidiota",
                "comment": "What about the title? It's like piece of shit said with some accent? Could someone tell me? Not a native speaker here.",
                "score": 13,
                "date": 1654173619.0
            },
            {
                "user": "Comfortable_Canary_8",
                "comment": "What the fuck man.",
                "score": 10,
                "date": 1654189216.0
            },
            {
                "user": "Deetee-Senpai",
                "comment": "So much to analyze. Who's the title referring to, the frog or the narrator? The language is specific, like this has either happened before or will happen in the future, as the narrator seems to have expected this in some way. The poem reads metaphorically, but there's nothing stopping it from being fantastical; the frog could literally be speaking, and my brain tends to picture that automatically. It adds to the sort of dreamy, laid back feeling of the story. \n\nIs the speech even assigned to the frog at all? Or is it meant to read closer to \"it's like... what the fuck man?\" It could be a kid or teenager, having nothing profound to think about the situation beyond how odd it is. Or it could really just be some person trying to understand a frog. Lots of fun no matter how you look at it.",
                "score": 21,
                "date": 1654179021.0
            },
            {
                "user": "Deleted",
                "comment": "hats off to this unmatched poetic masterpiece",
                "score": 24,
                "date": 1654168480.0
            },
            {
                "user": "ventoidiota",
                "comment": "This made me laugh out loud",
                "score": 18,
                "date": 1654173556.0
            },
            {
                "user": "AdenorBennani",
                "comment": "Charles Bukowski was right when he said that most poems are garbage.",
                "score": 81,
                "date": 1654166111.0
            },
            {
                "user": "IsSonicsDickBlue",
                "comment": "The only real goal of poetry (or art, really) is to evoke emotion. Everything else is subject to interpretation. \n\nI mean…it did make me feel something. 10/10",
                "score": 7,
                "date": 1654200285.0
            },
            {
                "user": "Moesaei",
                "comment": "Deeper than a deep dish pizza",
                "score": 20,
                "date": 1654164837.0
            },
            {
                "user": "Individual_Problem49",
                "comment": "My kind of poetry",
                "score": 5,
                "date": 1654192020.0
            },
            {
                "user": "21archman21",
                "comment": "Move over, Keats.",
                "score": 6,
                "date": 1654195227.0
            },
            {
                "user": "DoctorLove01",
                "comment": "I think the meaning behind this poem is that even a frog is disgusted by the readers very existence and so it leaps away from our degenerate presence.",
                "score": 4,
                "date": 1654235031.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 22,
                "date": 1654168370.0
            },
            {
                "user": "phargle",
                "comment": "After reading all the comments here, I've got some ponderin'.\n\nPoetry is not necessarily language that is divisive, else one could sort by controversial, select the top comment, and proclaim like Diogenes holding a plucked chicken: behold, a poem.\n\nNor is poetry merely language that provokes thought, inasmuch as the function of all language is to provoke thought. No, poetry is a more particular sort of language.\n\nNor is poetry merely language that makes one feel. We know when we are told something hurtful that we are not in the presence of a poet.\n\nOn the flip side, while not all art made with language is poetry, poetry is art made with language. And while not all word art that transcends literal meaning is poetry, poetry is language that conveys more than the sum of its parts. And while not all language charged with meaning is poetry, poetry — good poetry — is language charged with meaning to the utmost possible degree. All human interaction is necessarily subjective, yet every poet who has tried to write better manages to make sense of that pursuit, and manages to find something approaching \"better\" to be an emergent property of that subjectivity. Last, although not all wordplay is poetry, poetry is first a form of play that uses language.\n\nMy favorite definition of poetry is that poetry is what poets write, and a poet is someone who writes poetry. It sounds glib, but I like it, and I would say anyone who engages with language on the level of art-play with the genuine intent of writing a poem, and of using language in a performative way that says \"this is poetry, please shift your perception to read it as such,\" is doing it right.\n\nAnyway, I like this thing with the frogs.",
                "score": 4,
                "date": 1654267735.0
            },
            {
                "user": "TravisLagoonie",
                "comment": "Actually I think it is not only funny, it gets me thinking. Why is the frog jumping away? It is within its nature but I look at him because I want to see nature which does not seem to want me near it.\nWhy can I not be a part of that frog that interests me? Why is he fleeing? I guess although we rule over nature it will always flee from us if it has a chance since we are a danger to it.\nThe frog jumping away reminds us of our own position in nature which we forget about most of the time.",
                "score": 34,
                "date": 1654159971.0
            },
            {
                "user": "Deleted",
                "comment": "I love this.",
                "score": 18,
                "date": 1654158459.0
            },
            {
                "user": "PrivateChonkin",
                "comment": "Sam Pink rules and the (correct) people enjoying this poem should check out his novels.",
                "score": 6,
                "date": 1654181880.0
            },
            {
                "user": "australiano",
                "comment": "It looks like it was posted as a tweet.",
                "score": 8,
                "date": 1654159456.0
            },
            {
                "user": "oddfellowfloyd",
                "comment": "I ask myself, “What the fuck?,” SO many times a day… and not just because of random amphibians scooting away from me.  🤣",
                "score": 3,
                "date": 1654183478.0
            },
            {
                "user": "Jah96thoughts",
                "comment": "This is beautiful",
                "score": 3,
                "date": 1654185859.0
            },
            {
                "user": "SeeksTheRedRiver",
                "comment": "This truly speaks to my soul. I, too, look to frogs for an explanation as to why, WHY! Would you hop away from me friend? It all relates back to life and how friends always seem to turn into frogs.",
                "score": 3,
                "date": 1654189401.0
            },
            {
                "user": "OozyMonkey",
                "comment": "If this isn't poetry, I don't know what is.",
                "score": 3,
                "date": 1654217611.0
            },
            {
                "user": "Brucewillisballsack",
                "comment": "Pulitzer",
                "score": 3,
                "date": 1654222366.0
            },
            {
                "user": "The_Sdrawkcab",
                "comment": "Everything's a poem these days",
                "score": 3,
                "date": 1654233938.0
            },
            {
                "user": "StackMarketLady",
                "comment": "Holy hell, I'm screaming. I'm a songwriter and sometimes I'll go to a subreddit and sort it by the top posts of all time for inspiration / data on what people like.\n\n  This is our number one for r/poetry lol",
                "score": 3,
                "date": 1712932549.0
            },
            {
                "user": "portdrift",
                "comment": "My favorite line of this poem is “& it takes a hop away from me”. To view a being’s escape as an act of theft. Distance inflicting loss.",
                "score": 5,
                "date": 1654205391.0
            },
            {
                "user": "shamissabri",
                "comment": "👍👶",
                "score": 6,
                "date": 1654158691.0
            },
            {
                "user": "v1num1",
                "comment": "For some reason I read this in Jordan Petersons voice.",
                "score": 12,
                "date": 1654162350.0
            },
            {
                "user": "ssammi",
                "comment": "Art",
                "score": 2,
                "date": 1654226032.0
            },
            {
                "user": "hadesisperfect",
                "comment": "still a better love story than twilight",
                "score": 2,
                "date": 1654232374.0
            },
            {
                "user": "DangerousYesterday28",
                "comment": "When I enter a store and I see a mirror\n\nI say wtf man ... I only came for the snickers \n\nNot the view.. exits as I came in .. smh .. wtf \n\nAnyone...",
                "score": 2,
                "date": 1654469457.0
            },
            {
                "user": "Adept-Ad1063",
                "comment": "Once,\n\nI stepped on\n\na frog\n\nby mistake\n\nbefore it could hop \n\naway.\n\nI was like,\n\n\"Man, I hate that.\"",
                "score": 2,
                "date": 1654903310.0
            },
            {
                "user": "Amirzhan3521",
                "comment": "Hold on there, let’s analyse this beauty of work. Firstly, we are told there is a frog and we see it. This is sense language making us image … a frog. But afterwards, it is followed by enjambement. This matters so much as we are told it hops away and the enjambment allows us to imagine the pace of the hop. We are told it goes away from the poet and this implies the frog is scared of what lurks. This could mean it’s trying to suggest the frog is society, the youth specifically being scared of truly the most scariest thing ever, the government. We are the frog, running from the government drones but because you pay taxes, you are also the drone. This implies that us united are paying for our own downfall, we are destroying ourselves. But then we go to the next line, so short yet so elegant… the shortness suggests we are heartbroken from the past moment but also the message that we will kill ourselves. It makes us feel stopped so sudden, how sudden the changes and the message is. And finally, the line ‘what the fuck man’. At first, we thinks it’s just heartbroken. The strong language ‘fuck’ tells us how broken we feel after the events. But we fail to see the hidden message. Until you realise, we are questioning the governments authority with rhetorical question. It makes us feel motivated to start a revolution to overthrow our own destruction. In conclusion, the message is strong and we MUST stop the government before we destroy ourselves. Don’t pay taxes is a simple summary of what it’s telling us.",
                "score": 2,
                "date": 1709071936.0
            },
            {
                "user": "AaronMcScarin",
                "comment": "Leddit poetry. This does not feel original enough to be dada genre :/ it feels like a tumblr post someone broke into “thoughtful” line breaks.",
                "score": 5,
                "date": 1654193072.0
            },
            {
                "user": "insomniacla",
                "comment": "Imagine being the tree that died to make this page.",
                "score": 4,
                "date": 1654179196.0
            },
            {
                "user": "sapianddog2",
                "comment": "Art is and always will be subjective. No amount of college education or circle jerking is going to change that.\n\nThis made me laugh btw",
                "score": 3,
                "date": 1654194719.0
            },
            {
                "user": "sapjastuff",
                "comment": "I love this. Does anyone else know any poems like this? I’d love to read them",
                "score": 5,
                "date": 1654173956.0
            },
            {
                "user": "losandreas36",
                "comment": "Junk",
                "score": 4,
                "date": 1654175434.0
            },
            {
                "user": "Slapppyface",
                "comment": "Drivel",
                "score": 6,
                "date": 1654162938.0
            },
            {
                "user": "RelevantDocument3389",
                "comment": "Speaks volumes about that frogs character.",
                "score": 3,
                "date": 1654172165.0
            },
            {
                "user": "Deleted",
                "comment": "It uses curse words so you know it’s edgy!",
                "score": 2,
                "date": 1654178683.0
            },
            {
                "user": "dead_for_now07",
                "comment": "Yes, i feel you.",
                "score": 2,
                "date": 1654165932.0
            },
            {
                "user": "Shadowman-The-Ghost",
                "comment": "This is not a poem. It’s a random thought by an idiot who wants any childish thought that he has to be taken seriously and/or seen as relevant. Labels are as meaningless as the clowns who simply make them up. 🙄",
                "score": 1,
                "date": 1654180526.0
            },
            {
                "user": "Deleted",
                "comment": "Am I the only who can grasp the depth of this? I understand interpretations but I feel like poetry is going too far when it comes to words v meaning.",
                "score": 1,
                "date": 1654215338.0
            },
            {
                "user": "Rich841",
                "comment": "Why Piece A Shit? Why not Piece of Shit?\n\nwhat the fuck man",
                "score": 1,
                "date": 1716267846.0
            },
            {
                "user": "SeasonedGreenhorn",
                "comment": "Does anyone know which collection this is from?",
                "score": 1,
                "date": 1724885959.0
            },
            {
                "user": "MACrOHarDDOORSxyz",
                "comment": "my favorite poem.",
                "score": 1,
                "date": 1725996954.0
            },
            {
                "user": "Neovintagepoet",
                "comment": "Cease to be… for a greater good!\nBy D.N.N.\n\nCease to be…\nLet’s cease to be humans,\nA movement we should be\nTo show the path to the ones\nWho choose to still be humans.\n\nShow them,\nWe should,\nThe path of love,\nOf peace\nAnd freedom.\n\nLet’s unleash our words of freedom\nTo the ones who want to be free,\nBut don’t know how to anymore.\n\nInstagram: @neovintagepoetry\nTwitter: @neovintagepoet",
                "score": 1,
                "date": 1726541583.0
            },
            {
                "user": "Neovintagepoet",
                "comment": "Freaky poem 🔥",
                "score": 1,
                "date": 1726541856.0
            },
            {
                "user": "United_Discount_6258",
                "comment": "Please tell me the name of the book, if you know it. I beg of you this lol. Edit:OP put it in the title! Thanks OP",
                "score": 1,
                "date": 1654165893.0
            },
            {
                "user": "snorkelinthesea",
                "comment": "😂😂😂",
                "score": 1,
                "date": 1654162243.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 1,
                "date": 1654176288.0
            },
            {
                "user": "SWAGPURSON",
                "comment": "So true, amazing poem ((:",
                "score": 1,
                "date": 1654181025.0
            },
            {
                "user": "_chari",
                "comment": "Genius.",
                "score": 0,
                "date": 1654171064.0
            },
            {
                "user": "FixenDixiesChickN",
                "comment": "I am the Lizard King At Rock there is none higher, Sucker MC's just call me JIM . Technically Speaking I'm a Horned Toad from the other side of DFW. \n\n(While this bears no pont up Here this was on my mind  before I saw your amphibious post this morning, this oddly tripping me out. The web nose me I feal yout synchronization)",
                "score": -8,
                "date": 1654159361.0
            },
            {
                "user": "Deleted",
                "comment": "[removed]",
                "score": -20,
                "date": 1654161943.0
            },
            {
                "user": "Limp-Ad-538",
                "comment": "Well as they say, poetry can be very diverse lol",
                "score": 1,
                "date": 1654202789.0
            },
            {
                "user": "swim_and_sleep",
                "comment": "I love Sam pink!",
                "score": 1,
                "date": 1654206724.0
            },
            {
                "user": "_ashes_to_asher_",
                "comment": "Gold lol",
                "score": 1,
                "date": 1654207060.0
            },
            {
                "user": "Deleted",
                "comment": "This is great",
                "score": 1,
                "date": 1654208110.0
            },
            {
                "user": "aesopmulligan",
                "comment": "This is the exact kind of poem I want to find on Reddit. Keep em comin",
                "score": 1,
                "date": 1654212832.0
            },
            {
                "user": "dumsaint",
                "comment": "It may point to our hubris. That a frog, must bow to our existence. Had the poem been titled, \"Human,\" it would have been apt too. Great poem.",
                "score": 1,
                "date": 1654238551.0
            },
            {
                "user": "Deleted",
                "comment": "lmao",
                "score": 1,
                "date": 1654356826.0
            },
            {
                "user": "Brawnhilde",
                "comment": "Dude. \n\nFuck you, buddy.",
                "score": 1,
                "date": 1655276492.0
            },
            {
                "user": "AdventurousKick7167",
                "comment": "What's the poem say, what's it emoting, what's it written to make you feel. All of these can have different answers. The frog hopping away along with the title can indicate a feeling of isolation and rejection. It can also be that rejection you feel when you miss hit your last nail that is needed to finish putting a curtain up and it flips and rolls under the refrigerator. It can also be the simple creation for a laugh. The interesting thing about poetry is you get to choose.",
                "score": 1,
                "date": 1656253787.0
            },
            {
                "user": "Shadow_healer19",
                "comment": "I got to the point where I dont know howw to differ a mocking from normal way",
                "score": 1,
                "date": 1684922572.0
            },
            {
                "user": "Zozozozosososo",
                "comment": "Ahahahhahahahaha",
                "score": 1,
                "date": 1704392330.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[POEM] Masks by Shel Silverstein.",
        "author": "ExquisiteHaloo",
        "date": 1653207682.0,
        "score": 6964,
        "description": "",
        "comments": [
            {
                "user": "ExiledReturn",
                "comment": "YO LISTEN UP, HERE’S THE STORY",
                "score": 317,
                "date": 1653217489.0
            },
            {
                "user": "CasualSky",
                "comment": "This is great, essentially be yourself because you never know when trying to please or fit a role will have you miss out on a real connection. Being true to yourself will make you the happiest’",
                "score": 247,
                "date": 1653226018.0
            },
            {
                "user": "Deleted",
                "comment": "I know it isn’t about this - but this resonates with me as an autistic woman who heavily masks/ camouflages my autism.\n\nEven relate to the blue skin because I’ve always felt like an alien 🙃 I sometimes wonder how many fellow aliens I could have befriended if I wasn’t trying to hide myself.",
                "score": 52,
                "date": 1653242134.0
            },
            {
                "user": "The_Road_Goes_On",
                "comment": "This is what is was like being gay in the Midwest in the 80s.",
                "score": 83,
                "date": 1653232235.0
            },
            {
                "user": "Costume_Juliery",
                "comment": "I’m a huge Silverstein fan. \nThe Missing Piece and The Missing Piece Meets The Big O are probably my favourite’s. The message they share are timeless and beautiful 🙏🏻",
                "score": 29,
                "date": 1653230366.0
            },
            {
                "user": "KimchiFartings",
                "comment": "His face on The Giving Tree always scared me",
                "score": 27,
                "date": 1653217225.0
            },
            {
                "user": "bitchinbaby222",
                "comment": "Shel Silverstein inspired my love of poetry as a child",
                "score": 16,
                "date": 1653242939.0
            },
            {
                "user": "Timely-Chemistry7449",
                "comment": "In Japan, there's a philosophical concept that gets used a lot. [Honne and Tatemae](https://en.wikipedia.org/wiki/Honne_and_tatemae). I absolutely hate it. \n\nPublic face (demeanor/persona) and private face (nature/self).\n\nI only have one face. I only need one.",
                "score": 51,
                "date": 1653217935.0
            },
            {
                "user": "spinachsmile",
                "comment": "This was one of my favourite poems as a kid, and it resonates with me a lot more now. \n\nThank you for sharing!",
                "score": 10,
                "date": 1653241324.0
            },
            {
                "user": "iqraGR",
                "comment": "wow, it's so touching and true.",
                "score": 7,
                "date": 1653232623.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 15,
                "date": 1653212445.0
            },
            {
                "user": "PalpitationEasy113",
                "comment": "I love this, I feel like I'm constantly having to live like this all the time.",
                "score": 4,
                "date": 1653245742.0
            },
            {
                "user": "k42r46",
                "comment": "&#x200B;\n\n“Masks” approaches individualism explicitly though the diction, but implicitly using rhythm, and rhyme. Each line of the poem contains 4 significant syllables, except for “They searched for blue,” and “Then passed right by” which ends up sounding as though it has four when read out-loud, creating a very mechanical and strict syncopation. The rhythm highlights the lack of individualism the “he” and “she” conform to when they keep their “blue skin” hidden. The first four lines of the poem have an abcb rhyme scheme, while the last four lines have an AACA. Like the rhythm, the rhyme is very simple and really emphasizes how significant the conformity is in this poem. Although the rhyme is rather mechanical, the expected rhyme scheme for abcb would be abab. The two off rhymes signify a breaking away from the conformity and a return to the individual. The last four lights have an aaca rhyme, where one line stands out from the others to denote an individual deviating from the crowd.\n\nThe climax of the poem is when the two people pass by each other, but because they are pretending to be something they are not, they end up passing right by without knowing. These last three lines stood out the most to me because it changes the tone of the poem completely. “Their whole life through,” can be read as if they were searching through their whole life for someone like themselves, as well as their lives being over. Suddenly this simple message about being yourself takes a very serious and dark turn. In deciding to create a video interpretation about this poem, I had to choose whether to keep the same dark ending Silverstein imposes, or create my own. Instead I attempted to create a new emotion to add to the experience of being someone else through disruptive rhythm, extreme close-ups and a totally disjointed and unsatisfying ending.",
                "score": 3,
                "date": 1653489079.0
            },
            {
                "user": "dxs122",
                "comment": "I just read this one to my 6 year old son today.",
                "score": 3,
                "date": 1653259165.0
            },
            {
                "user": "Deleted",
                "comment": "me looking for other introverts, but then realizing they don't leave their houses either",
                "score": 3,
                "date": 1653279272.0
            },
            {
                "user": "DjDrezToroz",
                "comment": "Ive heard something like this before ... its good tho, makes me smile",
                "score": 8,
                "date": 1653209543.0
            },
            {
                "user": "farooq7",
                "comment": "🥺😭😭",
                "score": 6,
                "date": 1653224717.0
            },
            {
                "user": "godblessall789",
                "comment": "Nice",
                "score": 2,
                "date": 1653241157.0
            },
            {
                "user": "Openhartscience",
                "comment": "Which book is this one from?",
                "score": 2,
                "date": 1653270277.0
            },
            {
                "user": "Immediate-Yak6650",
                "comment": "AAM BLUE DA BA DEE DA BA DAAYY. DA BA DEE DA BA DAAY DA BA DEE DA BA DAAY.",
                "score": 2,
                "date": 1653286320.0
            },
            {
                "user": "Deleted",
                "comment": "r/im14andthisisdeep",
                "score": 2,
                "date": 1654052716.0
            },
            {
                "user": "uhhhhhh_cool",
                "comment": "Shel Silverstein has such creativity, and that's why he is an amazing poet. Each piece of poetry that he writes has an original, funny spin on it which makes all of them entertaining to read.",
                "score": 2,
                "date": 1658094374.0
            },
            {
                "user": "Deleted",
                "comment": "This is just utterly beautiful!",
                "score": 2,
                "date": 1665414201.0
            },
            {
                "user": "s-coups",
                "comment": "this reminded me of my autism and my inability to be my authentic self and genuinely connect with people",
                "score": 2,
                "date": 1683523676.0
            },
            {
                "user": "Jane_Genette",
                "comment": "Yeah, but it's not their fault ! They are traumatized because they are living in a social environment that attack them for being blue ! (I'm not a native english speaker)",
                "score": 1,
                "date": 1653242940.0
            },
            {
                "user": "AdventurousKick7167",
                "comment": "Was his name Sue. Appropriate these day.",
                "score": 1,
                "date": 1653248514.0
            },
            {
                "user": "Deleted",
                "comment": "This is too crazy I likessss 😆😌",
                "score": 0,
                "date": 1653237084.0
            },
            {
                "user": "MONTES_HERMINIOS",
                "comment": "so  niiiice!!",
                "score": 1,
                "date": 1653250775.0
            },
            {
                "user": "Deleted",
                "comment": "God damnit. When memes unexpectedly make you think about your own life",
                "score": 1,
                "date": 1653270862.0
            },
            {
                "user": "wander4wonder",
                "comment": "That hurt.",
                "score": 1,
                "date": 1654220437.0
            },
            {
                "user": "WorkingAd1546",
                "comment": "Lol.\n\nSilverstein.\nThought it was one of the berg stein, Cohen, owitz etc. Tribe.",
                "score": 1,
                "date": 1659313381.0
            },
            {
                "user": "InternRenu",
                "comment": "Awesome! It’s so relatable and heart touching.❤️💕",
                "score": 1,
                "date": 1661534565.0
            },
            {
                "user": "Smellthatfoot",
                "comment": "Made me teary eyed",
                "score": 1,
                "date": 1705162637.0
            }
        ]
    },
    {
        "flair": "",
        "title": "A Reminder [Poem]",
        "author": "Ordinary-Ad-7125",
        "date": 1646168898.0,
        "score": 6417,
        "description": "",
        "comments": [
            {
                "user": "Deleted",
                "comment": "Herbert Hoover said “older men declare war, but it is the youth that must fight and die.”",
                "score": 226,
                "date": 1646171765.0
            },
            {
                "user": "Zarkalark",
                "comment": "I cried reading this. I hate war",
                "score": 70,
                "date": 1646186353.0
            },
            {
                "user": "GeorgianQuadriga216",
                "comment": "Beautifully painful to read. Thank you for posting. Fates bless Ukraine.",
                "score": 46,
                "date": 1646197504.0
            },
            {
                "user": "liliacluna",
                "comment": "This brought up a strange thought in my head, we often commit crimes which won't affect us directly ( have the guts to) , imagine if prime ministers and presidents were to actively participate in wars in the fields battling, I'm pretty sure half of the wars would never take place in the first place.",
                "score": 35,
                "date": 1646221570.0
            },
            {
                "user": "contortionsinblue",
                "comment": "One of the great poets!!",
                "score": 19,
                "date": 1646187502.0
            },
            {
                "user": "Deleted",
                "comment": "I don't know who sold our land but I saw who paid the price. Wow, well said.",
                "score": 9,
                "date": 1646224124.0
            },
            {
                "user": "Marzipanarian",
                "comment": "Absolutely, soul tearing-ly, tragic.",
                "score": 15,
                "date": 1646174727.0
            },
            {
                "user": "MovingForward3556",
                "comment": "All wars are bankers and politicians wars.\nWhat business interests do the Bidens, Clintons, etc, etc. have in Ukraine?\nhttps://www.independentsentinel.com/warmongering-biden-hillary-have-deep-financial-ties-to-ukraine/\n\nWhat does Ukraine's military interests have to do with America?\nNothing.",
                "score": 6,
                "date": 1646247205.0
            },
            {
                "user": "mike-loves-gerudos",
                "comment": "Hopefully this wraps itself up soon",
                "score": 5,
                "date": 1646190111.0
            },
            {
                "user": "jedisummerbod",
                "comment": "Wow",
                "score": 4,
                "date": 1646184380.0
            },
            {
                "user": "Solidgoku",
                "comment": "War is insanity. its amazing what we can delude ourselves into believing is righteous through a series of reasoning processes and mental gymnastics. The only righteous war is to defend yourself and your people from an aggressor. Most wars are imperialistic however.",
                "score": 6,
                "date": 1646255070.0
            },
            {
                "user": "ssskeptisss",
                "comment": "anyone could provide what book the poem quoted from?",
                "score": 4,
                "date": 1646236937.0
            },
            {
                "user": "AdventurousKick7167",
                "comment": "This poem is an observation but not a new one. He has an eloquent style but the ideas are derivative. We will always have war. It's that simple, because there will always be conflicting ideas. As I say this I also say we don't have to accept that idea, indeed must not. But the greatest tragedy is when a war is not fun by generals but by politicians.",
                "score": 4,
                "date": 1656257678.0
            },
            {
                "user": "AK_akachi",
                "comment": "Poetic Justice :)",
                "score": 3,
                "date": 1646215777.0
            },
            {
                "user": "Stum6elina",
                "comment": "This gave me chills.",
                "score": 3,
                "date": 1646244126.0
            },
            {
                "user": "kitkat-xoxo",
                "comment": "It’s all the women waiting and the men doing something useful. Really disappointing when a poem theres such a beautiful last line",
                "score": 3,
                "date": 1649695775.0
            },
            {
                "user": "lilman445",
                "comment": "A good reminder that even when nations change borders, little actually changes on day to day life.",
                "score": 3,
                "date": 1703300154.0
            },
            {
                "user": "Prettyboi_zele",
                "comment": "👏🏽👏🏽👏🏽👏🏽",
                "score": 2,
                "date": 1646245639.0
            },
            {
                "user": "stanzalaik",
                "comment": "Thank you!",
                "score": 1,
                "date": 1646276986.0
            },
            {
                "user": "JDROD28",
                "comment": "I loved it, instant connection with the message",
                "score": 1,
                "date": 1646346432.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[Poem] The morning after I killed myself by Meggie Royer",
        "author": "beroemd",
        "date": 1585854534.0,
        "score": 6085,
        "description": "The morning after I killed myself, I woke up.\n\nI made myself breakfast in bed. I added salt and pepper to my eggs and used my toast for a cheese and bacon sandwich. I squeezed a grapefruit into a juice glass. I scraped the ashes from the frying pan and rinsed the butter off the counter. I washed the dishes and folded the towels.\n\nThe morning after I killed myself, I fell in love. Not with the boy down the street or the middle school principal. Not with the everyday jogger or the grocer who always left the avocados out of the bag. I fell in love with my mother and the way she sat on the floor of my room holding each rock from my collection in her palms until they grew dark with sweat. I fell in love with my father down at the river as he placed my note into a bottle and sent it into the current. With my brother who once believed in unicorns but who now sat in his desk at school trying desperately to believe I still existed.\n\nThe morning after I killed myself, I walked the dog. I watched the way her tail twitched when a bird flew by or how her pace quickened at the sight of a cat. I saw the empty space in her eyes when she reached a stick and turned around to greet me so we could play catch but saw nothing but sky in my place. I stood by as strangers stroked her muzzle and she wilted beneath their touch like she did once for mine.\n\nThe morning after I killed myself, I went back to the neighbors’ yard where I left my footprints in concrete as a two year old and examined how they were already fading. I picked a few daylilies and pulled a few weeds and watched the elderly woman through her window as she read the paper with the news of my death. I saw her husband spit tobacco into the kitchen sink and bring her her daily medication.\n\nThe morning after I killed myself, I watched the sun come up. Each orange tree opened like a hand and the kid down the street pointed out a single red cloud to his mother.\n\nThe morning after I killed myself, I went back to that body in the morgue and tried to talk some sense into her. I told her about the avocados and the stepping stones, the river and her parents. I told her about the sunsets and the dog and the beach.\n\nThe morning after I killed myself, I tried to unkill myself, but couldn’t finish what I started.",
        "comments": [
            {
                "user": "thisdistancehurts",
                "comment": "It's funny how the world works. Just a few minutes ago I was thinking of giving up, of how that too can be a solution. To try and distract myself I go onto reddit and find this. Thann you for your beautiful words. They mean more to me than you can ever imagine x",
                "score": 589,
                "date": 1585860464.0
            },
            {
                "user": "soapyaaf",
                "comment": "What style of poetry is this considered?  I am new to studying poetry and its various forms and genres.  All I know is that this seems pretty dark lol.",
                "score": 179,
                "date": 1585857030.0
            },
            {
                "user": "Deleted",
                "comment": "I love this. It’s the brightest haunting feeling i’ve ever read.",
                "score": 123,
                "date": 1585857481.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 235,
                "date": 1585855630.0
            },
            {
                "user": "hotlinehelpbot",
                "comment": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
                "score": 238,
                "date": 1585854547.0
            },
            {
                "user": "JVM_",
                "comment": "It conveys the same sentiments as this poem.\n\n [https://www.reddit.com/r/BoJackHorseman/comments/ewn0za/the\\_view\\_from\\_halfway\\_down\\_transcribed/](https://www.reddit.com/r/BoJackHorseman/comments/ewn0za/the_view_from_halfway_down_transcribed/)",
                "score": 78,
                "date": 1585858799.0
            },
            {
                "user": "TH0316",
                "comment": "This is the first poem I’ve ever read that made me cry. This is unbelievable. Thank you so much for sharing it with me",
                "score": 48,
                "date": 1585859787.0
            },
            {
                "user": "Deleted",
                "comment": "I jumped off a tall bridge in January, and I woke up in the hospital. I survived. The water was only 15 feet deep. No one has any idea how I am alive. I can now walk and talk and do everything normal. I'm still trying to process why I didn't die.",
                "score": 29,
                "date": 1585885045.0
            },
            {
                "user": "ladyaizen",
                "comment": "My eyes always tear up whenever I read this poem. It reminds me what I was going through when I was in middle school.",
                "score": 29,
                "date": 1585875354.0
            },
            {
                "user": "johnny_mac1",
                "comment": "It’s so specific and detailed. I feel transported to my own childhood.",
                "score": 22,
                "date": 1585873365.0
            },
            {
                "user": "Deleted",
                "comment": "The line about the mother holding the rocks is heart-rending.",
                "score": 16,
                "date": 1585871923.0
            },
            {
                "user": "KittyY21",
                "comment": "First time reading this and it's so powerful and drenched in melancholy. I really hope this poem finds someone who needs it.",
                "score": 31,
                "date": 1585858722.0
            },
            {
                "user": "valensmiles",
                "comment": "i just saw this on a depression sub and i had to come here to let you know how beautiful this is i love the repetitive small line throughout the poem and the meaning, the whole thing is amazing. great work thankyou for sharing this",
                "score": 13,
                "date": 1585884171.0
            },
            {
                "user": "Carranbieri",
                "comment": "Thank you. I needed this.",
                "score": 11,
                "date": 1585857486.0
            },
            {
                "user": "elftik",
                "comment": "Oh Meggie, you can’t imagine how I feel now, couldn’t hold my tears reading this, it is beautiful. My brother killed himself almost a month ago. It broke my heart so bad that it keeps bleeding in. I was talking with my sister yesterday; she was having a major crying episode, saying she feels like he regretted, she feels like he wants to come back, she must find a way to bring him back. My heart aches; I wish only there would be a way to bring him back.",
                "score": 11,
                "date": 1585928361.0
            },
            {
                "user": "cindifran",
                "comment": "Yes suicide is a permanent solution to a temporary problem.",
                "score": 8,
                "date": 1585899856.0
            },
            {
                "user": "Carvalho96",
                "comment": "I lost my sister to suicide last year, and found this poem. It haunts me. I wish she could unkill herself, but I hope she's at peace with her decision.",
                "score": 6,
                "date": 1635188777.0
            },
            {
                "user": "DredgenPreacher",
                "comment": "Wow that’s powerful",
                "score": 4,
                "date": 1585863634.0
            },
            {
                "user": "jackofangels",
                "comment": "I wish this helped me, but I'm glad it helps some others",
                "score": 4,
                "date": 1585884643.0
            },
            {
                "user": "moderducker233",
                "comment": "This is beautiful. Thank you for sharing",
                "score": 5,
                "date": 1585858888.0
            },
            {
                "user": "himanuuu",
                "comment": "don’t kill urself, plz",
                "score": 4,
                "date": 1585862338.0
            },
            {
                "user": "cupcakescream",
                "comment": "This helped me put things into perspective :)",
                "score": 4,
                "date": 1585863854.0
            },
            {
                "user": "dankupvoter04",
                "comment": "Ah god, it hit me hard in the gut.\n\n&#x200B;\n\nWell written. It carry such a strong mix of love and despair.",
                "score": 4,
                "date": 1585864013.0
            },
            {
                "user": "sullengrin",
                "comment": "Thank you.",
                "score": 4,
                "date": 1585867986.0
            },
            {
                "user": "1729yH",
                "comment": "Ohno i don't like the ending,,,",
                "score": 4,
                "date": 1585868767.0
            },
            {
                "user": "oxfordcommaon",
                "comment": "i love this so much. loved it for so long!",
                "score": 3,
                "date": 1585864903.0
            },
            {
                "user": "vEgandeLITE",
                "comment": "This is a great read!  I was engaged from start to finish. Great job of showing and not telling!  Love it 😇",
                "score": 3,
                "date": 1585868179.0
            },
            {
                "user": "xj0d13x",
                "comment": "Shit, I can't stop crying.",
                "score": 3,
                "date": 1585870326.0
            },
            {
                "user": "Octonaughty",
                "comment": "Wow",
                "score": 3,
                "date": 1585873023.0
            },
            {
                "user": "corLeon1s",
                "comment": "I'm glad I read this. Thanks for posting.",
                "score": 3,
                "date": 1585885400.0
            },
            {
                "user": "ReckItRyan",
                "comment": "This reminds me of the play \"Our Town\". Both have the same moral/underlying meaning. Would also recommend the poem \"Mindful\" by Mary Oliver, which is about appreciating life :) Thanks for sharing",
                "score": 3,
                "date": 1585886629.0
            },
            {
                "user": "Deleted",
                "comment": "God wanted me to read this. Thanks for sharing.\nMakes me want to cry.",
                "score": 3,
                "date": 1585898202.0
            },
            {
                "user": "maafna",
                "comment": "I'm crying.",
                "score": 3,
                "date": 1585906726.0
            },
            {
                "user": "zaddar1",
                "comment": " after i killed myself\n\ni reversed the world\n\nand was born into nothing",
                "score": 3,
                "date": 1585912252.0
            },
            {
                "user": "allo_is",
                "comment": "Why am I crying?",
                "score": 3,
                "date": 1585914066.0
            },
            {
                "user": "eddiestorm",
                "comment": "It's almost a masterpiece, maybe a few drafts away.  Ending is soft.  And death sounds too easy and free, not a horrible place.  Who knows what death is or a purgatory, maybe with an edge, intensity.",
                "score": 3,
                "date": 1586088267.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 3,
                "date": 1587504774.0
            },
            {
                "user": "IAmTheBadWolf22",
                "comment": "Someone knew I needed to read this tonight...thank you for sharing",
                "score": 3,
                "date": 1587943547.0
            },
            {
                "user": "leilavanora",
                "comment": "Rereading this as I had bookmarked it and bawling now",
                "score": 3,
                "date": 1590038127.0
            },
            {
                "user": "Wearewritteninpaint",
                "comment": "I read this, and i know i should feel something hope, regret , perhaps a fear of death. But i feel nothing, the words dont reach me. All i feel is numb.",
                "score": 3,
                "date": 1593834349.0
            },
            {
                "user": "Deleted",
                "comment": "I’ve played the main character (in youth) and most of the supporting characters now. Don’t live for you, live for me.",
                "score": 2,
                "date": 1585927108.0
            },
            {
                "user": "xxkatie_mayxx",
                "comment": "this is beautiful, thank you <3",
                "score": 2,
                "date": 1585935107.0
            },
            {
                "user": "veron1on1",
                "comment": "Best fucking poem ever! Thank you! I’m a simple man, with tears in my eyes, thanks to this, thanks to you. This should be published!",
                "score": 2,
                "date": 1585950405.0
            },
            {
                "user": "trashocpoet",
                "comment": "I cried",
                "score": 2,
                "date": 1586037389.0
            },
            {
                "user": "pnwestfall",
                "comment": "Thank you for this lovely piece. Absolutely beautiful writing and mind even if they can both be dark... you have provided a bit of light to this hopelessness I have been feeling for weeks.",
                "score": 2,
                "date": 1586232349.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 2,
                "date": 1586319673.0
            },
            {
                "user": "allende1973",
                "comment": "This is the morning after an acid trip lol",
                "score": 2,
                "date": 1586575782.0
            },
            {
                "user": "mostafaelhefnawy",
                "comment": "Omg, this is a Fantastic and amazing poem!",
                "score": 2,
                "date": 1586966776.0
            },
            {
                "user": "S3thr3y",
                "comment": "This really hits hard",
                "score": 2,
                "date": 1587681307.0
            },
            {
                "user": "bunni_bear_boom",
                "comment": "Reminds me of the view from halfway down",
                "score": 2,
                "date": 1588403345.0
            },
            {
                "user": "KYFBJNCVKH7",
                "comment": "this sucks\n\n(in my opinion)",
                "score": 2,
                "date": 1589910043.0
            },
            {
                "user": "xfrnk",
                "comment": "This is so incredibly powerful. Thank you.",
                "score": 2,
                "date": 1592692577.0
            },
            {
                "user": "Deleted",
                "comment": "Holy fuck",
                "score": 2,
                "date": 1595565846.0
            },
            {
                "user": "___houseplants",
                "comment": "Wow too good",
                "score": 2,
                "date": 1596476961.0
            },
            {
                "user": "TTEH3",
                "comment": "I like this. Stirring.",
                "score": 2,
                "date": 1597632822.0
            },
            {
                "user": "verydumbandsad",
                "comment": "this made me cry lol",
                "score": 2,
                "date": 1598177332.0
            },
            {
                "user": "FurryPopcornPorn",
                "comment": "It’s 11:08PM at my place and I’m crying",
                "score": 2,
                "date": 1598198932.0
            },
            {
                "user": "1michaelken",
                "comment": "Beautiful!",
                "score": 2,
                "date": 1599595052.0
            },
            {
                "user": "celeb-sev",
                "comment": "I remember reading this a few times during school. This is a somber yet absolutely beautiful poem that continues to send chills down my spine after every read.",
                "score": 2,
                "date": 1600968633.0
            },
            {
                "user": "off-chka",
                "comment": "This reminds me so much of the View from Halfway Down from Bojack Horseman. Beautiful, and hope it helps some people.",
                "score": 2,
                "date": 1635751493.0
            },
            {
                "user": "Whatnowwhatmore",
                "comment": "Needed this. Perfect",
                "score": 2,
                "date": 1636514117.0
            },
            {
                "user": "olutre",
                "comment": "One of the best and hardest reads of my life",
                "score": 2,
                "date": 1637768665.0
            },
            {
                "user": "P0rny5tuff",
                "comment": "Wow. That last line really hits me in the gut",
                "score": 2,
                "date": 1638418526.0
            },
            {
                "user": "Deleted",
                "comment": "I think this type poetry is truly the most beautiful",
                "score": 2,
                "date": 1638983791.0
            },
            {
                "user": "mdeeznutzh",
                "comment": "That is beautiful.",
                "score": 2,
                "date": 1641696190.0
            },
            {
                "user": "Deleted",
                "comment": "Thank you",
                "score": 2,
                "date": 1644035512.0
            },
            {
                "user": "_syed_ali__",
                "comment": "This is good",
                "score": 2,
                "date": 1648442728.0
            },
            {
                "user": "International_Lock34",
                "comment": "So beautiful, that is, the tragedy. Suicide  is such a big problem nowadays and this piece really delivers the thought that it is a permanent solution to a temporary problem. \nTo any young writers out there, read this and keep in mind how beautiful life is. A night may be bad but the next day brings beauty. Just stick around to see it  <3",
                "score": 2,
                "date": 1649410081.0
            },
            {
                "user": "imprintshearts",
                "comment": "This is the most overwhelming poem I have ever read. Fuck",
                "score": 2,
                "date": 1671348124.0
            },
            {
                "user": "Repulsive_Bit_4348",
                "comment": "So very powerful 🙏",
                "score": 2,
                "date": 1709851977.0
            },
            {
                "user": "Deleted",
                "comment": "fuck",
                "score": 2,
                "date": 1714271289.0
            },
            {
                "user": "Sasha_Persephone",
                "comment": "I love this....",
                "score": 2,
                "date": 1715830922.0
            },
            {
                "user": "Accomplished-Roof98",
                "comment": "Holy shit I did not expect to cry today",
                "score": 2,
                "date": 1716555862.0
            },
            {
                "user": "ByroniustheGreat",
                "comment": "I think I've seen this before on this sub",
                "score": 4,
                "date": 1585854566.0
            },
            {
                "user": "beroemd",
                "comment": "r/SeeAyeAye",
                "score": 1,
                "date": 1600625698.0
            },
            {
                "user": "pedicureproblems",
                "comment": ".",
                "score": 1,
                "date": 1585867287.0
            },
            {
                "user": "inihw",
                "comment": "i know ill never do it but god am i just so sad. and i know that im still young but so what. the part about family always brings me to tears. i know they havent been the best to me but god do i love them so so much and i know they love me too. i always come back to this poem once in a while and its makes me so sad, but in a way, it also reminds me beauty in this world. god do i just want to feel loved and valued by someone. i just want to be put first for once in my life.",
                "score": 1,
                "date": 1684916089.0
            },
            {
                "user": "crunchy_crop",
                "comment": "this made me sob so loudly and i haven’t been able to in a couple months so thank you i think. i just can’t process how. this made me cry because i know the message behind this is true but how. how am i supposed to want to live through this. with living it’s just loss after loss and i don’t know how i’m supposed to ever want to do this. i don’t need you to answer that question by the way it’s just what rings through my brain when i read this.",
                "score": 1,
                "date": 1686454806.0
            },
            {
                "user": "InherentlyAnnoying",
                "comment": "I was just thinking about the nothingness that comes after death, and then I stumbled upon this. I'm glad.",
                "score": 1,
                "date": 1691172512.0
            },
            {
                "user": "Dont_pet_the_cat",
                "comment": "I am crying. Thank you",
                "score": 1,
                "date": 1694196392.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[POEM] The Day of Our Divorce Hearing by Ruth Lepson",
        "author": "livestrong999",
        "date": 1654563204.0,
        "score": 5610,
        "description": "",
        "comments": [
            {
                "user": "encrypted_soul",
                "comment": "The complexities of human emotions is one of those things that will never fail to surprise me",
                "score": 588,
                "date": 1654572244.0
            },
            {
                "user": "foundthetallesttree",
                "comment": "Those last two lines.",
                "score": 250,
                "date": 1654572075.0
            },
            {
                "user": "MamiKali20",
                "comment": "I hear this often about divorces makes me sad and wonder",
                "score": 312,
                "date": 1654571638.0
            },
            {
                "user": "LightMeetsEarth",
                "comment": "So obviously this is sad, but I don't think it's only sad. I think there's a lot of beauty to be found in this particular state that sometimes exists right after a divorce. That kindness may not \"matter\" anymore, but when you admit that it isn't going to work and choose to rip the band aid off, you are embracing truth and in doing so you free yourself. And I think this type of kindness naturally follows from that. It's a beautiful little purgatory you can find yourself in, where you can openly talk and even laugh about what went wrong and what went right before your paths split for good.",
                "score": 117,
                "date": 1654590512.0
            },
            {
                "user": "inkotast",
                "comment": "I appreciate the lack of blame in this poem. It lends to the time and distance needed to fully process past trauma in a healthy way. The speaker does feel like they've moved on.",
                "score": 149,
                "date": 1654584226.0
            },
            {
                "user": "ironmagnesiumzinc",
                "comment": "Nostalgia of someone you loved/love and can't be with. That's the stuff of heartbreak.",
                "score": 73,
                "date": 1654575715.0
            },
            {
                "user": "itsdone20",
                "comment": "Got damn so much emotion packed into this",
                "score": 44,
                "date": 1654572575.0
            },
            {
                "user": "Deleted",
                "comment": "wow, this is freakin painful, excruciatingly beautifully written and thought of but confrontational to my worse fears :'( why is life so shit at things that are meant to be the most wondrous... definitely feeling so jaded about love and i'm a romantic so it's difficult to make peace with how i feel love is infallible and how people actually treat it.",
                "score": 23,
                "date": 1654575547.0
            },
            {
                "user": "whyamistillgettingha",
                "comment": "Wow that’s sad",
                "score": 22,
                "date": 1654572205.0
            },
            {
                "user": "coffeeandlaundry",
                "comment": "What publication is this from?",
                "score": 19,
                "date": 1654565332.0
            },
            {
                "user": "JVM_",
                "comment": "In Praise of Their Divorce - Tony Hoagland\n    \nAnd when I heard about the divorce of my friends,  \nI couldn't help but be proud of them,  \n  \nthat man and that woman setting off in different directions,  \nlike pilgrims in a proverb  \n  \n—him to buy his very own toaster oven,  \nher seeking a prescription for sleeping pills.  \n  \nLet us keep in mind the hidden forces  \nwhich had struggled underground for years  \n  \nto push their way to the surface—and that finally did,  \ncracking the crust, moving the plates of earth apart,  \n  \nreleasing the pent-up energy required  \nfor them to rent their own apartments,  \n  \nfor her to join the softball league for single mothers  \nfor him to read George the Giraffe over his speakerphone  \n  \nat bedtime to the six-year-old.  \n  \nThe bible says, Be fruitful and multiply  \n  \nbut is it not also fruitful to subtract and to divide?  \nBecause if marriage is a kind of womb,  \n  \ndivorce is the being born again;  \nalimony is the placenta one of them will eat;  \n  \nloneliness is the name of the wet-nurse;  \nregret is the elementary school;  \n  \nendurance is the graduation.  \nSo do not say that they are splattered like dropped lasagna  \n  \nor dead in the head-on collision of clichés  \nor nailed on the cross of their competing narratives.  \n    \nWhat is taken apart is not utterly demolished.  \nIt is like a great mysterious egg in Kansas  \n  \nthat has cracked and hatched two big bewildered birds.  \nIt is two spaceships coming out of retirement,  \n  \nflying away from their dead world,  \nthe burning booster rocket of divorce  \n  falling off behind them,   \n  \nthe bystanders pointing at the sky and saying, Look.",
                "score": 42,
                "date": 1654601158.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 23,
                "date": 1654573946.0
            },
            {
                "user": "Stagbiitle",
                "comment": "Really touching poem, but I have a question.\n\nYou guys have spaghetti places?? As in, restaurantes  specifically designed to serve spaghetti???",
                "score": 9,
                "date": 1654596619.0
            },
            {
                "user": "Any-Half-7103",
                "comment": "Well.  Shit.",
                "score": 8,
                "date": 1654578093.0
            },
            {
                "user": "yours_anonymously",
                "comment": "How beautiful it shook me and made me very sad.",
                "score": 8,
                "date": 1654578981.0
            },
            {
                "user": "lpyrrh",
                "comment": "Thanks for the cry",
                "score": 5,
                "date": 1654579564.0
            },
            {
                "user": "One_Neighborhood473",
                "comment": "i just looove imperfect-love poems\n\nThank you op for sharing this, will keep this with me.",
                "score": 7,
                "date": 1654584521.0
            },
            {
                "user": "timetraveller207",
                "comment": "I’m only one 1/2 year out from mine but this hits close to home. Ever since, I did find the girl of my dreams but the good memories still remain. Still hurts.",
                "score": 5,
                "date": 1654604247.0
            },
            {
                "user": "Calm_Point1844",
                "comment": "This is heartbreaking... Especially because I'm struggling in our marriage and considering divorce. I pray kindness comes back into our lives.",
                "score": 3,
                "date": 1654605228.0
            },
            {
                "user": "IndependentBonus",
                "comment": "I don't want to come across as inflammatory, but as someone who isn't a connoisseur of poetry, could someone explain to me what makes this a poem, rather than a paragraph with misplaced line breaks? \n\nI can appreciate the sentiment of the piece, but other than the line length, which appears arbitrary, nothing suggests to me that this is poetry rather than prose.",
                "score": 6,
                "date": 1654609498.0
            },
            {
                "user": "hellokomorebi",
                "comment": "Never married, never divorced. Still teared up :<",
                "score": 3,
                "date": 1654635001.0
            },
            {
                "user": "Cold_Snake",
                "comment": "Wow that's heartbreakingly beautiful",
                "score": 2,
                "date": 1654581007.0
            },
            {
                "user": "Pretty_rose-human",
                "comment": "Damn",
                "score": 2,
                "date": 1654585233.0
            },
            {
                "user": "chomstar",
                "comment": "That kindness matters. If they’d been a dick the memory would be much worse",
                "score": 2,
                "date": 1654603297.0
            },
            {
                "user": "Deleted",
                "comment": "Man something about this poem makes me feel real sadness in a way very little media ever can. It's like, the time when you brought out the best, it was already no longer needed. Like saving the good wine for when everyone was already drunk.",
                "score": 2,
                "date": 1654624945.0
            },
            {
                "user": "Bright_Appeal_5977",
                "comment": "Makes me wonder if healthy love even exists :(",
                "score": 2,
                "date": 1654628632.0
            },
            {
                "user": "-Ruairi-",
                "comment": "This feels like the average teenager's daily Instagram post.",
                "score": 2,
                "date": 1654646128.0
            },
            {
                "user": "tiny-vessels",
                "comment": "Wow those last 2 lines :/",
                "score": 1,
                "date": 1654620659.0
            },
            {
                "user": "Dyhanna279",
                "comment": "A lack of real intimacy is how it ended .Too many disillusionments to count . I gave up after 25 years. Still living with him , ten years later . I even went to court alone . The Last Word was concise, even wrote a song titled that , andI doubt he could think of a pertinent one that wasn’t prefabricated.",
                "score": 1,
                "date": 1654676539.0
            },
            {
                "user": "TimeMasterpiece2563",
                "comment": "I can’t handle when you talk about how we’re in the past :)(",
                "score": 1,
                "date": 1721987592.0
            },
            {
                "user": "OddDot7362",
                "comment": "I’m leaving this sub. You guys post the worst friggin poetry of all time. That’s what it’s Gould be called. Worstwordsthatrhyme or something. Shit doesn’t even rhyme. Makes me nauseous. Have to take a number 3.",
                "score": -20,
                "date": 1654600478.0
            },
            {
                "user": "sapjastuff",
                "comment": "The last two lines hit hard",
                "score": 1,
                "date": 1654590775.0
            },
            {
                "user": "Pale_Worldliness8285",
                "comment": "Profoundly sad. Hope they both went on to live their authentic lives.",
                "score": 1,
                "date": 1654601106.0
            },
            {
                "user": "Deleted",
                "comment": "Ouch. Reminds me of the last time I physically saw my ex.",
                "score": 1,
                "date": 1654615160.0
            },
            {
                "user": "SWAGPURSON",
                "comment": "That was sad ;-; wth trying to make me cry?",
                "score": 1,
                "date": 1654626367.0
            },
            {
                "user": "andrew_wessel",
                "comment": "Damn",
                "score": 1,
                "date": 1654632405.0
            },
            {
                "user": "Deleted",
                "comment": "So many lessons in this poem. It’s aching with what we cannot control in this life.",
                "score": 1,
                "date": 1654639177.0
            },
            {
                "user": "MaryConant",
                "comment": "There’s a punch to the gut!",
                "score": 1,
                "date": 1654639198.0
            },
            {
                "user": "kawiah",
                "comment": "Ouch.",
                "score": 1,
                "date": 1654639372.0
            },
            {
                "user": "Deleted",
                "comment": "This is a fine poem. But it’s his silver car Ruth. Leave the guy his pinto while you keep your Ferrari.",
                "score": 1,
                "date": 1654647958.0
            },
            {
                "user": "Fullswing_fratman",
                "comment": "👁",
                "score": 1,
                "date": 1655050138.0
            },
            {
                "user": "Janileighcohenmusic",
                "comment": "Oooof straight to the soul 🌹",
                "score": 1,
                "date": 1657143980.0
            },
            {
                "user": "SparklesTheRiot",
                "comment": "This really is what it feels like…",
                "score": 1,
                "date": 1659104873.0
            },
            {
                "user": "Deleted",
                "comment": "I didn’t want to get divorced. But I wish I could have at least had some kindness shown to me during it too. I’m crying ugly tears right now because I lost my marriage and my friend, and there’s not an ounce of kindness I can expect from him anymore",
                "score": 1,
                "date": 1666236757.0
            },
            {
                "user": "DimensionDesperate51",
                "comment": "In the end all the silent voices all the grudges all the superiority over your partner all the misery moments of words unspoken…. It doesn’t even matter!",
                "score": 1,
                "date": 1685167601.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[POEM] Untitled by Jarod K. Anderson",
        "author": "atmsd7",
        "date": 1658399876.0,
        "score": 5203,
        "description": "",
        "comments": [
            {
                "user": "BattleHardened",
                "comment": "\"Your old name is not your king... I dub thee 'protein'.\"",
                "score": 262,
                "date": 1658435417.0
            },
            {
                "user": "JVM_",
                "comment": "https://www.cryptonaturalist.com/\n\nThey also have a podcast, it's about various mythical creatures. The episodes I've listened to were like Bob Ross describing the life cycle of a deer, except it's some non-existent creature, just a chill odd listening experience.",
                "score": 125,
                "date": 1658406945.0
            },
            {
                "user": "polyybius",
                "comment": "This is very beautiful and effective— love the last two lines",
                "score": 117,
                "date": 1658405191.0
            },
            {
                "user": "El_Draque",
                "comment": "What interests me about this is the use of periods at the ends of lines. \n\nOn the one hand, there is no grammatical need for them, a comma works well between most lines. But even still, because there is a line break, there's also no need for the commas. So a comma, which is a less dramatic break between clauses, is grammatically preferred but formally unnecessary.\n\nIn addition to this, most online writing eschews formal punctuation. In texts, Twitter, and Reddit, many writers intentionally avoid final punctuation and even capitals. With all this, the periods take on a rather peculiar quality, one that (in my personal taste) attempts to compensate for an otherwise unexceptional poem.",
                "score": 39,
                "date": 1658435954.0
            },
            {
                "user": "AdventurousKick7167",
                "comment": "A different way at looking at vultures. A not so new way of looking at death, where in dying you merge with the godhead or you become part of the universe. The short sentences ending in periods come as sharp and suddenly as death itself.",
                "score": 9,
                "date": 1658495083.0
            },
            {
                "user": "Deleted",
                "comment": "Are we allowed to comment edits/rewrites? I’m new here, so please let me know if that’s not appreciated. \n\n\nThe vulture is a holy beast,  \ntending the dead beneath shrouded wings -  \nand bowing low it’s head, blooded, bared  \nto kiss cold flesh, it plucks the eyes  \nof kings, and priests, and commons,  \nand blind men.",
                "score": 7,
                "date": 1658598202.0
            },
            {
                "user": "Deleted",
                "comment": "Wow. I love how the imagery is somehow both macabre and strangely uplifting",
                "score": 6,
                "date": 1659648385.0
            },
            {
                "user": "SafeComfortable1009",
                "comment": "Great post, what a poem of wartime destiny! Ultimately the lowly creatures become the great ones, with the power to destroy a dynasty! Or as the poem says a name. \nTbone",
                "score": 4,
                "date": 1660496578.0
            },
            {
                "user": "Deleted",
                "comment": "[removed]",
                "score": 13,
                "date": 1658403575.0
            },
            {
                "user": "Deleted",
                "comment": ":) I enjoyed this very much. Thank you for posting",
                "score": 8,
                "date": 1658406352.0
            },
            {
                "user": "JDawnchild",
                "comment": "This popped up on my home feed out of nowhere and it's just as beautiful as it is unexpected.",
                "score": 4,
                "date": 1658436831.0
            },
            {
                "user": "SpecialKendrik",
                "comment": "The oneness of this is beautiful :)",
                "score": 2,
                "date": 1659457178.0
            },
            {
                "user": "Deleted",
                "comment": "This makes no sense",
                "score": 2,
                "date": 1658453432.0
            },
            {
                "user": "Woodmandans2da10uc",
                "comment": "I love an outstanding performance 👏",
                "score": 2,
                "date": 1658405776.0
            },
            {
                "user": "IrRetardred",
                "comment": "Beautiful. Thank you for this.",
                "score": 1,
                "date": 1658425062.0
            },
            {
                "user": "Living_on_Tulsa_Time",
                "comment": "I admire this poem so very much",
                "score": 1,
                "date": 1658432732.0
            },
            {
                "user": "museamusing",
                "comment": "this is great. thanks for sharing",
                "score": 1,
                "date": 1658432766.0
            },
            {
                "user": "badpeaches",
                "comment": "\"sky burial\" hold my coffee bitch",
                "score": -6,
                "date": 1658414761.0
            },
            {
                "user": "Jedidiah-Lex",
                "comment": "Ok, psychopath",
                "score": 0,
                "date": 1658449514.0
            },
            {
                "user": "Unlikely_Dare_9504",
                "comment": "Well, shit.",
                "score": 0,
                "date": 1658464436.0
            },
            {
                "user": "HermitHuldrekall",
                "comment": "That’s amazing I hate the name of the Twitter account I’m confused what’s the deal",
                "score": -28,
                "date": 1658410118.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[Poem] -Nayyirah Waheed",
        "author": "GoldenQM",
        "date": 1643081999.0,
        "score": 5136,
        "description": "",
        "comments": [
            {
                "user": "Dervoo",
                "comment": "“if someone \n\nasked if i was pissed off\n\ni would say no\n\nbut \n\nif asked if i was pissed on\n\nmy answer would be yes”\n\n- *Unknown*",
                "score": 178,
                "date": 1643135913.0
            },
            {
                "user": "Slytherinthemcheeks",
                "comment": "Facts. All facts. 🤌",
                "score": 44,
                "date": 1643084583.0
            },
            {
                "user": "aleamas",
                "comment": "Instapoets frustrate me. The \"insights\" are seldom insightful, the images, well, there are no images. I have read more profound thoughts scratched into the wall of a bathroom stall. To the extent that they interest more people in poetry, I can get behind them, but the content is inferior.",
                "score": 81,
                "date": 1643159152.0
            },
            {
                "user": "WilliamBlakefan",
                "comment": "It's a clever inversion.\n\nThat's it.\n\nExcept it's not even that clever.\n\nThe author takes a cliche that at least means something--vaguely--and inverts it to something that means nothing.\n\nIf your lover leaves you, there's still plenty of fish in the sea.\n\nBut if you leave you, the sea is only fishing.",
                "score": 57,
                "date": 1643134967.0
            },
            {
                "user": "narcissistrahul",
                "comment": "Another one I love from Nayyirah…\n\nYou split the ocean in half to be here. Only to meet nothing that wants you.\n- On immigrants.\n\nI feel Salt really has some pieces which hit heavy! <3",
                "score": 14,
                "date": 1643145718.0
            },
            {
                "user": "Deweydc18",
                "comment": "To make \n\nA long fucking story\n\nShort—\n\nI put a whole\n\nBag of jelly beans\n\nUp my ass\n\n\n—Rupi Kaur",
                "score": 21,
                "date": 1643569561.0
            },
            {
                "user": "Deleted",
                "comment": "Rupi Kaur vibes. Trite notion, short lines, no music. I sleep.",
                "score": 55,
                "date": 1643087345.0
            },
            {
                "user": "flipsgon",
                "comment": "ok",
                "score": 6,
                "date": 1643134473.0
            },
            {
                "user": "hlsinc",
                "comment": "if it weren't for the period at the end of the second-to-last line, i'd likely give this little more than a dismissive glance, perhaps even a groan.  as it is, makes us curious as to the contextual environment within which the author intended or chose for it to be apprehended. guess we have an excursion to make sometime in the near future.  thanks for that.",
                "score": 19,
                "date": 1643089132.0
            },
            {
                "user": "Budget_Leek511",
                "comment": "Sounds like a platitude to me.",
                "score": 4,
                "date": 1643134277.0
            },
            {
                "user": "Theres_a_cat_in_myTV",
                "comment": "Ouch, my heart.",
                "score": 3,
                "date": 1643129811.0
            },
            {
                "user": "EKGTech531",
                "comment": "What if your biological parents are the ones who didn't want you and you developed a close relationship with the American foster care system when you were 7 years old?",
                "score": 3,
                "date": 1643131262.0
            },
            {
                "user": "Crashingshores",
                "comment": "From Salt <3",
                "score": 4,
                "date": 1643091011.0
            },
            {
                "user": "DoctorStrangelove01",
                "comment": "Run of the mill insta-poem, over a thousand upvotes and only 11 comments. I'm guessing this is an ad.",
                "score": 12,
                "date": 1643116995.0
            },
            {
                "user": "FallonEtoile",
                "comment": "Very deep friend",
                "score": 5,
                "date": 1643086733.0
            },
            {
                "user": "Akuma_Hunter",
                "comment": "Facts. True facts my man",
                "score": 2,
                "date": 1643123714.0
            },
            {
                "user": "artist_anon_empath",
                "comment": "couldn't have told this better",
                "score": 2,
                "date": 1643125920.0
            },
            {
                "user": "Deleted",
                "comment": "Is this a translation?",
                "score": 2,
                "date": 1643130995.0
            },
            {
                "user": "nap-and-a-crap",
                "comment": "Well fuck this poem was slammed in the comments but this resonated very strongly. More so the last line but still.",
                "score": 2,
                "date": 1713728026.0
            },
            {
                "user": "Abroad_Vagabond",
                "comment": "So much truth in so few words.",
                "score": 2,
                "date": 1643110039.0
            },
            {
                "user": "DesiDaisy12",
                "comment": "So many people I want to send this to, but I worry it'll depress them even more 😂",
                "score": 1,
                "date": 1715168901.0
            },
            {
                "user": "ThiccStorms",
                "comment": "this is beautiful.",
                "score": 1,
                "date": 1717084463.0
            },
            {
                "user": "Deleted",
                "comment": "Not ending, all is you’r failure and jerk from borrowing words .",
                "score": 0,
                "date": 1643090760.0
            },
            {
                "user": "angelicabess",
                "comment": "she’s so brilliant",
                "score": 0,
                "date": 1643143541.0
            },
            {
                "user": "SushantBag",
                "comment": "Ouch!",
                "score": 1,
                "date": 1643102120.0
            },
            {
                "user": "linkuei-teaparty",
                "comment": "So true...",
                "score": 1,
                "date": 1643108496.0
            },
            {
                "user": "Shadow_healer19",
                "comment": "I think i am going through this bloody situation. Its like a trap, I dont know the way out. I dont want to take any hands bcoz am afraid it is to crush me even further.",
                "score": 1,
                "date": 1684922472.0
            },
            {
                "user": "lilman445",
                "comment": "Love yourself ❤️",
                "score": 1,
                "date": 1703300380.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[POEM] In honor of International Haiku Poetry Day",
        "author": "Tcav23",
        "date": 1650251937.0,
        "score": 4881,
        "description": "",
        "comments": [
            {
                "user": "KotKrot12",
                "comment": "Who is the talented poet?",
                "score": 179,
                "date": 1650252800.0
            },
            {
                "user": "ThrowMeWhileYouCan",
                "comment": "Such immaculate magnificence! The amount of emotions and sheer primal lust for power this poet describes in such simple words is simply incredible.\n\nBrought a tear to my eye.",
                "score": 95,
                "date": 1650254962.0
            },
            {
                "user": "jackoats_lantern",
                "comment": "The blue shell. Ruining friendship since N64.",
                "score": 62,
                "date": 1650255481.0
            },
            {
                "user": "Deleted",
                "comment": "Your mom is so fat\n\nI feel bad to insult her\n\nShe remembers me",
                "score": 42,
                "date": 1650257650.0
            },
            {
                "user": "Bizmarquee12",
                "comment": "Hey, every line forms a complete thought. Nice.",
                "score": 35,
                "date": 1650255027.0
            },
            {
                "user": "spunlikespidermike",
                "comment": "Seriously the blue shell is a huge fuck you to the guy in first lol. The only people who can get it are in the back of the race so it literally doesn't benefit that person at all it's just a fuck you to the guy in first.",
                "score": 23,
                "date": 1650262082.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 34,
                "date": 1650255444.0
            },
            {
                "user": "lilac978",
                "comment": "I did it loser\n\nYou’re not gonna win this race\n\nEnjoy last place bitch",
                "score": 13,
                "date": 1650314835.0
            },
            {
                "user": "Deleted",
                "comment": "Good lord. Give the man a goddamn Pulitzer and let's be done with it.",
                "score": 10,
                "date": 1650265534.0
            },
            {
                "user": "danarchism95",
                "comment": "Nah but. Seriously.",
                "score": 5,
                "date": 1650255319.0
            },
            {
                "user": "homeofthewildhag",
                "comment": "Gorgeous 🤌🏻 💋",
                "score": 5,
                "date": 1650288851.0
            },
            {
                "user": "Suspekt_1",
                "comment": "Such elegance and class! Basho bows to you!",
                "score": 4,
                "date": 1650296150.0
            },
            {
                "user": "flustercuck91",
                "comment": "i feel this SO poignantly",
                "score": 5,
                "date": 1650301367.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 3,
                "date": 1650273157.0
            },
            {
                "user": "tanzaniansurfowl",
                "comment": "This really captures the true sentiment of playing Mario kart. I applaud you",
                "score": 3,
                "date": 1650309631.0
            },
            {
                "user": "Practical-Wedding-57",
                "comment": "I’m telling you those blue shells ruin friendships 😂amazing haiku btw✨",
                "score": 3,
                "date": 1650310987.0
            },
            {
                "user": "Gabriellephant_",
                "comment": "THIS.",
                "score": 2,
                "date": 1650315032.0
            },
            {
                "user": "Poetry_duderino",
                "comment": "I approve.",
                "score": 2,
                "date": 1650321137.0
            },
            {
                "user": "Leather-Play-9028",
                "comment": "You just summarized the TV series Beef in a (nut)shell.",
                "score": 1,
                "date": 1681101684.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[Poem] In this short life that only lasts an hour By Emily Dickinson",
        "author": "Mikxq_13",
        "date": 1643727967.0,
        "score": 4490,
        "description": "",
        "comments": [
            {
                "user": "melonlorde",
                "comment": "one of the greatest poems ever, and she wrote it [on an envelope flap](https://lavenderpoems.com/wp-content/uploads/2013/12/emily-dickinson-poem.jpg)\n\nmakes you wonder how many great poems never saw the light of day",
                "score": 139,
                "date": 1643744319.0
            },
            {
                "user": "Deleted",
                "comment": "“I, however,\n\nHave such meager\nPower,\n\nClutching at a\nMoment,\n\nWhile you control\nAn hour.\n\nBut your hour is\nA stone.\n\nMy moment is\nA flower.”\n-Langston Hughes",
                "score": 73,
                "date": 1643791118.0
            },
            {
                "user": "Spear-of-Stars",
                "comment": "Pretty much the Big Book synopsized in four lines.",
                "score": 60,
                "date": 1643729367.0
            },
            {
                "user": "Lost_In_A_Forest_",
                "comment": "Emily Dickinson... The original instapoet.  \n\n&#x200B;\n\n&#x200B;\n\nedit: this is a joke, Dickinson is one of my faves.",
                "score": 86,
                "date": 1643742135.0
            },
            {
                "user": "Domain_of_Arnheim",
                "comment": "One of my favorite Dickinson poems. So much content and feeling in just a few words.",
                "score": 12,
                "date": 1643738444.0
            },
            {
                "user": "nortonanthologie",
                "comment": "“It’s all a big nothing”",
                "score": 12,
                "date": 1643742484.0
            },
            {
                "user": "asingoat",
                "comment": "Gotta love ED 💚",
                "score": 8,
                "date": 1643733071.0
            },
            {
                "user": "Astonishment49",
                "comment": "Love this one",
                "score": 6,
                "date": 1643732123.0
            },
            {
                "user": "thoughtflight",
                "comment": "This was a question on jeopardy tonight and I got it thanks to this subreddit!",
                "score": 5,
                "date": 1643860305.0
            },
            {
                "user": "DangerousAndStubborn",
                "comment": "Does anyone know which book this is from?",
                "score": 5,
                "date": 1644656326.0
            },
            {
                "user": "herbie2399",
                "comment": "i was just thinking this how long is life when you really look at it whats the point really i can change my surroundings but what about yours",
                "score": 2,
                "date": 1643751279.0
            },
            {
                "user": "cactusfairy95",
                "comment": "Meh. the only original part of that is it lasts an hour. It's mostly a  thought anyone could have.",
                "score": -6,
                "date": 1643757396.0
            },
            {
                "user": "dohalims_rings",
                "comment": "Any suggestions on poets? Iv'e read Maggie Nelson, Sappho, Edgar Allan Poe, pretty much the basics. Suggestions on poetry similar to theirs is what I'm searching for.",
                "score": 11,
                "date": 1643765686.0
            },
            {
                "user": "Deleted",
                "comment": "Says it all",
                "score": 1,
                "date": 1643752803.0
            },
            {
                "user": "IGMCh",
                "comment": "Lovely",
                "score": 1,
                "date": 1643753869.0
            },
            {
                "user": "Deleted",
                "comment": "makes one wonder",
                "score": 1,
                "date": 1643784066.0
            },
            {
                "user": "Shubham_Nagre",
                "comment": "What does that \"that\" Is referred Here?? \n \"That only lasts an Hour\"",
                "score": 1,
                "date": 1655173673.0
            }
        ]
    },
    {
        "flair": "",
        "title": "[POEM] “The Woodchuck” by Sam Pink",
        "author": "Deleted",
        "date": 1659616905.0,
        "score": 4472,
        "description": "",
        "comments": [
            {
                "user": "flumppppp",
                "comment": "This poem has been flagged to the mods, many people have enjoyed it and I will not remove it however OP you have posted *a lot* of Sam Pink content in just the space of two days which could be considered spam so please bear that in mind; we want to keep this a community with varied and quality poetry for everyone to enjoy",
                "score": 1,
                "date": 1659629791.0
            },
            {
                "user": "smotherz",
                "comment": "I really like how everyone is arguing about whether this poem is good or bad. It’s so silly and it makes me happy that it gets people passionately responding.",
                "score": 274,
                "date": 1659631512.0
            },
            {
                "user": "xiii--iiix",
                "comment": "I actually got to laugh out loud today.  Thanks OP.",
                "score": 205,
                "date": 1659624237.0
            },
            {
                "user": "snorkelinthesea",
                "comment": "OP, do you know what book this and/or “piece a shit” are from? These hit my sense of humor so hard. I’m not sure if I should be concerned.",
                "score": 42,
                "date": 1659650792.0
            },
            {
                "user": "divainthestars",
                "comment": "Scrolling through the comments watching you guys go full Omaha Beach over a Sam Pink poem is peak literary community.",
                "score": 19,
                "date": 1659687752.0
            },
            {
                "user": "haintspookem",
                "comment": "His fiction is pretty good too. \n\nCheck out 'The Ice Cream Man and Other Stories'.",
                "score": 35,
                "date": 1659630022.0
            },
            {
                "user": "Deleted",
                "comment": "I like this poem; it’s silly and succinct.  \nThe reason I enjoy this sub is that I can be exposed to a broad variety of poetry, some that I’m familiar with, many others I’m not.",
                "score": 62,
                "date": 1659626121.0
            },
            {
                "user": "Deleted",
                "comment": "“Life is serious but art is fun!” \n- John Irving",
                "score": 79,
                "date": 1659623843.0
            },
            {
                "user": "sussyballsamogus6996",
                "comment": "Sorry OP, we only accept poems that have deep philosophical and emotional meaning, typically those referring to depression or romance. Anything funny or different to what is being mass-produced is unacceptable. Please don't make this mistake again.",
                "score": 129,
                "date": 1659625980.0
            },
            {
                "user": "lemonSoph",
                "comment": "I like it...fight me. Lol",
                "score": 12,
                "date": 1659640032.0
            },
            {
                "user": "_Beautiful_disaster2",
                "comment": "Definitely made me smile 😂 thank you for that",
                "score": 16,
                "date": 1659633276.0
            },
            {
                "user": "SpiteFueled",
                "comment": "I’m crying omg I love it too much",
                "score": 4,
                "date": 1659639566.0
            },
            {
                "user": "FrostyTheSasquatch",
                "comment": "I will always upvote this poet because his poems make people SO ANGRY on this sub 😝",
                "score": 17,
                "date": 1659638690.0
            },
            {
                "user": "Deleted",
                "comment": "Lazy and uninspired Facebook mom level junk",
                "score": 5,
                "date": 1659637009.0
            },
            {
                "user": "LuckyReception6701",
                "comment": "Not my cup of tea, but hey if people like it, then who are we to judge?",
                "score": 8,
                "date": 1659634115.0
            },
            {
                "user": "Sufficient_Bobcat_54",
                "comment": "I can only think about the Bojack Horseman character woodchuck and the last line (iykyk)...",
                "score": 3,
                "date": 1659644183.0
            },
            {
                "user": "FrontiersWoman",
                "comment": "Stupid piece of shit.",
                "score": 3,
                "date": 1659666880.0
            },
            {
                "user": "BaileyLikesBooks",
                "comment": "Was not expecting that final line 💀",
                "score": 3,
                "date": 1659667601.0
            },
            {
                "user": "ZarkTheMuffin",
                "comment": "I know it doesn’t sound like a poem- but it’s just so chaotic and tiny witch hat on a woodchuck idk this is amazing xD",
                "score": 3,
                "date": 1659672455.0
            },
            {
                "user": "Lianidis",
                "comment": "I didn't see the ending coming to the last Sam Pink poem you posted. I also didn't see it coming to this one. Fool me once, shame on you, fool me twice, shame on me! Both times made me laugh regardless haha.",
                "score": 5,
                "date": 1659638157.0
            },
            {
                "user": "Deleted",
                "comment": "So many trash “poems” in this sub lately.",
                "score": 49,
                "date": 1659619833.0
            },
            {
                "user": "kingdomphylumm",
                "comment": "this is amazing",
                "score": 4,
                "date": 1659633219.0
            },
            {
                "user": "ccbaby2000",
                "comment": "The last line ruined it it just sounds pretentious now",
                "score": 12,
                "date": 1659632359.0
            },
            {
                "user": "youreddmymind",
                "comment": "I absolutely loved this. Thank you for the laugh.",
                "score": 4,
                "date": 1659650715.0
            },
            {
                "user": "Deleted",
                "comment": "I don’t like this poem tbh",
                "score": 11,
                "date": 1659624547.0
            },
            {
                "user": "AvaireBD",
                "comment": "10/10",
                "score": 2,
                "date": 1659644890.0
            },
            {
                "user": "TacoSwimmer",
                "comment": "That got me a good chuckle. What a great poem!",
                "score": 2,
                "date": 1659650693.0
            },
            {
                "user": "zeltrexeronland",
                "comment": "Is this a Spenserian sonnet?",
                "score": 2,
                "date": 1659664345.0
            },
            {
                "user": "Deleted",
                "comment": "This may be one of my fave poems going forward",
                "score": 2,
                "date": 1659678421.0
            },
            {
                "user": "The_Red_Baron__",
                "comment": "What'd the woodchuck ever do to him?",
                "score": 2,
                "date": 1659681848.0
            },
            {
                "user": "overlordmeow",
                "comment": "oh \n\nthis is art. absolute perfection.\n\nI've never related to anything harder in my life.",
                "score": 4,
                "date": 1659633578.0
            },
            {
                "user": "theycallmellams",
                "comment": "Needed that little chuckle today 😅",
                "score": 2,
                "date": 1659653355.0
            },
            {
                "user": "Deleted",
                "comment": "random commenter: I don’t like this poem so much, I don’t think it’s that clever.\n\nOP: wHy ArE yOu So AnGrY aNd SeNsItIvE!?!",
                "score": 4,
                "date": 1659721006.0
            },
            {
                "user": "Deleted",
                "comment": "Serious question. What makes this a poem? I'm not trying to say it isn't. I'm just trying to understand.",
                "score": 4,
                "date": 1659642962.0
            },
            {
                "user": "FourFromBFDI",
                "comment": "Can we have poems that actually have a good meaning instead of somebody talking trash to an animal or object or person",
                "score": 9,
                "date": 1659621947.0
            },
            {
                "user": "Deleted",
                "comment": "[deleted]",
                "score": 2,
                "date": 1659629560.0
            },
            {
                "user": "idunnololz101",
                "comment": "This made me happy, great post!",
                "score": 2,
                "date": 1659634785.0
            },
            {
                "user": "AdventurousKick7167",
                "comment": "I would critique this poem as considering two opposing combatants where you find a lack of trust , one for the other, where you find the distrust to be fully warranted. Then again , it could be a poem about a damn groundhog.",
                "score": 2,
                "date": 1659641146.0
            },
            {
                "user": "Cathy655",
                "comment": "I don't understand this poem, can someone explain?",
                "score": 2,
                "date": 1659628568.0
            },
            {
                "user": "harliequin",
                "comment": "I relate very closely with this poem! :P",
                "score": 3,
                "date": 1659631137.0
            },
            {
                "user": "CupidLina",
                "comment": "LOL never laughed at a poem before I love it",
                "score": 2,
                "date": 1659638909.0
            },
            {
                "user": "unstoppabru",
                "comment": "Must be nice farming karma with the same author over and over - especially when the author has the sense of humor as a 15 year old.",
                "score": 2,
                "date": 1659629749.0
            },
            {
                "user": "ObjectiveJackfruit35",
                "comment": "This guy gets paid? Yikes.",
                "score": 0,
                "date": 1659633407.0
            },
            {
                "user": "amberinautumn",
                "comment": "best thing i’ve ever read",
                "score": 1,
                "date": 1659630350.0
            },
            {
                "user": "campionmusic51",
                "comment": "this is a good poem.",
                "score": 1,
                "date": 1659630911.0
            },
            {
                "user": "OwnHighlight9721",
                "comment": "New favorite poem",
                "score": 1,
                "date": 1659631353.0
            },
            {
                "user": "CrownofLead3680",
                "comment": "If this is supposed to be funny, then it's great.",
                "score": 1,
                "date": 1659634211.0
            },
            {
                "user": "SneedyK",
                "comment": "Starting to like Sam Pink thanks to this sub",
                "score": -8,
                "date": 1659619281.0
            },
            {
                "user": "chaddy292",
                "comment": "Funny and entertaining sure but does this really count as a poem?",
                "score": 0,
                "date": 1659669529.0
            },
            {
                "user": "ComplexChild",
                "comment": "u/a_medical_mystery",
                "score": -1,
                "date": 1659630912.0
            },
            {
                "user": "theskyispink16",
                "comment": "Highlight of my day , I loveeee",
                "score": 1,
                "date": 1659682680.0
            },
            {
                "user": "Snoo_72113",
                "comment": "what book is this from?",
                "score": 1,
                "date": 1681587969.0
            }
        ]
    }
]