[
    {
        "flair": "Discussion",
        "title": "The FCC is about to kill net neutrality. We’re protesting nationwide on Dec 7th to stop them.",
        "author": "JPTIII",
        "date": 1511296151.0,
        "score": 147938,
        "description": "**tldr: The FCC is about to kill net neutrality. We’re protesting nationwide on Dec 7th to stop them.\nHead over to http://www.verizonprotests.com/ for more info.**\n\n**WHAT’S HAPPENING?**\nThe Federal Communications Commission (FCC) just [announced](https://www.techdirt.com/articles/20171120/11253438653/fcc-plan-to-use-thanksgiving-to-hide-attack-net-neutrality-vastly-underestimates-looming-backlash.shtml) its plan to slash net neutrality rules, allowing ISPs like Verizon to block apps, slow websites, and charge fees to control what you see & do online. They vote December 14th. People from across the political spectrum are outraged, so we’re planning to protest at Verizon retail stores across the country on December 7, one week before the vote and at the peak of the busy Holiday shopping season. We'll demand that our members of Congress take action to stop Verizon's puppet FCC from killing net neutrality.\n\n**WHAT’S NET NEUTRALITY?**\nNet neutrality is the [basic principle](https://www.theatlantic.com/technology/archive/2014/05/the-case-for-rebooting-the-network-neutrality-debate/361809/) that has made the Internet into what it is today. It prevents big Internet Service Providers (like Verizon) from charging extra fees, engaging in censorship, or controlling what we see and do on the web by throttling websites, apps, and online services.\n\n**WHY VERIZON STORES?**\nThe new chairman of the FCC, Ajit Pai, is a former top lawyer for Verizon, and the company has been spending millions on [lobbying](https://www.theverge.com/2017/7/12/15959932/comcast-verizon-att-net-neutrality-day-of-action) and lawsuits to kill net neutrality so they can gauge us all for more money. By protesting at Verizon stores, we’re shining light on the corruption and demanding that our local do something about it. Only Congress has the power to stop Verizon's puppet FCC, so at the protests we'll be calling and tweeting at legislators, and in cities where it's possible we'll march from Verizon stores to lawmakers offices.\n\n**WHAT ARE OUR DEMANDS?**\nAjit Pai is clearly still working for Verizon, not the public. But he still has to answer to Congress. So we’re calling on our lawmakers to do their job overseeing the FCC and speak out against Ajit Pai’s plan to gut Title II net neutrality protections and give Verizon and other giant ISPs everything on their holiday wishlist. \n\n**HOW CAN I JOIN?**\n[Click here](https://events.battleforthenet.com/#eventType=protestrally) and you’ll find an interactive map where you can see if there is already a protest planned near you. If not, you can [sign up to host one](http://act.demandprogress.org/event/team-internet/create/), and we’ll send you materials to make it easy and help you recruit others in your area. These protests will be quick, fun, and 100% legal. If you can’t attend a protest on December 7th, you can still help defend net neutrality by [calling your lawmakers](http://battleforthenet.com/) and spreading the word on social media. You can also sign up to host a meeting with your members of Congress, or volunteer for our texting team to help turn people out for these protests.",
        "comments": [
            {
                "user": "Badman_Battle",
                "comment": "***Wanna do something about Net Neutrality??*** \n\n//// here’s how... \n\nThe FCC’s Republican chairman, Ajit Pai—isn’t going to get away with repealing net neutrality.. \n\nGo to www.gofccyourself.com \n——> click Express\n\n———> then say: “ Chairman Ajit Pai, I specifically support strong net neutrality, backed by title II oversight of ISP’s. \n\nPRESERVE NET NEUTRALITY & TITLE II “",
                "score": 2391,
                "date": 1511305032.0
            },
            {
                "user": "JesusIsMyZoloft",
                "comment": "Is there going to be another [internet blackout](https://en.wikipedia.org/wiki/Protests_against_SOPA_and_PIPA) like the one in 2012?",
                "score": 477,
                "date": 1511308215.0
            },
            {
                "user": "amarian1981",
                "comment": "I have emailed my congressman. I know it’s not doing much but I want to contribute in some way. \n\nEdit: I called my congressman and was sent to VM. I will continue to call and email. Writing a letter also to send out today. It’s been a long time since I’ve written a letter but doing what I can to help out. ",
                "score": 292,
                "date": 1511305760.0
            },
            {
                "user": "jaypooner",
                "comment": "So if you haven't already, there's a bot you can text, that helps you write an email or a fax, free of charge, to your senator, or governor. Text \"resist\" to \"504-09\" and it'll ask you some questions, then you're onto writing. From another thread a few weeks ago, someone posted this message, and it think it's a great one to send.\n\n\"Net Neutrality is the cornerstone of innovation, free speech and democracy on the Internet.\n\nControl over the Internet should remain in the hands of the people who use it every day. The ability to share information without impediment is critical to the progression of technology, science, small business, and culture.\n\nPlease stand with the public by protecting Net Neutrality once and for all.\"\n\nI'd love to credit the user, but have lost the comment, but please, go send some faxes, show your politicians you want net neutrality to stay.",
                "score": 380,
                "date": 1511298521.0
            },
            {
                "user": "Im_Jedi_Rick",
                "comment": "Bare in mind, not a single citizen has asked for net neutrality to be repealed. This is in the best interest of absolutely nobody except the corporations. A sad indictment of how this country and your rights and liberties are being sold off, on by one, to the highest bidder  ",
                "score": 88,
                "date": 1511310265.0
            },
            {
                "user": "NetNeutralityBot",
                "comment": "[To learn about Net Neutrality, why it's important, and/or want tools to help you fight for Net Neutrality, visit BattleForTheNet](https://www.battleforthenet.com)\n\nYou can support groups like the Electronic Frontier Foundation and the ACLU and Free Press who are fighting to keep Net Neutrality:\n\n* https://www.eff.org/\n* https://www.aclu.org/\n* https://www.freepress.net/\n* https://www.fightforthefuture.org/\n* https://www.publicknowledge.org/\n* https://www.demandprogress.org/\n\n[Set them as your charity on Amazon Smile here](https://smile.amazon.com/)\n\nWrite to your [House Representative here](http://www.house.gov/representatives/find/) and [Senators here](https://www.senate.gov/general/contact_information/senators_cfm.cfm?OrderBy=state)\n\n[Write to the FCC here](https://www.fcc.gov/about/contact)\n\n[Add a comment to the repeal here](https://www.fcc.gov/ecfs/search/filings?proceedings_name=17-108&amp;sort=date_disseminated,DESC)\n\n[Here's an easier URL you can use thanks to John Oliver](http://www.gofccyourself.com)\n\n[You can also use this to help you contact your house and congressional reps.](https://resistbot.io/) It's easy to use and cuts down on the transaction costs with writing a letter to your reps\n\n[Also check this out](https://democracy.io/#!/), which was made by the EFF and is a low transaction cost tool for writing all your reps in one fell swoop.\n\nMost importantly, ***VOTE***. This should not be something that is so clearly split between the political parties as it affects all Americans, but unfortunately it is.\n\n*If you would like to contribute to the text in this bot's posts, [please edit this file](https://github.com/tylerbrockett/NetNeutralityBot-Reddit/blob/master/src/resources/message.txt) on github.*\n\n\t \n\t \n-/u/NetNeutralityBot\n\t \n\t \n[Contact Developer](https://www.reddit.com/message/compose/?to=tylerbrockett) | [Bot Code](https://github.com/tylerbrockett/NetNeutralityBot-Reddit) | [Readme](https://github.com/tylerbrockett/NetNeutralityBot-Reddit/blob/master/README.md)\n",
                "score": 85,
                "date": 1511308397.0
            },
            {
                "user": "amarian1981",
                "comment": "No response yet. Florida, Brian Mast. ",
                "score": 57,
                "date": 1511306578.0
            },
            {
                "user": "ThaDankchief",
                "comment": "i will be at the protest in my area thanks to this post! ",
                "score": 71,
                "date": 1511301373.0
            },
            {
                "user": "MacGuyver247",
                "comment": "Canadian here. I'm rooting for you all! Go team internet!",
                "score": 64,
                "date": 1511309938.0
            },
            {
                "user": "I_Luv_Barney",
                "comment": "I submitted a comment on FCC's page but I know they'll ignore it:\n\n***Repealing net neutrality opens the door to potential manipulation of every citizen's access to the world wide web. The Internet isn't just some goofy toy for millennials, it's actually necessary in modern life for things like applying for jobs and paying bills. There are many internet-based businesses as well, and restricting access to certain parts of the web is in effect disrupting he free market and free speech. This is anti-American behavior by the FCC and will not be tolerated.***",
                "score": 52,
                "date": 1511309672.0
            },
            {
                "user": "xo1opossum",
                "comment": "Net neutrality should be made a amendment!!!",
                "score": 63,
                "date": 1511309012.0
            },
            {
                "user": "noott",
                "comment": "There's no protest scheduled in DC?  Really?",
                "score": 14,
                "date": 1511309419.0
            },
            {
                "user": "RhalezFlavis",
                "comment": "I love that this is something that unites us. Forget what side of the political spectrum you're on, this is plain disgusting.",
                "score": 12,
                "date": 1511312427.0
            },
            {
                "user": "Leradine",
                "comment": "Why isn't the FCC getting the reddit hug of death? We've dealt with bigger sites and broke the site.",
                "score": 23,
                "date": 1511310726.0
            },
            {
                "user": "wyvernwy",
                "comment": "\nOne solution for the internet would be for the Free Countries to null route traffic to and from the Rogue Nations like the US.  Problem solved.",
                "score": 32,
                "date": 1511306455.0
            },
            {
                "user": "columbiatch",
                "comment": "Why protest on a Thursday instead of during the weekend?",
                "score": 29,
                "date": 1511307268.0
            },
            {
                "user": "Raspberries-Are-Evil",
                "comment": "The head of the FCC openly said he does not care about public opinion.  We are all fucked.",
                "score": 19,
                "date": 1511312322.0
            },
            {
                "user": "TheGPT407",
                "comment": "They just won’t fucking stop will they?",
                "score": 17,
                "date": 1511310759.0
            },
            {
                "user": "clit_or_us",
                "comment": "Fucking shit. I have a class presentation that day that I cannot miss due to it being my final for the class. This is so fucked. I'm emailing my professor.",
                "score": 8,
                "date": 1511310341.0
            },
            {
                "user": "sukmyass",
                "comment": "The FCC can suck my ass.",
                "score": 9,
                "date": 1511310818.0
            },
            {
                "user": "Leftblankthistime",
                "comment": "Wonder what would happen if we made the whole front page of Reddit about the FCC and net neutrality and sent screencaps to every newspaper and online media outlet... If 1/4 of the internet is 100% behind this, what other ways can we get even more people involved?",
                "score": 8,
                "date": 1511311936.0
            },
            {
                "user": "retrofitme",
                "comment": "This Administration will do nothing to protect consumers. Therefore, I will be contacting my Verizon rep and letting them know that my company will switch providers if our service changes and is no longer net neutral.  $50k/year may not be enough to sway them, but it's a start. ",
                "score": 17,
                "date": 1511311462.0
            },
            {
                "user": "linneychase",
                "comment": "People, please don't hassle the employees and give them a hard time. This is completely out of their control. There is no sense in making their life harder because of shitty decisions of corporate bosses. I'm all for the protests, just make sure it's directed towards the actual issue and not the innocent people that are there for a pay check.",
                "score": 17,
                "date": 1511317929.0
            },
            {
                "user": "sirnumbskull",
                "comment": "Everyone just switch off verizon on that day.  Cancel your service.  Send a message.",
                "score": 9,
                "date": 1511309459.0
            },
            {
                "user": "vMAGMARv",
                "comment": "Anonymous! Please do something :( ",
                "score": 21,
                "date": 1511313341.0
            },
            {
                "user": "gapball",
                "comment": "The sole and only reason to kill NN is to put more money into the pockets of greedy pieces of shit. That's it. Period. ",
                "score": 13,
                "date": 1511309342.0
            },
            {
                "user": "SpyderAByte",
                "comment": "2 honest questions. \nAs a Canadian, what can I do to help or support these crazy shenanigans\n\nIf this passes, will VPNs no longer be usable? Or what is stopping people from using a VPN to get around these nasty constrictions?",
                "score": 12,
                "date": 1511309528.0
            },
            {
                "user": "HilarityEnsuez",
                "comment": "We should all learn from the EA Battlefront.  Do everything we can to stop it.  If they STILL vote against our wishes, everybody cancels their Verizon accounts immediately and we put it in the history books as the first big casualty in the war to retake net neutrality. \n \nEverybody on Reddit needs to blow up their Facebooks and alert the general populous.  Average Joe and Joanne  do not know about this or talk about this.",
                "score": 6,
                "date": 1511317472.0
            },
            {
                "user": "kEnGuY1552",
                "comment": "What’s sad is most people still have no idea how big of an issue this really is. I just asked my gf what she thinks about net neutrality and she said she didn’t know what i was talking about.....",
                "score": 10,
                "date": 1511310176.0
            },
            {
                "user": "FriendKiller96",
                "comment": "https://pbs.twimg.com/media/DNGlrABUIAAr9RO.jpg\n\nThis is what it looks like in Portugal without net neutrality. Feel free to share, spread and post this image wherever you see fit.",
                "score": 33,
                "date": 1511309703.0
            },
            {
                "user": "joshuag5732",
                "comment": "Why do we always march in the winter?",
                "score": 11,
                "date": 1511308841.0
            },
            {
                "user": "Devanismyname",
                "comment": "Anyway I can help as a Canadian? ",
                "score": 4,
                "date": 1511311553.0
            },
            {
                "user": "JohnBPrettyGood",
                "comment": "Dec 7th a date that will live in infamy.\n\n\n",
                "score": 5,
                "date": 1511311583.0
            },
            {
                "user": "PM_ME_YOUR_ANT_FARMS",
                "comment": "There's a bot that will write a letter and fax it to your local government officials, it only takes 5 minutes. Please fight for net neutrality. \n\nText \"resist\" to 50409. Here's the website for the bot. http://www.resistbot.io\n\nHere's a quick letter you can copy and paste to make it even faster: \n\nPlease fight for net neutrality. The internet needs to remain free. We can't let big internet service providers control what we can and can't see. We can't let paywalls decide how we use the internet. There is no need to change the current laws on net neutrality. All it will do is allow big business can make more money. If American restrictions are put into place on the internet its going to effect the entire world. Keep the internet free.",
                "score": 7,
                "date": 1511312590.0
            },
            {
                "user": "ManiacProductionz",
                "comment": "I won't be able to do it sadly but yeah. We need to make a difference so I'll be cheering you guys on on Dec. 7. ",
                "score": 4,
                "date": 1511309075.0
            },
            {
                "user": "themolestedsliver",
                "comment": "Might have to trek to NYC to protest but will be worth it. ",
                "score": 5,
                "date": 1511309401.0
            },
            {
                "user": "mhastings22",
                "comment": "Three mailboxes full. Either we are killing it and blowing them up, or they are filling their mailboxes on us. \n\nEither way, keep it up people! We got this!",
                "score": 4,
                "date": 1511309805.0
            },
            {
                "user": "turtleblue",
                "comment": "Why so late? Heck, why not black friday where there's an off chance you'd be seen?",
                "score": 5,
                "date": 1511309818.0
            },
            {
                "user": "bottlejunkie",
                "comment": "This could be huge for Google. They have fought for net neutrality in the past and they are already an internet and cell phone provider. People will flock to them if they continue to support net neutrality after the FCC votes. ",
                "score": 3,
                "date": 1511317014.0
            },
            {
                "user": "HoosierRed",
                "comment": "Northern Chicago, let's meet at the Verizon store on Belmont Ave.",
                "score": 5,
                "date": 1511317622.0
            },
            {
                "user": "Robotic-communist",
                "comment": "Protesting is not enough, get politically involved and vote every fucking bastard out",
                "score": 5,
                "date": 1511317971.0
            },
            {
                "user": "h00paj00ped",
                "comment": "The decision has already been made, the votes are spoken for.  Stop crying and get ready for the next bandwagon to jump on.",
                "score": 4,
                "date": 1511365268.0
            },
            {
                "user": "pents_hos",
                "comment": "And so you can copy and paste this into your email recipients in a short time.",
                "score": 4,
                "date": 1511889633.0
            },
            {
                "user": "ScarAdvanced9562",
                "comment": "Spoiler Alert, net neutrality died",
                "score": 4,
                "date": 1634486624.0
            },
            {
                "user": "Jonny2js",
                "comment": "We always shout them down. And they wait a few years, then try it again. We need laws specifically protecting net neutrality not just stop the legislation. If not, they will eventually pass this into law. It’s what the govt wants, as more censorship, more control. Anyone google anything controversial lately? The search results speak for themselves LOL. The censorship has already begun\n\nEdit: why tf is Reddit showing me 4 year old articles",
                "score": 4,
                "date": 1665236006.0
            },
            {
                "user": "letmesaysomethingnr",
                "comment": "To play devils advocate - doesn't anyone think it's strange that Google and Amazon both don't want this? Could it mean that they willl have to pay more money instead of us? Wouldn't you want limited competition if you are a giant company by being able to pay more?",
                "score": 6,
                "date": 1511310803.0
            },
            {
                "user": "markko79",
                "comment": "Pearl Harbor Day?  That's not a good day to protest.",
                "score": 23,
                "date": 1511307367.0
            },
            {
                "user": "nautry127",
                "comment": "That's my birthday! I feel special! ",
                "score": 3,
                "date": 1511309192.0
            },
            {
                "user": "danielfro11",
                "comment": "How do we help if we don’t have the time to physically go? Like sign a petition or something? ",
                "score": 3,
                "date": 1511309369.0
            },
            {
                "user": "Suterusu",
                "comment": "I urge you all to mail/call/whateveryougottado AND downvote anything not related to the FCC and upvote everything related to the FCC if we make it impossible for the internet to ignore this issue we recruit more people that can assist us all in keeping our freedoms.\n\n\nIf everything on the front page of reddit is FCC and Net Neutrality related it will spread like wild fire to every other website.\n\n\nPlan B - Riot, Overthrow, Replace. How far would you go for your freedom? How much is too much? How far is too far?",
                "score": 3,
                "date": 1511340734.0
            },
            {
                "user": "devoutalexander",
                "comment": "Are there any news of this in the last mile.",
                "score": 4,
                "date": 1511514041.0
            },
            {
                "user": "Kanarkly",
                "comment": "This is what happens when you vote Republican. Thanks a lot Trump supporters, hope this helps in your quest to \"make America great again\".",
                "score": 15,
                "date": 1511310693.0
            },
            {
                "user": "Exisartreranism",
                "comment": "Free access to internet should be a right for all free people. The internet is freedom. ",
                "score": 4,
                "date": 1511309415.0
            },
            {
                "user": "puckeye",
                "comment": "Do you really think protesting will help??This is 2017. You know we have no democracy right? Im sure our owners will have a nice chuckle over your protest. ",
                "score": 4,
                "date": 1511336774.0
            },
            {
                "user": "Troverman",
                "comment": "https://www.fax2dc.com",
                "score": 2,
                "date": 1511309914.0
            },
            {
                "user": "ChipAyten",
                "comment": "We need to protest erryday",
                "score": 2,
                "date": 1511310078.0
            },
            {
                "user": "NoctaLunais",
                "comment": "So the F.c.c won't let me be, or let me be me, so let me see, they try to shut down net neutrality.",
                "score": 2,
                "date": 1511311161.0
            },
            {
                "user": "Hybridxx9018",
                "comment": "Maybe someone has covered this already, but how often will this keep happening. I️ mean is this just an endless thing where they can keep trying?",
                "score": 2,
                "date": 1511311422.0
            },
            {
                "user": "Ant1mat3r",
                "comment": "Do our politicians have any idea what's going on? Why does nobody say anything? Are they all in on it?",
                "score": 2,
                "date": 1511312776.0
            },
            {
                "user": "xlizen",
                "comment": "Sharing this on Facebook, maybe spread the word a little. ",
                "score": 2,
                "date": 1511313075.0
            },
            {
                "user": "kdris_",
                "comment": "For those who haven't already seen this elsewhere:  **text \"resist\" to 50409** and follow simple instructions to get messages to your senators, rep, governor, and the POTUS.",
                "score": 2,
                "date": 1511313231.0
            },
            {
                "user": "Abysswalker2",
                "comment": "Are Canadians able to help? Will a letter to the closest Congress help?",
                "score": 2,
                "date": 1511313326.0
            },
            {
                "user": "AlphaLatvian",
                "comment": "How about people from other countries? How can we help?",
                "score": 2,
                "date": 1511313570.0
            },
            {
                "user": "TheTruth990",
                "comment": "If the dems get in power next would they reverse this if it goes through? ",
                "score": 2,
                "date": 1511314147.0
            },
            {
                "user": "cgoatc",
                "comment": "I hope it works out for ya. It really seems like they’re saying we want you to be fucked over and are going to make it so. It’s quite ridiculous that it’s even being debated. ",
                "score": 2,
                "date": 1511314173.0
            },
            {
                "user": "jaypooner",
                "comment": "Here is another way to get the message across. The three (out of five) FCC Commissioners planning to vote *against* Net Neutrality are Ajit Pai, Michael O'Rielly, and Brendan Carr. Here are the links to directly email them:\n\n* [Ajit Pai](https://www.fcc.gov/about/leadership/ajit-pai?qt-leadership_tabs=6#qt-leadership_tabs)\n\n* [Michael O'Rielly](https://www.fcc.gov/about/leadership/mike-orielly?qt-leadership_tabs=6#qt-leadership_tabs)\n\n* [Brendan Carr](https://www.fcc.gov/about/leadership/brendan-carr?qt-leadership_tabs=6#qt-leadership_tabs)\n\nThis is an easy way to directly get in touch with those who will be casting the votes. Here's a message that will drive the point across. Feel free to edit or to send a completely different one:\n\n\"Net Neutrality is the cornerstone of innovation, free speech and democracy on the Internet. Control over the Internet should remain in the hands of the people who use it every day. The ability to share information without impediment is critical to the progression of technology, science, small business, and culture. Please stand with the public by protecting Net Neutrality once and for all.\"",
                "score": 2,
                "date": 1511314485.0
            },
            {
                "user": "Darkslayer_",
                "comment": "Yes, I'm posting this everywhere I can. \nCredit to u/elinordash \n>Hi, my name is [NAME] and I'm a concerned customer from [Town]. I'm calling to express my disapproval that the FCC is trying to kill net neutrality and the strong Title II oversight of Internet Service Providers. Preserving an open internet is crucial for fair and equal access to the resources and information available on it. [Optional: Explain why net neutrality is personally important to you or your work] Thank you for your time and attention. [IF LEAVING A VOICEMAIL: please leave your full street address to ensure your call is tallied]\nFind your reps: https://5calls.org/issue/demand-fcc-net-neutrality\n\n If you call your Senator (5 calls should give you the number after your Rep) you can also express your dislike of the new tax bill.  The bill has already passed the House and is now in the Senate:\n>I'm calling to express my opposition to the Tax Cuts and Jobs Act. It is clear this bill is designed to benefit the ultra-wealthy and corporations while providing minimal benefits to most middle-class households. The bill will also create a massive revenue deficit, which will force immediate cuts to programs like Medicare. \n\nDon't be discouraged by form emails and canned responses over the phone!  They tally all contact for and against and members of Congress do sometimes change their vote based on outcry from their district.",
                "score": 2,
                "date": 1511315730.0
            },
            {
                "user": "thegoodgirl34",
                "comment": "Bad for the regular consumer",
                "score": 2,
                "date": 1511316506.0
            },
            {
                "user": "Heplayer92",
                "comment": "Lol this guy's wikipedia page https://en.wikipedia.org/wiki/Ajit_V._Pai",
                "score": 2,
                "date": 1511317340.0
            },
            {
                "user": "SnailzRule",
                "comment": "Protest in Washington, where it will matter",
                "score": 2,
                "date": 1511318036.0
            },
            {
                "user": "arikr",
                "comment": "**Short guide on how redditors can contact congress about preventing the FCC from taking away our Net Neutrality**\n\n**Option 1 - Free if you have free SMS, fast**\n\nThis uses a free service. Basically makes it easier to contact congress with personalized faxes (which I'm told are more effective than emails, though perhaps less than phone calls).\n\nStep 1: Text Resist to 50409\n\nStep 2:\n\nYou'll need to set it up with your address so it knows who to fax.\n\nOnce that's done, reply 'congress'\n\nStep 3:\n\nWrite out a note. I suggest being kind, but firm, with positive expectations. (e.g. don't write it as if you expect them to do the wrong thing, because then this reduces the downside of doing the wrong thing!)\n\nCongress isn't directly involved - but they can stop the FCC. And so you can ask them to stop the FCC.\n\nUnique messages are better, that's why I'm not including a script to write. (I've read that if multiple people say the same thing, they just read it once, and then key it in as something like 'Form letter, 1000 submissions' whereas with unique faxes they are required to read them all.) You can make it short, just a few sentences if you want.\n\nStep 4:\n\nText 'done'\n\nStep 5:\n\nThat's it.\n\n**Option 2 - Free, slightly more time**\n\nAlternatively, call: https://www.battleforthenet.com/\n\nAlso \"Call the FCC at 888-225-5322. It'll take you through a few options, but you can talk to real person to make a formal complaint against Ajit Pai's plan.\" (Thanks drkgodess)",
                "score": 2,
                "date": 1511320599.0
            },
            {
                "user": "mickelvii",
                "comment": "E-mail FCC leadership. Blow up their Twitter accounts too. The [five commissioners](https://imgur.com/a/CCJTH) are the ones who will vote tomorrow. [Contact information here](https://www.fcc.gov/about/leadership).\n\nTwitter accounts:\n[@AjitPaiFCC](https://twitter.com/AjitPaiFCC) / [@MikeOFCC](https://twitter.com/MikeOFCC) / [@BrendanCarrFCC](https://twitter.com/BrendanCarrFCC)\n\n[@MClyburnFCC](http://www.twitter.com/MClyburnFCC) / [@JRosenworcel](https://twitter.com/JRosenworcel)\nThe women are in favor of Net Neutrality and are strongly opposed to this Thanksgiving week vote.",
                "score": 2,
                "date": 1511321852.0
            },
            {
                "user": "JustA_human",
                "comment": "See ya Dec 7th.",
                "score": 2,
                "date": 1511327502.0
            },
            {
                "user": "liquidmoon",
                "comment": "So I'm posting this late but hopefully enough people will see this. \n\nIf you're driving tomorrow/this weekend for the holiday PLEASE consider getting some glass markers and writing on your car Save Net Neutrality (or something like that) and the website to get representative contact info or representative phone number or how to text to get info (text resist to 504-09). A lot of people will be on the road and it is a great way to reach several people in a short time. \n\nMahalo! You can make a difference! ",
                "score": 2,
                "date": 1511328230.0
            },
            {
                "user": "phatandblack",
                "comment": "If you think that writing letters and telling this government will help anything, you will be sorely mistaken when they shove this down your throat anyway. And I'll guarantee that bitching about it on Reddit is doing less than nothing.",
                "score": 2,
                "date": 1511328571.0
            },
            {
                "user": "Dantheunicornman",
                "comment": "Yall see Mr.Robot. I say we burn the Verizon stores and other sites like it. ",
                "score": 2,
                "date": 1511328853.0
            },
            {
                "user": "ayotacos",
                "comment": "Anyone living in Texas, copy and paste this into your email recipients in a new email. This is a list of the vast majority of Senators and Representatives in our state; I encourage someone from every state to do the same on here and any other social media platforms to make it easier for the common person. The average person will be too overwhelmed with Thanksgiving/vacation to spend the 30-40 minutes in gathering every email of the person in their Senate and House. For any Texans, here you go:\nPaul.Bettencourt@senate.texas.gov\n\nBrian.Birdwell@senate.texas.gov\n\ndawn.buckingham@senate.texas.gov\n\nkonni.burton@senate.texas.gov\n\ndonna.campbell@senate.texas.gov\n\nbrandon.creighton@senate.texas.gov\n\ncraig.estes@senate.texas.gov\n\nsylvia.garcia@senate.texas.gov\n\nbob.hall@senate.texas.gov\n\nkelly.hancock@senate.texas.gov\n\njuan.hinojosa@senate.texas.gov\n\nDon.Huffines@senate.texas.gov\n\nJoan.Huffman@senate.texas.gov\n\nbryan.hughes@senate.texas.gov\n\nLois.Kolkhorst@senate.texas.gov\n\neddie.lucio@senate.texas.gov\n\njose.menendez@senate.texas.gov\n\nborris.miles@senate.texas.gov\n\njane.nelson@senate.texas.gov\n\nrobert.nichols@senate.texas.gov\n\ncharles.perry@senate.texas.gov\n\njose.rodriguez@senate.texas.gov\n\nCharles.Schwertner@senate.texas.gov\n\nkel.seliger@senate.texas.gov\n\nlarry.taylor@senate.texas.gov\n\nVan.taylor@senate.texas.gov\n\ncarlos.uresti@senate.texas.gov\n\nkirk.watson@senate.texas.gov\n\nroyce.west@senate.texas.gov\n\njohn.whitmire@senate.texas.gov\n\njudith.zaffirini@senate.texas.gov\n\nroberto.alonzo@house.state.tx.us\n\ncarol.alvarado@house.texas.gov\n\nrafael.anchia@house.texas.gov\n\ncharles.anderson@house.texas.gov\n\nRodney.Anderson@house.texas.gov\n\ndiana.arevalo@house.texas.gov\n\nTrent.Ashby@house.texas.gov\n\nernest.bailes@house.texas.gov\n\nCecil.Bell@house.texas.gov\n\nAlma.Allen@house.state.tx.us\n\nkyle.biedermann@house.texas.gov\n\nCesar.Blanco@house.texas.gov\n\ndwayne.bohac@house.texas.gov\n\ndennis.bonnen@house.texas.gov\n\nGreg.Bonnen@house.texas.gov\n\ncindy.burkett@house.texas.gov\n\nDewayne.Burns@house.texas.gov\n\nDustin.Burrows@house.texas.gov\n\nangie.button@house.texas.gov\n\nTerry.Canales@house.state.tx.us\n\nGiovanni.Capriglione@house.state.tx.us\n\nTravis.Clardy@house.state.tx.us\n\ngarnet.coleman@house.texas.gov\n\nNicole.Collier@house.state.tx.us\n\nbyron.cook@house.state.tx.us\n\nTom.Craddick@house.texas.gov\n\njohn.cyrier@house.texas.gov\n\nTony.Dale@house.texas.gov\n\ndrew.darby@house.state.tx.us\n\nsarah.davis@house.state.tx.us\n\nyvonne.davis@house.state.tx.us\n\njoe.deshotel@house.state.tx.us\n\ndawnna.dukes@house.texas.gov\n\nharold.dutton@house.state.tx.us\n\ngary.elkins@house.state.tx.us\n\nPat.Fallon@house.state.tx.us\n\njessica.farrar@house.state.tx.us\n\ndan.flynn@house.texas.gov\n\nJames.Frank@house.state.tx.us\n\njohn.frullo@house.state.tx.us\n\nCharlie.Geren@house.texas.gov\n\nhelen.giddings@house.state.tx.us\n\nCraig.Goldman@house.texas.gov\n\nlarry.gonzales@house.state.tx.us\n\nMary.Gonzalez@house.texas.gov\n\nlance.gooden@house.state.tx.us\n\nbobby.guerra@house.state.tx.us\n\nryan.guillen@house.state.tx.us\n\nRoland.Gutierrez@house.state.tx.us\n\nana.hernandez@house.texas.gov\n\nAbel.Herrero@house.texas.gov\n\ndonna.howard@house.texas.gov\n\ndan.huberty@house.state.tx.us\n\ntodd.hunter@house.texas.gov\n\njason.isaac@house.texas.gov\n\neric.johnson@house.texas.gov\n\nKyle.Kacal@house.state.tx.us\n\nKen.King@house.state.tx.us\n\nphil.king@house.state.tx.us\n\ntracy.king@house.texas.gov\n\nStephanie.Klick@house.texas.gov\n\nMatt.Krause@house.state.tx.us\n\nJohn.Kuempel@house.state.tx.us\n\nLyle.Larson@house.texas.gov\n\nJodie.Laubenberg@house.texas.gov\n\nJeff.Leach@house.state.tx.us\n\nOscar.Longoria@house.state.tx.us\n\njm.lozano@house.texas.gov\n\neddie.lucio_iii@house.texas.gov\n\nmando.martinez@house.texas.gov\n\nwill.metcalf@house.texas.gov\n\nmorgan.meyer@house.state.tx.us\n\nRick.Miller@house.state.tx.us\n\nJoe.Moody@house.state.tx.us\n\nGeanie.Morrison@house.state.tx.us\n\nSergio.Munoz@house.texas.gov\n\njim.murphy@house.state.tx.us\n\nAndrew.murr@house.texas.gov\n\nanc@nevarezlawgroup.com\n\nRene.Oliveira@house.state.tx.us\n\nchris.paddie@house.texas.gov\n\nTan.Parker@house.state.tx.us\n\nDennis.Paul@house.texas.gov\n\nMaryAnn.Perez@house.texas.gov\n\nLarry.Phillips@house.texas.gov\n\nJoe.Pickett@house.state.tx.us\n\nfour.price@house.texas.gov\n\njohn.raney@house.state.tx.us\n\nron.reynolds@house.state.tx.us\n\nmatt@mattrinaldi.com\n\nEddie.Rodriguez@house.state.tx.us\n\nJustin.Rodriguez@house.state.tx.us\n\nramon.romero@house.texas.gov\n\nToni.Rose@house.state.tx.us\n\nScott.Sanford@house.state.tx.us\n\nMatt.Schaefer@house.texas.gov\n\ncampaign@mikeschofield.com\n\nMatt.Shaheen@house.texas.gov\n\nj.d.sheffield@house.state.tx.us\n\nRon.Simmons@house.state.tx.us\n\nJohn.Smithee@house.texas.gov\n\nDrew.Springer@house.state.tx.us\n\nPhil.Stephenson@house.state.tx.us\n\nJonathan.Stickland@house.texas.gov\n\njoe.straus@speaker.state.tx.us\n\nEd.Thompson@house.texas.gov\n\nSenfronia.Thompson@house.state.tx.us\n\nTony.Tinderholt@house.state.tx.us\n\nChris.Turner@house.texas.gov\n\nJason.Villalba@house.texas.gov\n\nHubert.Vo@house.state.tx.us\n\nArmando.Walle@house.texas.gov\n\nJames.White@house.texas.gov\n\npaul.workman@house.state.tx.us\n\nGene.Wu@house.state.tx.us\n\nBill.Zedler@house.state.tx.us\n\njohn.zerwas@house.texas.gov",
                "score": 2,
                "date": 1511336140.0
            },
            {
                "user": "DreamGirly_",
                "comment": "Thats great for your nation man. Maybe post about it in your nations subreddit like nobody else is doing.",
                "score": 2,
                "date": 1511339039.0
            },
            {
                "user": "corbeil454",
                "comment": "https://petitions.whitehouse.gov/petition/do-not-repeal-net-neutrality \n\nThis is a link to a White House petition.\n\n",
                "score": 2,
                "date": 1511340582.0
            },
            {
                "user": "Draxar112988",
                "comment": "This shit goes threw,  I won't need a smart phone anymore.   An I'll have to find a dinosaur flip phone.",
                "score": 2,
                "date": 1511341676.0
            },
            {
                "user": "CptDeadpooLEO",
                "comment": "https://petitions.whitehouse.gov/petition/do-not-repeal-net-neutrality",
                "score": 2,
                "date": 1511349359.0
            },
            {
                "user": "armyofmidgets",
                "comment": "Never felt more powerless... as a european watching this shit unfold and thinking that if they manage to do this in the USA we are going to have to fight for net neutrality  a few years later... I don't even want to imagine that this could be our reality in the near future",
                "score": 2,
                "date": 1511352100.0
            },
            {
                "user": "Enzojaguar",
                "comment": "Someone get a hold of  John Oliver if that don't work and last resort... Call John Wick",
                "score": 2,
                "date": 1635988246.0
            },
            {
                "user": "Freshcantskate",
                "comment": "The fcc won’t let me be or let me be me so let me see",
                "score": 2,
                "date": 1662241408.0
            },
            {
                "user": "Dadasicanbe",
                "comment": "Thank God I have a regional ISP *for now*. It is unlikely they will throttle anything.",
                "score": 2,
                "date": 1681766560.0
            },
            {
                "user": "dothestarsgazeback",
                "comment": "I have a question: If net neutrality were to be repealed and companies like verizon were allowed to then charge you extra to visit certain sites, could you not just take your business to another internet-providing company? Would every company have to charge extra to visit certain websites?",
                "score": 8,
                "date": 1511308174.0
            },
            {
                "user": "darkdaysindeed",
                "comment": "They won’t care. What are you going to do, boycott and not use the internet? We’re fucked. ",
                "score": 4,
                "date": 1511312953.0
            },
            {
                "user": "lives4summits",
                "comment": "If you couldn't bring yourself to vote for Hillary then you have no right to complain. ",
                "score": 4,
                "date": 1511311549.0
            },
            {
                "user": "DudeImWayWayBetter",
                "comment": "These posts are obviously funded by the an external entity manipulating reddit through upvotes. I know that's forsure, I just don't know what to think of the situation in general, because I don't know enough about what is actually being passed. If I was to guess it's not as dire or as clear cut as this paid ad is making it out to be.  ",
                "score": 3,
                "date": 1511315739.0
            },
            {
                "user": "Tyleno",
                "comment": "I'm the most die-hard Trump supporter on the market, but this is one thing that can't be overlooked. Net neutrality shouldn't go under any circumstances.",
                "score": 3,
                "date": 1511310813.0
            },
            {
                "user": "clegg2011",
                "comment": "I'm so confused. It seems like weekly for the last year there have been headlines saying they are killing but it keeps getting pushed back. What is different this time? Also is there any indication that anyone on Capitol Hill protest this potential ruling?",
                "score": 1,
                "date": 1511309496.0
            },
            {
                "user": "a_mccut",
                "comment": "can you imagine trying to explain to your grandma why she had to pay to use facebook",
                "score": 1,
                "date": 1511309585.0
            },
            {
                "user": "pointofgravity",
                "comment": "I don't live in America. I alReady tried asking this elsewhere and got no response, but is there anything I can do if I don't live in the US to support Net Neutrality? ",
                "score": 1,
                "date": 1511309596.0
            },
            {
                "user": "sawes",
                "comment": "Come on America, let’s do this!",
                "score": 1,
                "date": 1511310067.0
            },
            {
                "user": "jvanderh",
                "comment": "Just signed up to host. Thank you for this! ",
                "score": 1,
                "date": 1511310419.0
            },
            {
                "user": "clausmurf",
                "comment": "Thank u so much for all these info. I’m in!",
                "score": 1,
                "date": 1511310448.0
            },
            {
                "user": "alvispreslee",
                "comment": "Does net neutrality affect other countries? Or is it just america?",
                "score": 1,
                "date": 1511310506.0
            },
            {
                "user": "deathassured",
                "comment": "Here’s a bot that will send messages for you with your information. \n\n[bot](https://resistbot.io/)\n\nIt’s done through text. \n\n\nAll you gotta do is give the bot your info and it will look up the appropriate representatives, congressman, you can even send a letter to the president. \n\nSorry if this has been posted already. ",
                "score": 1,
                "date": 1511310938.0
            },
            {
                "user": "DaisyHotCakes",
                "comment": "Text resist to 504-09 and let resistbot guide you through sending faxes, calling, emailing, and snail mailing your words to your representatives. It’s free and is so freaking easy. Seriously, try it. Give your reps a fucking earful!",
                "score": 1,
                "date": 1511310980.0
            },
            {
                "user": "Its4Trap",
                "comment": "Text resist to 50409. ",
                "score": 1,
                "date": 1511311017.0
            }
        ]
    },
    {
        "flair": "discussion",
        "title": "The FCC is expected to announce a vote to gut net neutrality rules the day before Thanksgiving. Only a big burst of phone calls to Congress can stop them from allowing ISPs to charge us extra fees to access sites, apps, games, and especially the music we all love.",
        "author": "JPTIII",
        "date": 1508431850.0,
        "score": 100887,
        "description": "Hey everyone, **the chairman of the FCC, is very likely to announce a vote to gut neutrality, possibly as soon as Nov. 22nd.** Once a vote is called, it will become much, much harder to stop ISPs from charging us all extra fees to access streaming services or watch music videos -- and they can demand payment from independent artists and labels, stifling independent voices\n\n**[But there’s still hope. The most effective way to can stop this is by driving as many calls as possible to our Senators and Representatives, now through Nov. 22nd. ](https://www.battleforthenet.com)**\n\nWe're getting word that there are lawmakers who are sympathetic to our cause and considering taking action to slow the FCC down, but they won’t act unless they get more phone calls from constituents. Also, if your think your Rep's opposed to net neutrality, its all the more reason to call them. Those Reps need to hear your voice more than anyone.\n\n**Please, head over to https://www.battleforthenet.com , and give your Senators and Reps a call telling them to stop the FCC from slashing Title II net neutrality protections.** The time to act is now.\n\nTo reach the call in line directly by phone, **call 202-930-8550**.\n\nWhen you get through to your Rep's office, introduce yourself, be polite, and say: \n> I support \"Title Two\" net neutrality rules and I urge you to oppose the FCC's plan to repeal them. Specifically, I'd like you to contact the FCC Chairman and demand he abandon his current plan.\n\nWe also have ready-made banners, modals, and graphics of various sizes here: https://www.battleforthenet.com/#join\n\nThanks.",
        "comments": [
            {
                "user": "Dodo0027",
                "comment": "Fucking dirty bastards. Exploiting the holiday like the assholes they are. \n\nPlease note all responses to this post will cost $1.99.  ",
                "score": 1700,
                "date": 1508440757.0
            },
            {
                "user": "flip281",
                "comment": "Why is this a thing on a monthly basis?  This angers me.",
                "score": 1343,
                "date": 1508439233.0
            },
            {
                "user": "Treetrunksss",
                "comment": "CanadiAn here. If calling congress fails why not make a massive protest in the streets? This is essentially taking your freedom away and putting it behind a money wall.",
                "score": 816,
                "date": 1508441990.0
            },
            {
                "user": "camren_rooke",
                "comment": "I wrote. \nSent a letter. \nMy congressman wrote me back. Said the exact opposite to what I said in my email.\nGood going Isakson.\n*sigh*",
                "score": 4052,
                "date": 1508437181.0
            },
            {
                "user": "seKer82",
                "comment": "Fuck, the American government really hates Americans.  ",
                "score": 2494,
                "date": 1508440534.0
            },
            {
                "user": "Jewinacup",
                "comment": "If no one wants this how can it happen? ",
                "score": 667,
                "date": 1508437073.0
            },
            {
                "user": "judahnator",
                "comment": "I called and wrote in.\n\nAll that happened was I got a letter response letting me know I was wrong, and NN needed gutted. \n\nGood to know my voice is heard",
                "score": 341,
                "date": 1508440191.0
            },
            {
                "user": "DrHarkon",
                "comment": "I'm not from the states and how you guys get treated over there drives me nuts! I'm a very heavy internet user (at least 6 Hours daily) and don't know what I would do if shit like this would happen over here. Wish I could so something to help you. Keep your heads up! ",
                "score": 93,
                "date": 1508440503.0
            },
            {
                "user": "IDontFuckingThinkSo",
                "comment": "What we really need is Congress to enshrine NN in law.  But that seems pretty unlikely.",
                "score": 406,
                "date": 1508437244.0
            },
            {
                "user": "Blarg0117",
                "comment": "Won't this completely fuck up the economy? Killing any ad revenue based companies, who depend on clicks for cash? Like YouTube or Facebook? ",
                "score": 490,
                "date": 1508437686.0
            },
            {
                "user": "wundrlch",
                "comment": "Can we pay for a service where some rich guy just logs into my bank account and transfers all my money and that takes care of all my bills? The rich get it all anyway and I have to take the time to pay the bills so that alternative just seems easier",
                "score": 1167,
                "date": 1508432090.0
            },
            {
                "user": "Hope_Burns_Bright",
                "comment": "As someone who knows how a congressional office handles these calls, here's a couple things to remember when you call:\n\n1) Make sure they get your name and address. They need that to log your opinion in their system for stats purposes, responses, and verification that you are **actually** their constituent. If an intern gets off the call with you and you didn't give them either of those things, there's not much she can do and your opinion can't really be officially logged. If you need to, **ask if they accept email in place of street address**.\n\n2) Be nice to the interns. Please.\n\n3) Make sure you're calling the right rep. The House has a resource for looking up your rep by zip code. They are not obligated to log comments by people not in their district.",
                "score": 151,
                "date": 1508441874.0
            },
            {
                "user": "saint_skank",
                "comment": "Please people this takes no longer than 5 minutes of your time. I highly encourage you to make a call everytime you go out for a drive. If enough people do this then hopefully they will hear us. ",
                "score": 664,
                "date": 1508435431.0
            },
            {
                "user": "i0datamonster",
                "comment": "At what point can we bring a racketeering case against the FCC for repeatedly brining legislation the public has voted against",
                "score": 68,
                "date": 1508440908.0
            },
            {
                "user": "Burpmeister",
                "comment": "How is it legal to try to gut it basically every single month???",
                "score": 63,
                "date": 1508441467.0
            },
            {
                "user": "mountaineggroll",
                "comment": "www.battleforthenet.com/   this website makes it so easy to make the call. ",
                "score": 321,
                "date": 1508437552.0
            },
            {
                "user": "paperbackgarbage",
                "comment": "People are only going to start caring when they start getting hit in the wallet.  Nothing before.",
                "score": 54,
                "date": 1508439996.0
            },
            {
                "user": "imhere2downvote",
                "comment": "I'll fukken stop using the internet.\n\nPaying twice for the internet already isn't enough?\n\nMonthly phone bill, monthly internet bill, not good enough? Fuck that, I dropped cable I even stopped using my phone for a long time, not a cent from me.",
                "score": 51,
                "date": 1508441499.0
            },
            {
                "user": "atomicboy",
                "comment": "Better not mess with my porn.",
                "score": 238,
                "date": 1508437057.0
            },
            {
                "user": "fuck_your_diploma",
                "comment": "What fucks me is that this is a global scale treat.\n\nIf there’s a legal precedent in the US, the entire industry douches around the globe are gonna lobby the fuck out of this to make this hell their new business model.\n\nFUCK YOU LOBBYISTS. *FUCK YOU HARD*. IN THE ASS. ",
                "score": 162,
                "date": 1508441680.0
            },
            {
                "user": "imadyke",
                "comment": "Government better stop fucking with it's people or the people will fuck the government.  Keep pushing mother fuckers in this day and age and the whole shit house will go up in flames.",
                "score": 47,
                "date": 1508441732.0
            },
            {
                "user": "brandohh94",
                "comment": "Sooooooo THE FCC WONT LET ME BE",
                "score": 283,
                "date": 1508440376.0
            },
            {
                "user": "Drum_hero",
                "comment": "I hate to be a Debbie downer, but I don’t think any of our representatives give a shit about what we want and will just do whatever gets them the most money.",
                "score": 198,
                "date": 1508441818.0
            },
            {
                "user": "Whatever_It_Takes",
                "comment": "What if this is just a ploy to get us to all go outside more often? ",
                "score": 199,
                "date": 1508438134.0
            },
            {
                "user": "_Professor_Chaos_",
                "comment": "If we have to do this every fucking week until the end of time, there is something seriously wrong with this whole \"democratic\" process.",
                "score": 75,
                "date": 1508441492.0
            },
            {
                "user": "VineWings",
                "comment": "This is so fucking tiring. We can and will keep on fighting this and they will keep on pushing this until they get that one YES vote to pass it all. No matter how many times we fight this and they don't get their way they will just keep on pushing this until they do. Our representatives don't represent us at all and it just makes my blood boil. Bought and paid for politicians are the norm these days. ",
                "score": 125,
                "date": 1508440538.0
            },
            {
                "user": "MCLooyverse",
                "comment": "Question: does a minor calling in do anything helpful? I just get kinda nervous about calling in while being a minor.\n\nEdit: Breaking news: I made the call.",
                "score": 246,
                "date": 1508437706.0
            },
            {
                "user": "stagehog81",
                "comment": "I sent letter to my Senators and Representative and only got a response back from Luther Strange that essentially told me that he believed that net neutrality regulations were hurting businesses ability to innovate.  Pretty much every reason he listed and his reasoning made me think that his staff must have written their response on opposite day.  \n\nIt makes me happy to know that Luther Strange won't be in office much longer and hopefully he won't be replaced by the far worse candidate Roy Moore.",
                "score": 94,
                "date": 1508440222.0
            },
            {
                "user": "Blarg0117",
                "comment": "Will this make it so they charge me money to browse Reddit?",
                "score": 148,
                "date": 1508437733.0
            },
            {
                "user": "axleoke",
                "comment": "Where's Aaron Schwartz when you need a hero",
                "score": 28,
                "date": 1508440324.0
            },
            {
                "user": "megadeth37",
                "comment": "If this goes through then everyone just give up paying for internet for a month. They'll lose so much money. Go the library or Starbucks instead.",
                "score": 59,
                "date": 1508440522.0
            },
            {
                "user": "ChBoler",
                "comment": "Is there really nothing stopping them from just doing this forever until it might pass? It feels like at this point they could bring it up for vote 100 times a day until it passes.",
                "score": 28,
                "date": 1508440599.0
            },
            {
                "user": "Whitewind617",
                "comment": "This is just absurd. They keep trying to push nonsense like this through despite it being objectively bad for Americans and against the majority of our wishes.\n\nThis is not how the Government is supposed to operate.",
                "score": 27,
                "date": 1508441773.0
            },
            {
                "user": "MascarponeBR",
                "comment": "honestly, if they do gut net neutrality stuff like TOR will gain force and maybe even an alternative to the www",
                "score": 136,
                "date": 1508438298.0
            },
            {
                "user": "trudel69",
                "comment": "They’ll try to have their way again and again until they inevitably win. This is sickening.",
                "score": 129,
                "date": 1508437229.0
            },
            {
                "user": "Swarrel",
                "comment": "I REFUSE to let them gut NET NEUTRALITY.. The internet is something I've always used since I was a kid and it's like the game industry adding MICRO TRANSACTIONS to games. PLEASE call, write, do what you can! ",
                "score": 79,
                "date": 1508439531.0
            },
            {
                "user": "voteferpedro",
                "comment": "LMFAO.  They will just shut off their phones like last time.",
                "score": 49,
                "date": 1508437295.0
            },
            {
                "user": "scandalousmambo",
                "comment": "Dear AT&T, Verizon and Comcast,  \n\nPlease charge an extra fee to access my web site.  \n\nPlease.   \n\nSigned,  \nFuture Federal Court Plaintiff   \n",
                "score": 36,
                "date": 1508440428.0
            },
            {
                "user": "H_Lon_Rubbard",
                "comment": "You want white people to riot?\n\nThis is how you get white people to riot.\n\nD.C. is going to burn to the fucking ground. ",
                "score": 159,
                "date": 1508440272.0
            },
            {
                "user": "Throwawaypoops22",
                "comment": "here's John Cornyn's response to me. What a piece of slimy shit:\n\nThank you for contacting me regarding Internet regulation and commerce. I appreciate having the benefit of your comments on this matter. \n  \nOver the past two decades, Americans have increasingly relied on the Internet in their personal and professional lives, and new technologies play a central role in the Internet’s growing importance. Many of these technologies have been developed in Texas. As Texans and Americans, we all benefit from advancements that encourage economic growth and make day-to-day life easier. \n  \nWe need policies to meet the evolving challenges of technological advancement. However, government regulations move slower than technology, and we must ensure the laws we pass do not stifle innovation. A top-down regulatory approach can unnecessarily constrain an industry’s ability to create and deliver new products and services to market. In the Senate, I have supported laws that facilitate innovation and opposed those which threaten it. For example, I supported the Leahy-Smith America Invents Act (P.L. 112-29), which modernized our outdated patent system by improving the application process and reducing litigation. \n \nAs you may know, on May 18, 2017, the FCC voted 2-1 to pass the “Restoring Internet Freedom” Notice of Proposed Rule Making (NPRM). The NPRM intends to replace the regulatory structure of the 2015 Open Internet Order, commonly referred to as Net Neutrality, with a light-touch regulatory framework that protects consumers, closes the digital divide and brings next-generation networks and services to all Americans. The successful vote opened a two month comment period on how to best maintain a free and open Internet. If you wish to file your comments on the NPRM with the FCC, you may do so here: https://www.fcc.gov/ecfs . The deadline for submitting comments is July 17, 2017. \n \nI support the FCC’s transparent approach to reduce burdensome regulation and improve internet access and services. I am also proud to cosponsor the Restoring Internet Freedom Act (S. 993). This legislation would nullify the net neutrality rule, ensure Congress maintains its primary authority to reshape communications policy, and restore the competitive freedom that has characterized the Internet. S.993 has been referred to the Committee on Commerce, Science, and Transportation. Although I am not a member of this Committee, I will be sure to keep your views in mind should S. 993 be considered by the full Senate during the 115th Congress.\n \nI appreciate the opportunity to represent Texas in the United States Senate. Thank you for taking the time to contact me. \n \nSincerely, \n \nJOHN CORNYN \nUnited States Senator \n",
                "score": 14,
                "date": 1508446144.0
            },
            {
                "user": "LedZeppelinRiff",
                "comment": "Everyone single person in the USA could sign the petitions and the FCC would still fuck us over. All our politicans are for sale and we can't afford them. ",
                "score": 15,
                "date": 1508454511.0
            },
            {
                "user": "poxopox",
                "comment": "You can remove elected officials from office using a [recall campaign](http://www.ncsl.org/research/elections-and-campaigns/recall-of-state-officials.aspx). Here is a [scorecard](https://www.battleforthenet.com/#scoreboard) on who supports and who doesn't support net neutrality. Im sick and fucking tired of feeling helpless in this fight. If our elected officials aren't doing their job with representing the people who put them where they are, then we the people can remove them and replace them with people who do a better job representing",
                "score": 14,
                "date": 1508448172.0
            },
            {
                "user": "memeperor",
                "comment": "11,892 calls just today! Great job everyone! :)",
                "score": 9,
                "date": 1508443423.0
            },
            {
                "user": "lbiggy",
                "comment": "I'm Canadian. Please don't let them do this. Because if you do, our ISPs will do this and it won't be a good day for Canada and therefore, the world. ",
                "score": 13,
                "date": 1508445573.0
            },
            {
                "user": "FreeThinkk",
                "comment": "God this is getting fucking exhausting. ",
                "score": 11,
                "date": 1508442134.0
            },
            {
                "user": "Genesis111112",
                "comment": "not even you *phone calls* are going to change their minds....phone calls don't work anymore as they ignore them....town halls don't work because politicians are too afraid of their *constituents* to go..... makes no difference because the vast majority of politicians are liars and are out for *their own* best interests and not their fellow citizen from their state. good luck to everyone.",
                "score": 28,
                "date": 1508440017.0
            },
            {
                "user": "MTBDEM",
                "comment": "Fuck this there's still hope bullshit.\n\nI've had enough, again and fucking again and fucking again they vote for this shit.\n\n\nHOW DO WE STOP IT?\n\nENOUGH GAMES ",
                "score": 63,
                "date": 1508438295.0
            },
            {
                "user": "--AJ--",
                "comment": "If they can’t figure out how horrendously pissed-off that’s gonna make people without us blasting them yet again with calls, letters, emails, tweets, full page ads, tv spots, etc - what the fuck is the point? Vast quantities of profits are to be made, and shareholders in telecom companies demand constant and infinite growth. They’re gonna keep trying until their greedy fucking claws get hold of it.",
                "score": 28,
                "date": 1508437281.0
            },
            {
                "user": "Anomalous-Entity",
                "comment": "I've seen this question come up a lot in this thread; How does this benefit ISPs? It seems a simple question but it's mostly getting answered by complex answers.  \n  \nHere's the simple and ultimate reason ISPs want to end net neutrality:  \n  \nWithout net neutrality, ISPs can co-opt any successful internet venture; Netflix, YouTube, Twitch, and all the new media subscription services on the horizon, into their own success. _Anything_ that becomes a success on the internet is also a success for the ISPs. They are electing themselves producers for all internet content.",
                "score": 7,
                "date": 1508444691.0
            },
            {
                "user": "16xandCounting",
                "comment": "What the fuck is the FCCs problem",
                "score": 8,
                "date": 1508445974.0
            },
            {
                "user": "nomnivore1",
                "comment": "Do they want a whole country bootlegging Internet? Because thats how you get a whole country to start bootlegging Internet. \n\nHonestly, if we have to pay through the nose to use communication networks as we want to, I'm not sure I want to live much more of my life here. Expatriation doesn't sound so bad. It's a big world. ",
                "score": 8,
                "date": 1508454095.0
            },
            {
                "user": "Bellalion9",
                "comment": "Quick question: do we still have to call if our representative is already voting against stripping Title 2? ",
                "score": 14,
                "date": 1508441939.0
            },
            {
                "user": "lightthatisnew",
                "comment": "Ajit Pai needs to have a weekwacker taken to his stupid looking face. The lobbyists need to be thrown in jail, and congressmen trying to kill NN need to have their names written in death note. This is stupid and sickening\n\nEDIT: Weedwacker, not weekwacker",
                "score": 38,
                "date": 1508438971.0
            },
            {
                "user": "poopbagman",
                "comment": "Taking away the circuses? This is how you get a revolution, Republicans.",
                "score": 7,
                "date": 1508442240.0
            },
            {
                "user": "Hes-Not-The-Messiah",
                "comment": "From the UK, is there anything I can do you help?",
                "score": 7,
                "date": 1508447175.0
            },
            {
                "user": "hunterlarious",
                "comment": "**IF YOU WORK AT A BUSINESS THAT USES THE INTERNET ( which we all do ) ASK TO SEND AN INTERNAL LET THEM KNOW THIS WILL EFFECT YOUR ABILITY TO DO BUSINESS TELL THEM IT HURTS THE BOTTOM LINE**",
                "score": 6,
                "date": 1508447835.0
            },
            {
                "user": "TheSpiritofTruth666",
                "comment": "Congress doesn't give a shit about us. ",
                "score": 6,
                "date": 1508442065.0
            },
            {
                "user": "ManiacalMan",
                "comment": "If NN gets torn down, is there any way in the future where the ruling could be overturned? Maybe after enough people realize how bad he decision is? ",
                "score": 7,
                "date": 1508443418.0
            },
            {
                "user": "EnerG21",
                "comment": "So this like buying a game and then having to buy a whole bunch of dlc to enjoy it. \n\nMicrotransactions outside of video games. I’m scared ",
                "score": 4,
                "date": 1508445380.0
            },
            {
                "user": "rossmosh85",
                "comment": "As far as I know, this is another partisan issue.  Generally speaking, democrats are for net neutrality and republicans are against it.\n\nThe thing is, this is not a partisan issue to the average person.  If you're a normal person, you should be in favor of net neutrality.  So I beg those that live in red states that also vote Republican, contact your local law makers and let them know you did vote for them and if they pass this, you won't next time.",
                "score": 6,
                "date": 1508446095.0
            },
            {
                "user": "Arrow218",
                "comment": "Why the fuck do we have to keep fighting this ",
                "score": 7,
                "date": 1508450689.0
            },
            {
                "user": "Raspberries-Are-Evil",
                "comment": "You are kidding yourself if you think congress will listen to our phone calls.  They only listen to the corporations that have given them millions for this specific reason.  Prepare to be disappointed. ",
                "score": 6,
                "date": 1508450947.0
            },
            {
                "user": "kccoconuts",
                "comment": "This is scary. Really. The Internet is a major source of info, media, and current world news. It's today's research and knowledge base if looking in the proper places. It is people's jobs, and pursued degrees. The world is evolving into automation, how can they just halt the progress? Many businesses are ecommerce. I am fine with them using big data as long as they don't abuse it and I get my information and resources in return. We already got stiffed on healthcare. I don't want my knowledge and resources, as a student and as a citizen, to be restricted. Especially with all the corruption going on in the middle east. I Like to know what's going on in the world. I don't want to feel like there's a curtain between the population and our government.  How will we keep up with the presidency? How will we stay connected as a world? How will we share the truth and the tragedies to provoke change? How far can this go?",
                "score": 6,
                "date": 1508468303.0
            },
            {
                "user": "drunkwhilewalking",
                "comment": "Removing net neutrality is a bad thing. If you want a examplelook at Mexico. They charge by the kilobits for data.",
                "score": 12,
                "date": 1508440173.0
            },
            {
                "user": "astrozombie2012",
                "comment": "The public has spoken repeatedly. We do not want this. But our voice doesn't matter to these assholes, only money. Bend over and hold on... this is happening, we lose as usual. And even if they don't do it, don't worry, they'll try again and again and again until they succeed. Until we can make lobbying illegal and remove money from politics the public will lose every single time.",
                "score": 5,
                "date": 1508441815.0
            },
            {
                "user": "Dirka85",
                "comment": "If they do it can we all boycott the interwebs for a week? ",
                "score": 5,
                "date": 1508442057.0
            },
            {
                "user": "chivesr",
                "comment": "My dad is very much against net neutrality and I don’t have the faintest idea why. We aren’t rich, and we already spend quite a bit on internet bills, I don’t see why he’d want to spend more for the same stuff he is getting now for less.",
                "score": 6,
                "date": 1508442182.0
            },
            {
                "user": "jlm7552",
                "comment": "I might just be an idiot, or misinformed, or probably both...but shouldn’t there have to be numerous votes and referendums for this to actually pass into law? I’m just thinking about other “controversial” votes that have or haven’t passed before (gay marriage rights, medical marijuana laws, etc) that had to go through quite a few special sessions of congress to even reach the floor. But now it seems this is getting totally fast tracked?",
                "score": 6,
                "date": 1508456442.0
            },
            {
                "user": "A_of",
                "comment": "Chilean here. Not a big country, but we have a very good net neutrality law. ISP's even have to assure download speeds and can't throttle you down.   \nI am a gamer and some of my gaming friends are from USA. My jaw dropped to the floor when one of them told me she paid $120 dollars a month for a (I think) 20mbps connection. Granted, she doesn't live in the middle of a big city, but still. Her connection also drops several times during the day. Here I pay approx. $40 for a 200mbps connection.  \nI really hope you can do something. It's weird seeing how the country that created the internet, has such bad laws and infrastructure regarding it.",
                "score": 4,
                "date": 1508461381.0
            },
            {
                "user": "JackMaundrell",
                "comment": "This is a buried comment no one will read and I don't care if I'm downvoted for expressing my opinion because at least it won't be part of the followers of reddit. You know this shit won't change. They will do it anyways whether people complain or not, if not now then later when no one is looking. You know how I know?  Because people are self centered and in the general population don't care about the FCC or the Internet. They don't care about politics which to them is the same thing and you might as well speak greek to them. I just asked 2 people who have little connection to the Internet about this issue and believe me these 2 are the perfect demographic to ask as the avg. American. They mainly use the Internet for Facebook and Netflix. They had no idea about the FCC or what is going on in the world. Why? because that's how life is for most people. They have their SO & possibly family and that's all they want. The people at the top know this as well which is why it won't change. If you really want to show these kinds of people true change. Make it personal!! Make it ground level for the commoners of the US. This is just a big echo chamber for reddit, once again. but go ahead and downplay my words. Nothing can stop this train of control short of a full revolution however a smarter man than me once said.. Revolution only happens when we can't buy bread. If your thinking who am I to say this with such certainty? I'm the other commoner who looks up once in a while to see what's going on at the others but knows he won't be accepted to do anything about it.",
                "score": 4,
                "date": 1508469253.0
            }
        ]
    },
    {
        "flair": "article",
        "title": "Dollywood, Dolly Parton's amusement park, announced that the company will cover 100% of tuition, fees and books for any Dollywood employee who chooses to pursue further education. This will be offered to all seasonal, part-time, and full-time employees, and they can enroll day 1 of their employment.",
        "author": "YoureASkyscraper",
        "date": 1644420031.0,
        "score": 90866,
        "description": "Article: https://fox17.com/news/local/dream-more-dollywood-to-pay-100-of-tuition-textbooks-for-employees-pursuing-education-pigeon-forge-tennessee-herschend-enterprises\n\nPIGEON FORGE, Tenn. (WZTV) — Dollywood on Tuesday announced they'll start paying a hundred percent of tuition for employees who wish to further their education. This includes the cost of fees and textbooks.\n\nThe education benefit package is available to all team members on the first day of their employment. The company says it's a way for employees at all levels to pursue their personal and professional dreams.\n\nPiloted by Dolly Parton's operating partner Herschend Enterprises, the program from GROW U. will mark a significant investment for workers. President of Dollywood Company Eugene Naughton says it's an opportunity for employees to grow.\n\n\"One of The Dollywood Foundation’s key tenets is to ‘learn more.’ This program is created with that very tenet in mind. We want our hosts to develop themselves through advanced learning to fulfill the foundation’s other tenets: care more, dream more, and be more.\"\nThe program will officially launch Feb. 24 for all seasonal, part-time, and full-time employees at Dollywood Parks & Resorts. Hosts can enroll in the program on their first day of employment.\n\n\"When our hosts strive to grow themselves, it makes our business and our community a truly better place,\" Naughton said. \"We care about our hosts’ development and we want their future to grow because of love—not loans.\"",
        "comments": [
            {
                "user": "teejayiscool",
                "comment": "Seeing this is amazing. As a roller coaster enthusiast and theme park nerd. Dollywood is one of the best parks in the country for rides and atmosphere and customer service and now add on this, the morale will improve and it should be even better. I love it",
                "score": 5201,
                "date": 1644421966.0
            },
            {
                "user": "quechal",
                "comment": "Tennessee also has a free community college program so that helps too.",
                "score": 974,
                "date": 1644423753.0
            },
            {
                "user": "YoureASkyscraper",
                "comment": "Further proof that Dolly Parton is one of the greatest humans to ever exist.",
                "score": 5338,
                "date": 1644420191.0
            },
            {
                "user": "rluvbeach",
                "comment": "i had a deal like this from ppg industires in pittsburgh. They paid for everthing up front (tuition, books fees,everthing but my parking tickets), and you all you had to do is get at least a C in your classes. took 6 years but got a bs in chemistry from pitt this way.",
                "score": 415,
                "date": 1644423058.0
            },
            {
                "user": "Rubberfootman",
                "comment": "From day 1 of their employment. \n\nDolly doesn’t even care if you’re working there just to get free tuition - she just wants you to be able to get free tuition.",
                "score": 562,
                "date": 1644424123.0
            },
            {
                "user": "notsara",
                "comment": "I'm sure they aren't experiencing a \"worker shortage\".",
                "score": 905,
                "date": 1644422034.0
            },
            {
                "user": "YellowstoneBitch",
                "comment": "She’s a goddamn National Treasure, that woman. She wrote “I will always love you” and “Jolene” on the same day, has donated over 100 million books to children all around the world through her literacy program, donated crazy amounts of money to HIV/aids charities, fought to save the bald eagle from extinction, donated millions to the local medical school/hospital, donated a ton of money toward the creation of a cancer treatment center, donated millions to the smoky mountain wildfire charity, donated millions to the aforementioned hospital for the research/production of the COVID19 vaccine. And she’s still a millionaire. Imagine what the world might be like if all celebrities were even half as generous.",
                "score": 193,
                "date": 1644427959.0
            },
            {
                "user": "creamyg0odne55",
                "comment": "Dolly Parton is the closest we have these days to a real life super-hero.",
                "score": 374,
                "date": 1644422405.0
            },
            {
                "user": "Hamann334",
                "comment": "If Dolly Parton does not get canonized as a Saint I will personally take a dump on the popes gilded chair",
                "score": 243,
                "date": 1644421688.0
            },
            {
                "user": "RogueOneWasOkay",
                "comment": "As a TN native it’s an embarrassment to see articles about banned books on the Holocaust and book burnings in 2022. Dolly is such a prime example of southern hospitality, and the pride of the state. She is a diamond in a pile a shit. She is TN’s saving grace. She is praised like an Angel here.",
                "score": 194,
                "date": 1644426336.0
            },
            {
                "user": "Selmanella",
                "comment": "Dolly Parton is a treasure. We use her free monthly book program for our kids and they love it.",
                "score": 47,
                "date": 1644424464.0
            },
            {
                "user": "saarlac",
                "comment": "Dolly is a saint",
                "score": 22,
                "date": 1644427529.0
            },
            {
                "user": "ExternalPiglet1",
                "comment": "I'm 40 with a family....makes me wanna pull up stakes like a Griswald and do a cross country trip for a job interview. \n\nBut for real, this is awesome and refreshing. Totally makes sense if the company has the budget (and a heart of course).",
                "score": 109,
                "date": 1644420351.0
            },
            {
                "user": "manwithappleface",
                "comment": "If Dolly isn’t careful people are going to forget she’s an entertainer and only remember her for her extraordinary philanthropy.\n\nThese scholarships, COVID research at Vanderbilt, her program that sends childrens books to EVERY KID in her community….I can name three of her causes, off the top of my head, but I couldn’t name a single album.\n\nThe woman is a national treasure.",
                "score": 13,
                "date": 1644438740.0
            },
            {
                "user": "a_terribad_mistake",
                "comment": "Dolly Parton is an American Saint and I will fucking fight ANYONE who wants to disagree with the notion that we shoulda replaced confederate statues with statues of Dolly.\n\nExcept for Dolly, who said that was silly.",
                "score": 12,
                "date": 1644431179.0
            },
            {
                "user": "I_Fucked_A_TGirl",
                "comment": "Top 3 best Humans in history.",
                "score": 47,
                "date": 1644421360.0
            },
            {
                "user": "DanDaddy87",
                "comment": "She’s too cool to be real",
                "score": 25,
                "date": 1644422041.0
            },
            {
                "user": "r0botdevil",
                "comment": "Dolly Parton is a goddamn national treasure. She must be protected at all costs.",
                "score": 24,
                "date": 1644426280.0
            },
            {
                "user": "belinck",
                "comment": "While most American businesses are crying out for staff, I'm willing to bet that Dollywood will have a waitlist of folks looking to work there.",
                "score": 17,
                "date": 1644422764.0
            },
            {
                "user": "HermanBonJovi",
                "comment": "I love that she's doing this. She's amazing. But she shouldn't have to do this and that's the problem.",
                "score": 11,
                "date": 1644425387.0
            },
            {
                "user": "IvoShandor",
                "comment": "Tangentially ... my two cents about Dollywood.\n\nMy family was in Knoxville for a wedding and we decided to check out Dollywood.  We live in Manhattan and we're all from the Northeast. We have limited exposure to parts of the country that is not Los Angeles, Chicago, or the ski towns in the Rockies.  We perhaps have a different lifestyle than rural Tennessee/Smoky Mountains.\n\nHaving said that, we had **THE BEST** time at Dollywood.  We went with a certain prejudiced and preconceived notion of what it would be like.   While my kids didn't understand why so many people were riding mobility scooters and were a little shocked at how much larger the people were .... yes, there are big people everywhere, but the proportion of big people to not so big people was very high.\n\nThe park was so clean, people were so nice, the lines were manageable, the food was amazing for an amusement park.  It was one of the more memorable experiences of my kids' childhood.",
                "score": 16,
                "date": 1644427657.0
            },
            {
                "user": "Luke5119",
                "comment": "This is part of Herschend Family Entertainment's plea to do so.  They also own Silver Dollar City near Branson, MO and are extending the same offer to employees there as well.  I think this is awesome, SDS and Dollywood are amazing theme parks.",
                "score": 9,
                "date": 1644432013.0
            },
            {
                "user": "ATX_native",
                "comment": "She’s an amazing person. 🙂",
                "score": 5,
                "date": 1644422459.0
            },
            {
                "user": "Josquius",
                "comment": "Will people start scholarships to send people to work at dolly Wood now?",
                "score": 11,
                "date": 1644422955.0
            },
            {
                "user": "Rhymeswithfinechina",
                "comment": "We need to start asking congress and our representatives, “What would Dolly Do?”   \n\nCause we know she wants all of us to be able to learn and get an education without worrying about paying for the rest of our lives. Then she would offer us a hug and say everything is going to be alright.",
                "score": 7,
                "date": 1644422923.0
            },
            {
                "user": "hamster_13",
                "comment": "These all sound great on the surface, and maybe this one is. But might want to pump the brakes on the cheering until the details come out. My employer reimburses up to $1k per semester, but you have to agree to work for them for one year per semester you take advantage of that, and the clock doesn't start ticking until you graduate. \n\nA 4 year degree is 12 year commitment to my employer, all for $8k in reimbursement, or you have to pay it back upon employment termination/quitting.",
                "score": 5,
                "date": 1644426390.0
            },
            {
                "user": "Winterhorrorland",
                "comment": "Welp, throwing in my application and packing my bags now",
                "score": 3,
                "date": 1644422974.0
            },
            {
                "user": "Shakooza",
                "comment": "I've gone to Dollywood dozens if not hundreds of times...I applaud them for this objective but an overwhelming percentage of their employees are 65 and above. They specifically target and hire local retired people because they are good employees and its a service to the community. If you visit a park or their resort the number of 65+ will be one of the first things you notice.\n\nIt is not the typical theme park where the staffing represents a bunch of high school/college age range. I LOVE the fact that the staff is older and more friendly. Its one of the things that make the park so special.",
                "score": 5,
                "date": 1644423135.0
            },
            {
                "user": "Dominant_Genes",
                "comment": "May Saint Dolly reign forever!",
                "score": 6,
                "date": 1644426671.0
            },
            {
                "user": "ErikRogers",
                "comment": "So, how is Dollywood? Honestly, the idea of \"going to Dollywood\" always felt like a joke to me... Something you might do if you *really loved* Dolly Parton music. Then again, I'm in Canada. It takes a lot for me to be willing to go to the US for a theme park.",
                "score": 7,
                "date": 1644424290.0
            },
            {
                "user": "funemployment_check",
                "comment": "Dolly For Pres?",
                "score": 5,
                "date": 1644428172.0
            },
            {
                "user": "SicDigital",
                "comment": "Jolene ain't got shit on Dolly.",
                "score": 3,
                "date": 1644428463.0
            },
            {
                "user": "karpetbagger45",
                "comment": "Not a Dolly Parton fan by any stretch of the imagination but I can recognize, that she has ALWAYS been a CLASS act...",
                "score": 11,
                "date": 1644421600.0
            },
            {
                "user": "letuswatchtvinpeace",
                "comment": "There she goes again! Showing and proving how to be a very good person",
                "score": 2,
                "date": 1644425713.0
            },
            {
                "user": "Sashaband",
                "comment": "We have to protect her.  She's our new Betty White.  May she live forever.",
                "score": 2,
                "date": 1644427292.0
            },
            {
                "user": "WiggleBrushCrew",
                "comment": "And they only have to work 9 to 5 what a way to make a living. Sorry had too",
                "score": 2,
                "date": 1644427489.0
            },
            {
                "user": "yfh227",
                "comment": "Dolly fucking Parton folks. Lover her.",
                "score": 2,
                "date": 1644427711.0
            },
            {
                "user": "12Purple",
                "comment": "Dolly Parton is a goddess.",
                "score": 2,
                "date": 1644428315.0
            },
            {
                "user": "HalfSoul30",
                "comment": "Dolly is a national treasure",
                "score": 2,
                "date": 1644428461.0
            },
            {
                "user": "SPI-vot",
                "comment": "Dolly is dope",
                "score": 2,
                "date": 1644428478.0
            },
            {
                "user": "Omegaprimus",
                "comment": "I am so proud of Saint Dolly Parton. Every time I hear of the latest WTF from my state Tennessee, Saint Dolly does something fantastic to remind me that not everyone in the state is awful.",
                "score": 2,
                "date": 1644428571.0
            },
            {
                "user": "Reeserella",
                "comment": "Ive never wanted to go to a theme park more.",
                "score": 2,
                "date": 1644429783.0
            },
            {
                "user": "HiddenSquid7392",
                "comment": "I’m not a fan of her music at all, but damn if Dolly isn’t a national treasure and deserves more recognition for the charitable work she does",
                "score": 2,
                "date": 1644429791.0
            },
            {
                "user": "I_Am_Anjelen",
                "comment": "Damn, can I work remote for Dollywood ?",
                "score": 2,
                "date": 1644429875.0
            },
            {
                "user": "lakenakomis",
                "comment": "Dolly for President!?!? 😀",
                "score": 2,
                "date": 1644430165.0
            },
            {
                "user": "VinceFromScammedHow",
                "comment": "Why are musicians and random public figures consistently better bosses than people with MBAs (oh, that's why lol) spent their entire lives being groomed into executives?",
                "score": 2,
                "date": 1644430740.0
            },
            {
                "user": "funknjam",
                "comment": "Dolly Parton is a national treasure.",
                "score": 2,
                "date": 1644430819.0
            },
            {
                "user": "imAvlasicMan",
                "comment": "Dolly is our new Betty White!!!",
                "score": 2,
                "date": 1644431060.0
            },
            {
                "user": "SmilinObserver111",
                "comment": "Dolly is a real one! It's gonna be a sad day when she checks out.",
                "score": 2,
                "date": 1644431100.0
            },
            {
                "user": "SkaTSee",
                "comment": "Remindme! 5 years \"How is Dollywood's education program holding up\"",
                "score": 2,
                "date": 1644431249.0
            },
            {
                "user": "--__ll__--",
                "comment": "Dolly Parton is a national treasure",
                "score": 2,
                "date": 1644431253.0
            },
            {
                "user": "xxMrAdamsxx",
                "comment": "Dolly is a damn saint and a national treasure. God bless that woman.",
                "score": 2,
                "date": 1644431299.0
            },
            {
                "user": "telestrial",
                "comment": "She just doesn't stop being great, does she?",
                "score": 2,
                "date": 1644431337.0
            },
            {
                "user": "405134",
                "comment": "Wow. I almost want to move to Tennessee , and work for Dolly so I can start my masters degree. I’m glad she’s doing this (it might be a stretch for me) but this is perfect for young people that cant afford college. How many “would be” doctors are out there because they couldn’t afford college? How many breakthroughs in science and technology are we missing out on because colleges have made it impossible for the everyday worker to afford.! Shame on colleges. Thank you for being a true humanitarian Dolly",
                "score": 2,
                "date": 1644431594.0
            },
            {
                "user": "JanthonyGo",
                "comment": "🐐",
                "score": 2,
                "date": 1644431658.0
            },
            {
                "user": "Butch1212",
                "comment": "Right On Dolly!!! You are a great gal.",
                "score": 2,
                "date": 1644434289.0
            },
            {
                "user": "Jefc141",
                "comment": "Take notes Beyonce and other “queens” this is how it’s done.",
                "score": 2,
                "date": 1644434409.0
            },
            {
                "user": "mallism5",
                "comment": "We don’t deserve Dolly. She is a saint.",
                "score": 2,
                "date": 1644434473.0
            },
            {
                "user": "Mortimer_and_Rabbit",
                "comment": "Dolly Parton is at the perfect intersection of Fucking Fabulous and sweeter than apple pie.",
                "score": 2,
                "date": 1644434588.0
            },
            {
                "user": "Bigram03",
                "comment": "I love that woman.",
                "score": 2,
                "date": 1644434590.0
            },
            {
                "user": "hiswifenotyours",
                "comment": "Dolly Parton is a national treasure.",
                "score": 2,
                "date": 1644434623.0
            },
            {
                "user": "threestoplights",
                "comment": "wait, she’s not using her riches to go to space?",
                "score": 2,
                "date": 1644434734.0
            },
            {
                "user": "scooterbot4",
                "comment": "Dolly Parton is a saint. Begin the process.",
                "score": 2,
                "date": 1644434748.0
            },
            {
                "user": "audioscience",
                "comment": "I moved to Tennessee a year and a half ago and Dolly Parton is by far the best thing about it. God damn, she is great.  I'm happy to share this state with her.",
                "score": 2,
                "date": 1644434861.0
            },
            {
                "user": "goingandgoing97",
                "comment": "Amazing❤️",
                "score": 2,
                "date": 1644434893.0
            },
            {
                "user": "Radioactivechimi",
                "comment": "We don't deserve Dolly. She's a shining beacon in this dark world.",
                "score": 2,
                "date": 1644434905.0
            },
            {
                "user": "roundhouse306",
                "comment": "As a person born in East Tennessee, it’s good to see some good news coming from here. She is a saint.",
                "score": 2,
                "date": 1644434960.0
            },
            {
                "user": "Phoenyxoldgoat",
                "comment": "Silver Dollar City announced this today too. I think they are both owned by Herschend.",
                "score": 2,
                "date": 1644435033.0
            },
            {
                "user": "WowzaCannedSpam",
                "comment": "Dolly Parton is legitimately a saint. I don’t even know anymore man. What a great person. Her entire career has been nothing but spreading love and compassion.",
                "score": 2,
                "date": 1644435106.0
            },
            {
                "user": "Account_Expired",
                "comment": "Most kids i know would work at places like this for a summer and then move on.\n\nIf they can keep workers for 4 years they will probably have lower turnover than just about any similar job.",
                "score": 2,
                "date": 1644435160.0
            },
            {
                "user": "Powerstroke1987",
                "comment": "This woman is a national treasure. Between her Imagination Library and what she did for Sevierville when it burned, and her general philanthropy, she's an incredible person",
                "score": 2,
                "date": 1644435190.0
            },
            {
                "user": "DownVotingCats",
                "comment": "Wow, look how awesome basic human decency is. Allowing those who want education to get it. Why would someone hinder that? Dolly is a gem.",
                "score": 2,
                "date": 1644435393.0
            },
            {
                "user": "YanwarC",
                "comment": "Wtf. I should have worked there all my life instead of trying to pay for this private loan all my life.",
                "score": 2,
                "date": 1644435395.0
            },
            {
                "user": "Regular_Emotional",
                "comment": "♥️♥️♥️ Dolly is such a perfect human",
                "score": 2,
                "date": 1644435428.0
            },
            {
                "user": "FapplePie85",
                "comment": "Meanwhile, Elon is over here crying about satellites. \n\nDolly for president. She will save us.",
                "score": 2,
                "date": 1644435480.0
            },
            {
                "user": "SerKnight",
                "comment": "I work for Guild Education the company implementing this program for Dolly Parton's businesses. If you want to get involved with us and see any jobs shoot me a DM.\n\nhttps://guildeducation.com/careers",
                "score": 2,
                "date": 1644435569.0
            },
            {
                "user": "Mamalocs",
                "comment": "Dolly is an absolute Queen!",
                "score": 2,
                "date": 1644435646.0
            },
            {
                "user": "PlusUltra1152",
                "comment": "Just... cancel federal student debt congress.\n\n&#x200B;\n\nIsn't it weird though that a business can potentially subsidize on a cost of public federal education university tuition to possibly get a federally backed plan for a business cost? So I mean, it's possibly some sort of write off.\n\nThe idea is nice and it's better to make congress address the wider problem of federal student loans.\n\n&#x200B;\n\nedit: came back to say DOWN VOTE ME ON MY THOUGHTS ;\\_; (before it happens)",
                "score": 2,
                "date": 1644435984.0
            },
            {
                "user": "War3agle",
                "comment": "How does it feel to be a good person.  Love ya Dolly.",
                "score": 2,
                "date": 1644437326.0
            },
            {
                "user": "stuff1180",
                "comment": "That woman should run this country.",
                "score": 2,
                "date": 1644437436.0
            },
            {
                "user": "Beta_Soyboy_Cuck",
                "comment": "That’s huge.",
                "score": 2,
                "date": 1644437522.0
            },
            {
                "user": "oldmanian",
                "comment": "She’s just the best. Just the best.",
                "score": 2,
                "date": 1644437697.0
            },
            {
                "user": "doc6982",
                "comment": "What's the secular equivalent of canonization?",
                "score": 2,
                "date": 1644437750.0
            },
            {
                "user": "NormalGap2",
                "comment": "A Queen living amongst us.",
                "score": 2,
                "date": 1644437775.0
            },
            {
                "user": "Cucumbrsandwich",
                "comment": "I need one of those prayer candles with Dolly’s face on it. She is a saint.",
                "score": 2,
                "date": 1644437856.0
            },
            {
                "user": "theBatThumb",
                "comment": "DOLLY FOR PRESIDENT! How can anyone not love Dolly Parton???",
                "score": 2,
                "date": 1644438037.0
            },
            {
                "user": "Gainzster",
                "comment": "Moving to Dollywood",
                "score": 2,
                "date": 1644438104.0
            },
            {
                "user": "thatsingledadlife",
                "comment": "That woman is a national treasure and this is just another example of why.",
                "score": 2,
                "date": 1644438373.0
            },
            {
                "user": "craigwantsnack",
                "comment": "Bezos take note.",
                "score": 2,
                "date": 1644438952.0
            },
            {
                "user": "vintimus",
                "comment": "This is outstanding",
                "score": 2,
                "date": 1644439029.0
            },
            {
                "user": "KaidsCousin",
                "comment": "She’s a good gal alright.",
                "score": 2,
                "date": 1644439047.0
            },
            {
                "user": "rootines",
                "comment": "Love that. More businesses should probably do this.",
                "score": 2,
                "date": 1644439377.0
            },
            {
                "user": "ax255",
                "comment": "She is a unique gem in a sea of fake and lab made jewelry.",
                "score": 2,
                "date": 1644439680.0
            },
            {
                "user": "Xtreyu",
                "comment": "This is just another reasons of the long list of reasons why she is an Angel.",
                "score": 2,
                "date": 1644439748.0
            },
            {
                "user": "GarnetOblivion1",
                "comment": "Dolly is who people thought ellen was.",
                "score": 2,
                "date": 1644439952.0
            },
            {
                "user": "CandidnClassy210",
                "comment": "Walt Disney World started a program very similar to this 3 years ago. It has been great! My husband has had most of his bachelor’s degree paid for by them.\n\nIt’s called the Disney Aspire program. All full and part time workers at Disney can have their college classes and books paid for at University of Central Florida, the local community college, or a number of other universities.  I’m sure this is where Dollywood got the idea from.\n\nAlthough Disney requires employees to work there for 90 days before they qualify to start having their classes and books paid for. 90 days isn’t a long time to have to work somewhere before receiving a guaranteed a full scholarship.",
                "score": 2,
                "date": 1644440026.0
            },
            {
                "user": "FuturePastNow",
                "comment": "Tear down the Confederate statues and replace them with statues of Dolly",
                "score": 2,
                "date": 1644440453.0
            },
            {
                "user": "wtfiswrongwmyhair",
                "comment": "I’m going to cry. What an angel. She seems like a “Can’t take it to heaven, so might as well leave it all behind” person when it comes to using her wealth for charity. I’ve never heard anyone have a single bad thing to say about her.",
                "score": 2,
                "date": 1644442310.0
            },
            {
                "user": "446bridges",
                "comment": "How much money does dolly have!",
                "score": 2,
                "date": 1644442891.0
            },
            {
                "user": "saturatedbloom",
                "comment": "She’s such a Diamond!",
                "score": 2,
                "date": 1644443140.0
            },
            {
                "user": "jaygraham500",
                "comment": "She is so awesome",
                "score": 2,
                "date": 1644443158.0
            },
            {
                "user": "StillGotLove4GOT",
                "comment": "Dolly Parton is a gift!",
                "score": 2,
                "date": 1644443176.0
            },
            {
                "user": "surlygentleman1981",
                "comment": "Dolly is pretty amazing",
                "score": 2,
                "date": 1644443715.0
            },
            {
                "user": "outinthecountry66",
                "comment": "Dolly, man. Righteous human being in a world of grifters.",
                "score": 2,
                "date": 1644443826.0
            },
            {
                "user": "misterbuh",
                "comment": "Please let Dollyworld replace Disneyworld. I’ll pay ten bucks for an elephant ear at Dollyworld with this news versus at Disneyworld",
                "score": 2,
                "date": 1644444189.0
            },
            {
                "user": "Duke_Newcombe",
                "comment": "Go ahead and award her the presidential medal of freedom, already? This woman is a national treasure, and a bright gem during these dark times. Good on her!",
                "score": 2,
                "date": 1644449492.0
            },
            {
                "user": "Balls_DeepinReality",
                "comment": "I’ve mentioned it before, but I did work with their retirement plan as an investment advisor.\n\nEvery single one of them people adored that woman and that job. None of the other 300 or some odd employers we had would have employees say much positive, but Dollywood is just something else",
                "score": 2,
                "date": 1644450365.0
            },
            {
                "user": "Slow_Advertising1181",
                "comment": "Yeah, remember when that squidbillies douchebag who thought that he could talk shit about Dolly Parton and got fired because of it? This is one more of the many reasons why people love and protect Dolly. You don't fuck with Dolly or else you may find out",
                "score": 2,
                "date": 1644450879.0
            },
            {
                "user": "DeLuniac",
                "comment": "She should have every single award that can be awarded by congress and the president.",
                "score": 2,
                "date": 1644450997.0
            },
            {
                "user": "felicxahundito",
                "comment": "She is a national treasure.",
                "score": 2,
                "date": 1644451646.0
            },
            {
                "user": "MissDollyDevine",
                "comment": "One of the many reasons I love Dolly! This is amazing 👏🏻",
                "score": 2,
                "date": 1644451649.0
            },
            {
                "user": "veginout58",
                "comment": "This what a successful person (who isn't some small dick egomaniac) does with their wealth.",
                "score": 2,
                "date": 1644452884.0
            },
            {
                "user": "powercrazy76",
                "comment": "can she just run for president? She's about the one person we have left that both sides love and frankly, I'm sure her kindness, charity and bullheaded determination would do more to flush the swamps of D.C. Getting shit done that the People actually need, make everybody enjoy the debate, see each other's side, and have a gosh darn swell great time decidin' on thangs!",
                "score": 2,
                "date": 1644453985.0
            },
            {
                "user": "SnowAngel41",
                "comment": "Reminds me of Scott’s Tots",
                "score": 2,
                "date": 1644454238.0
            },
            {
                "user": "ShadowGLI",
                "comment": "Well Dolly is a national treasure soooo….",
                "score": 2,
                "date": 1644454479.0
            },
            {
                "user": "Bnagorski",
                "comment": "Dolly Parton should not only run for President, she should win the Nobel Peace Prize. No American has treated their obscene wealth with more grace, humility, and charity",
                "score": 2,
                "date": 1644454534.0
            },
            {
                "user": "cachaco7",
                "comment": "Could you imagine if all companies where as compassionate as hers? Maaaaan this is so awesome!",
                "score": 2,
                "date": 1644454611.0
            },
            {
                "user": "EvanescentDoe",
                "comment": "Dolly Parton can do whatever she wants",
                "score": 2,
                "date": 1644454817.0
            },
            {
                "user": "musickismagick",
                "comment": "If only dolly had Jeff bezos money. Think what she could do.",
                "score": 2,
                "date": 1644455469.0
            },
            {
                "user": "gojirscor",
                "comment": "TIL Dolly Parton owns a sick theme park",
                "score": 2,
                "date": 1644455884.0
            },
            {
                "user": "SuperRonnie2",
                "comment": "Dolly for president! But unaffiliated with both the Dems and the GOP.",
                "score": 2,
                "date": 1644456060.0
            }
        ]
    },
    {
        "flair": "discussion",
        "title": "Chris Brown steals my video.",
        "author": "visualdon",
        "date": 1571576949.0,
        "score": 80682,
        "description": "[Screenshot](https://i.imgur.com/SyY5Z7f.jpg)\n\n[My original post](https://www.instagram.com/p/B14FoAMH7io/) & [Post on his Instagram @chrisbrownofficial](https://www.instagram.com/p/B3zqK1yhEY3/)\n\n[I also posted this visual to reddit a while ago](https://old.reddit.com/r/woahdude/comments/cycxyu/a_space_visual_i_just_made/)\n\nI actually let people download my visuals free as long I am credited, many people do not credit unfortunately.",
        "comments": [
            {
                "user": "g4_",
                "comment": "This will get lost in the noise, but in 2009 Chris Brown stole my hand sanitizer after he made us shut down the roller coaster that i was in charge of at an amusement park in Virginia. \n\nThey shut down the line and made us send him and his loud and annoying posse on the coaster by themselves. Then, after the ride, he asks if we have any hand sanitizer (because public touching the coaster seats etc.) then walked off with it, passing it around.\n\nHe didn't give it back",
                "score": 312,
                "date": 1571600876.0
            },
            {
                "user": "Baddaboombaddabing",
                "comment": "If memory serves he's done this before:\nhttps://www.google.com/amp/s/entertainment.inquirer.net/272384/p2fb-chris-brown-steals-comic-artists-work-to-promote-his-streetwear-line/amp",
                "score": 721,
                "date": 1571583842.0
            },
            {
                "user": "thinkB4WeSpeak",
                "comment": "I never understood how Chris Brown can be such a proven dick but people still listen to his stuff.",
                "score": 2682,
                "date": 1571582347.0
            },
            {
                "user": "all-men-die",
                "comment": "At least he didn’t beat you to nigh death lol.",
                "score": 5082,
                "date": 1571577069.0
            },
            {
                "user": "Cerebral_Savage",
                "comment": "I’d say you could use his music in the background of your next project and wait to see what happens, but I can’t name a single Chris Brown song. I know him more for being like 3-0 in street fights with women.",
                "score": 2084,
                "date": 1571578267.0
            },
            {
                "user": "hambone1112",
                "comment": "Chris Brown is feces",
                "score": 535,
                "date": 1571579361.0
            },
            {
                "user": "bruiser95",
                "comment": "Why does insta not have a copyright infringement option in their report menu?",
                "score": 354,
                "date": 1571580905.0
            },
            {
                "user": "Fckdisaccnt",
                "comment": "Time to sue lol",
                "score": 185,
                "date": 1571579368.0
            },
            {
                "user": "DeltaDe",
                "comment": "I don’t know why people still like this guy...",
                "score": 87,
                "date": 1571581925.0
            },
            {
                "user": "Mccobsta",
                "comment": "Dmca it",
                "score": 39,
                "date": 1571583553.0
            },
            {
                "user": "SillyPhily21",
                "comment": "But I’m sure of you stole his content, he wouldn’t be very happy at all....",
                "score": 89,
                "date": 1571578244.0
            },
            {
                "user": "battlelevel",
                "comment": "This sucks for you. It's not super surprising though, Chris Brown is an enormous piece of shit",
                "score": 70,
                "date": 1571582957.0
            },
            {
                "user": "Penultimate_Push",
                "comment": "His stupid song doesn't even go with the visual well.",
                "score": 78,
                "date": 1571581309.0
            },
            {
                "user": "BuckeyeBikeNHike",
                "comment": " Pretty much all artists believe their art is automatically copyrighted the instant it's completed and protected from acts of infringement-- and they're right, it is. According to United States Copyright Law, and quoting from the copyright.gov website, your art is considered copyright protected from \"the moment it is created and fixed in a tangible form that it is perceptible either directly or with the aid of a machine or device.\" Sounds like everything's peachy and you're covered, right? Not so fast.\n\nYes, your art is automatically copyrighted, but believing that no further action is necessary in terms of formally registering it with the United States Copyright Office can be a major mistake. According to Copyright Law, formally registering works of art is far more advantageous over not registering them in several very substantial ways. Before getting into specifics here, be aware that only certain types of art are likely to be infringed upon. Most art has little or no appeal to infringers. Why? Because infringers almost always do what they do to make money, and tend to only steal images that are capable of generating income in one way or another. However the opposite can also take place-- where infringers take images to use on websites or in film sets where the benefits or profit potential may be less straightforward. No matter what the circumstances, the broader the appeal of your art and the easier your imagery and compositions are for people to recognize, understand and appreciate (and appropriate), the more concerned you should be about registering them. This is especially true if your images are so attractive that people actively attempt to take and display them in various ways.\n\nNow should all artists register every single work of art they create? Not really. In fact, few artists are truly at risk, especially those who produce more abstract or conceptual works, art with substantial cognitive components, art that's difficult and nonproductive from monetary standpoints to copy or reproduce, and art with limited commercial appeal. The basic question you should ask yourself is this-- \"Am I vulnerable to someone taking my art, copying and reproducing it in a big way and making lots of money?\"\n\nThe artists who have to be most concerned about infringement are those whose images or designs have somewhat of a mass or commercial appeal, and are easy and conducive to being copied-- particularly onto other mediums such as T-shirts, coffee mugs, shoes, bags, skateboards, or similar types of mass-produced merchandise that have the potential to be salable across wide ranges of the population. Having a large online following may be a determining factor as well. Also vulnerable is art with creatures, characters or settings that could conceivably be \"borrowed\" and replicated in films, animation, comics or video games... or even in the work of other artists. Having a large online following may be a determining factor as well. If you've got a respectable fan base and make art with any of these characteristics or components, registering the copyrights is generally recommended.\n\nAnother indication that copyrighting your art would be a good idea is if you've developed a particular type of look or composition or subject matter that is identified as being uniquely yours, especially if it's becoming increasingly popular with collectors. Although you can't register \"style\" itself, you can register any number of works of art that are done in your own unique style. This protects you against infringers who decide to copy one or more of them for their own personal benefits. Imitation is the sincerest form of flattery, they say, but if it begins to detract from your bottom line, then defending your interests will likely become necessary at some point. And the sooner you recognize that a possibility exists for appropriating and capitalizing on your artworks, the better.\n\nSo OK-- let's get started. Why go through the process of formally copyrighting your art? Four basic reasons:\n\n1. Suppose someone reproduces some aspect or characteristic of your art without your permission. If the art was not registered prior to the infringement, you are limited to the infringer's profits as your damages. For example, if an infringer prints your art on T-shirts, sells 500 of them and makes a clear profit of $10 per shirt, you're limited to that $5000 profit as the amount you can recover (if that $5000 profit is before costs, your limitation will be even less-- that is, whatever profit remains after subtracting all costs of production). If on the other hand, you have registered the art, you are entitled to \"statutory damages\" of up to $150,000 per willful infringement, and you can elect to take that instead of actual damages (a clear choice in our hypothetical T-shirt example). Statutory damages are punitive in nature, but only available as an option to you if you register the copyrights on art before the infringement.\n\n2. If the art is registered prior to the infringement, then in addition to statutory damages, the court is authorized to award you attorney's fees plus other incidental costs of litigation. You are not entitled to obtain a judgment that includes these costs or fees if the art was not registered prior to the infringement.\n\n3. If a work of your art is infringed on and it's not registered, you have to go ahead and register it anyway before you can bring a copyright action in federal court (file a federal case). So you see, you aren't saving anything by not registering it in advance-- it has to be registered regardless if you intend to take legal action; registration is a procedural requirement in that regard.\n\n4. Registering your art in advance of an infringement proves prima-facie that you created the image when you say you did. In other words, the registration documents constitute sufficient evidence to prove the art was created before the infringement. Without a prior registration, the date of creation could be contested; the infringers could maintain that you actually created it later than you did. So it all shakes out like this... With prior registration, the burden of proof is on the infringer to demonstrate that they created their work either before or independently of you creating yours. Without prior registration, the burden of proof is on you to demonstrate that you created the work first, and that they willfully appropriated it for their own purposes without your consent. That's a huge difference.\n\nFor these reasons, attorneys are far more likely to take infringement cases on a contingency fee basis when the art has been registered prior to the infringements. Resolving claims on registered works of art is always easier for attorneys and copyright holders because the documented prior registration constitutes conclusive proof that the creation of the art predated the infringement. Attorneys have far greater leverage moneywise as well, particularly in terms of being able to seek statutory damages and be reimbursed for their fees. On the flip side, attorneys tend to avoid cases involving unregistered art, especially on a contingency basis, because not only is the total award limited to amount of profit made by the infringers, but without prior registration, proving the creation of the art predated the infringement can also get complicated. Either the amount of profit made by infringers has to be large enough for attorneys to consider taking a case on a contingency basis or they will expect you to pay their costs and fees out-of-pocket as the case progresses.\n\nWhether you decide to register your art or not, the least you can do is to make your copyright clear to everyone concerned. Place a notice on your website that all images are copyright protected. This notice should include the copyright symbol (c), the year (very important) and your name. Place copyright notices on each individual work of art as well (you can do this either on the front, or on the back if you feel the notices might in some way clash with the compositions).\n\n [https://www.artbusiness.com/register\\_and\\_copyright\\_art\\_for\\_artists.html](https://www.artbusiness.com/register_and_copyright_art_for_artists.html)",
                "score": 39,
                "date": 1571585260.0
            },
            {
                "user": "Preversive",
                "comment": "So get it down.\n\n  \n[https://help.instagram.com/contact/552695131608132](https://help.instagram.com/contact/552695131608132)",
                "score": 25,
                "date": 1571583591.0
            },
            {
                "user": "evro6",
                "comment": "Post on legal advice or something like that. You should get some money off him, unless you want him to just stop using your stuff because he's a garbage human being. That's up to you.",
                "score": 141,
                "date": 1571582947.0
            },
            {
                "user": "PenTaFH",
                "comment": "Sue the fuck. He deserves it",
                "score": 38,
                "date": 1571582458.0
            },
            {
                "user": "coolboy2984",
                "comment": "Literally just DMCA him. He used your visuals without permission. If it was anyone else I think just telling them to credit you would be fine, but fuck Chris Brown.",
                "score": 11,
                "date": 1571587415.0
            },
            {
                "user": "SomeKindaMech",
                "comment": "Chris Brown is the picture next to \"douchebag\" in the dictionary. I hope he steps on a LEGO",
                "score": 31,
                "date": 1571582680.0
            },
            {
                "user": "The_Thrill17",
                "comment": "Every time I hear Chris Brown mentioned he always is doing something super chill. What a good guy.",
                "score": 52,
                "date": 1571580646.0
            },
            {
                "user": "weedstocks",
                "comment": "Wasn't he that guy in that gum commerical? \n\nToo bad they didn't use his favorite flavour,  tropical punch.",
                "score": 44,
                "date": 1571579075.0
            },
            {
                "user": "commando_cookie0",
                "comment": "Brown was driving a vehicle with Robyn F. as the front passenger on an unknown street in Los Angeles. Robyn F. picked up Brown's cellular phone and observed a three-page text message from a woman who Brown had a previous sexual relationship with.\n\nA verbal argument ensued and Brown pulled the vehicle over on an unknown street, reached over Robyn F. with his right hand, opened the car door and attempted to force her out. Brown was unable to force Robyn F. out of the vehicle because she was wearing a seat belt. When he could not force her to exit, he took his right hand and shoved her head against he passenger window of the vehicle, causing an approximate one-inch raised circular contusion.\n\nRobyn F. turned to face Brown and he punched her in the left eye with his right hand. He then drove away in the vehicle and continued to punch her in the face with his right hand while steering the vehicle with his left hand. The assault caused Robyn F.'s mouth to fill with blood and blood to splatter all over her clothing and the interior of the vehicle.\n\nBrown looked at Robyn F. and stated, 'I'm going to beat the sh-- out of you when we get home! You wait and see!'\n\nThe detective said \"Robyn F.\" then used her cell phone to call her personal assistant Jennifer Rosales, who did not answer.\n\nRobyn F. pretended to talk to her and stated, 'I'm on my way home. Make sure the police are there when I get there.'\n\nAfter Robyn F. faked the call, Brown looked at her and stated, 'You just did the stupidest thing ever! Now I'm really going to kill you!'\n\nBrown resumed punching Robyn F. and she interlocked her fingers behind her head and brought her elbows forward to protect her face. She then bent over at the waist, placing her elbows and face near her lap in [an] attempt to protect her face and head from the barrage of punches being levied upon her by Brown.\n\nBrown continued to punch Robyn F. on her left arm and hand, causing her to suffer a contusion on her left triceps (sic) that was approximately two inches in diameter and numerous contusions on her left hand.\n\nRobyn F. then attempted to send a text message to her other personal assistant, Melissa Ford. Brown snatched the cellular telephone out of her hand and threw it out of the window onto an unknown street.\n\nBrown continued driving and Robyn F. observed his cellular telephone sitting in his lap. She picked up the cellular telephone with her left hand and before she could make a call he placed her in a head lock with his right hand and continued to drive the vehicle with his left hand.\n\nBrown pulled Robyn F. close to him and bit her on her left ear. She was able to feel the vehicle swerving from right to left as Brown sped away. He stopped the vehicle in front of 333 North June Street and Robyn F. turned off the car, removed the key from the ignition and sat on it.\n\nBrown did not know what she did with the key and began punching her in the face and arms. He then placed her in a head lock positioning the front of her throat between his bicep and forearm. Brown began applying pressure to Robyn F.'s left and right carotid arteries, causing her to be unable to breathe and she began to lose consciousness.\n\nShe reached up with her left hand and began attempting to gouge his eyes in an attempt to free herself. Brown bit her left ring and middle fingers and then released her. While Brown continued to punch her, she turned around and placed her back against the passenger door. She brought her knees to her chest, placed her feet against Brown's body and began pushing him away. Brown continued to punch her on the legs and feet, causing several contusions.\n\nRobyn F. began screaming for help and Brown exited the vehicle and walked away. A resident in the neighborhood heard Robyn F.'s plea for help and called 911, causing a police response. An investigation was conducted and Robyn F. was issued a Domestic Violence Emergency Protective Order.",
                "score": 84,
                "date": 1571586497.0
            },
            {
                "user": "Fleeinian",
                "comment": "Thieving bastard",
                "score": 19,
                "date": 1571580998.0
            },
            {
                "user": "FanofK",
                "comment": "Could be a case of whoever he had do this stole it since  that happens a lot with artist and companies.",
                "score": 5,
                "date": 1571584512.0
            },
            {
                "user": "Crazyhates",
                "comment": "You might want to start lightly watermarking/logo your stuff man. I know it's for a greater good, but you gotta take care of home base too.",
                "score": 5,
                "date": 1571584930.0
            },
            {
                "user": "mbv1010",
                "comment": "report it. pulled this from the IG website after having to dig thru 2-3 pages-- \n\n&#x200B;\n\nIf you believe someone is infringing your copyright, you can report it to us by filling out [this form](https://help.instagram.com/contact/552695131608132). You can also contact our designated agent. If you contact our designated agent, please be sure to include a [complete copyright claim](https://help.instagram.com/454257084652404) in your report.\n\nBefore you submit a report of copyright infringement, you may want to send a message to the person who posted the content. You may be able to resolve the issue without contacting Instagram.\n\nRemember, only the copyright owner or their authorized representative may file a report of copyright infringement. If you believe something on Instagram infringes someone else’s copyright, you may want to let the rights owner know.\n\nPlease note that we regularly provide the rights owner’s name, your email address and the details of your report to the person who posted the content you are reporting. In the case that you are an authorized representative submitting a report, we provide the name of the organization or client that owns the right in question. You may wish to provide a valid generic business or professional email address for this reason.",
                "score": 4,
                "date": 1571588262.0
            },
            {
                "user": "Thepopcornrider",
                "comment": "What?  Chris Brown is an upstanding citizen and I don't believe he would do something as despicable as stealing intellectual property.",
                "score": 4,
                "date": 1571591684.0
            },
            {
                "user": "HeartofSaturdayNight",
                "comment": "Well knowing what I know about Chris Brown, I'm sure he will immediately apologize for any wrongdoing, take full responsibility for his actions and become a better person.",
                "score": 6,
                "date": 1571593205.0
            },
            {
                "user": "Aceholeas",
                "comment": "Looks like he... Beat you to it",
                "score": 3,
                "date": 1571595570.0
            },
            {
                "user": "pnlhotelier",
                "comment": "Obligatory; this is not legal advise and cannot be construed or taken as legal advice. I am not your lawyer.\n\nI personally would delete the post and just file DMCA.  \n\nThere is a mechanism used in copyright law called declaratory relief, where Chris Brown's legal team could sue you as an affirmative step in resolving a copyright issue. \n\nBest to remove this post and consult a lawyer in your area. Idk if the UK has free consulting,  but that is where I would start.",
                "score": 5,
                "date": 1571623783.0
            },
            {
                "user": "LocusAintBad",
                "comment": "From beating woman to stealing videos. What an actual piece of human garbage.",
                "score": 12,
                "date": 1571581145.0
            },
            {
                "user": "Trackmaster15",
                "comment": "Didn't Chris Brown beat a bunch of women?",
                "score": 6,
                "date": 1571594209.0
            },
            {
                "user": "deadzone404",
                "comment": "Copywrite strike that piece of shit",
                "score": 8,
                "date": 1571583323.0
            },
            {
                "user": "undecided399",
                "comment": "I like how the comments are limited so now you can’t comment on it and call him out.",
                "score": 3,
                "date": 1571585244.0
            },
            {
                "user": "aybbyisok",
                "comment": "DMCA it",
                "score": 3,
                "date": 1571587963.0
            },
            {
                "user": "BleakGod",
                "comment": "I'm 90% certain he did not do this himself, but it was done in his name.",
                "score": 3,
                "date": 1571589872.0
            },
            {
                "user": "LordYamz",
                "comment": "Chris Brown is a douche",
                "score": 3,
                "date": 1571591281.0
            },
            {
                "user": "ragormack",
                "comment": "Fuck Chris Brown",
                "score": 3,
                "date": 1571591532.0
            },
            {
                "user": "bryceconn22",
                "comment": "Lmao the ten trillionth reason to hate Chris brown",
                "score": 3,
                "date": 1571591824.0
            },
            {
                "user": "IloveTieflings",
                "comment": "He does this shit a lot",
                "score": 3,
                "date": 1571592299.0
            },
            {
                "user": "PandaXXL",
                "comment": "People actually think Chris Brown stole the video himself?",
                "score": 3,
                "date": 1571596008.0
            },
            {
                "user": "missweach",
                "comment": "He blocked me after I commented to credit you.",
                "score": 3,
                "date": 1571604856.0
            },
            {
                "user": "fbtra",
                "comment": "He locked the comment limit early this morning on the picture",
                "score": 3,
                "date": 1571605198.0
            },
            {
                "user": "BeebleBoxn",
                "comment": "Ah I'm one of your followers...  Hope you can get this sorted out.",
                "score": 3,
                "date": 1571605820.0
            },
            {
                "user": "isomorphZeta",
                "comment": "Chris Brown is a piece of human garbage. Fuck him and his piece of shit, domestic violence enabling fans.",
                "score": 3,
                "date": 1571623848.0
            },
            {
                "user": "fluxusflow",
                "comment": "Shit I thought this looked familiar. I downloaded your original post as a background because it looked fucking fantastic. \n\nFuck Chris Brown.",
                "score": 3,
                "date": 1571623874.0
            },
            {
                "user": "framsay1",
                "comment": "And he seemed like such a nice man otherwise.",
                "score": 3,
                "date": 1571623888.0
            },
            {
                "user": "KudagFirefist",
                "comment": "At least he didn't beat the ever-loving shit out of you?",
                "score": 3,
                "date": 1571623893.0
            },
            {
                "user": "Weddsinger29",
                "comment": "I have been a concert photographer for 8 years. Welcome to the club",
                "score": 3,
                "date": 1571624345.0
            },
            {
                "user": "satoru1111",
                "comment": "https://help.instagram.com/454951664593304\n\nInstagram has a DMCA form from where you can have he offending artwork removed",
                "score": 3,
                "date": 1571629806.0
            },
            {
                "user": "LivinthatDream",
                "comment": "Chris Brown is a piece of shit.",
                "score": 3,
                "date": 1571632890.0
            },
            {
                "user": "Lt-Pickles",
                "comment": "Well, at least he didn’t beat yourself video and give it black eyes.",
                "score": 3,
                "date": 1571637621.0
            },
            {
                "user": "spideyjiri",
                "comment": "Chris Brown is a violent psychopath who won't stop or change his ways because he doesn't need to, he literally has a tattoo of Rihanna's bloody beat up face on his neck from that time he tried to kill her.\n\nAnd he has continued his streak of violence ever since, assaulting women and generally anyone he can get away with because he's filthy rich, one day he will kill someone and that might finally land him in jail for good.",
                "score": 3,
                "date": 1571647650.0
            }
        ]
    },
    {
        "flair": "article",
        "title": "Taylor Swift's private jets took 170 trips this year, landing her #1 on a new report that tracks the carbon emissions of celebrity private jets",
        "author": "YoureASkyscraper",
        "date": 1659194955.0,
        "score": 73869,
        "description": "Article: https://www.rollingstone.com/music/music-news/kylies-17-minute-flight-has-nothing-on-the-170-trips-taylor-swifts-private-jets-took-this-year-1390083/\n\nAs the world quite literally burns and floods, it’s important to remember that individualism won’t really solve the climate crisis, especially compared to, say, the wholesale dismantling of the brutal grip the fossil fuel industry has on modern society. Still, there are some individuals who could probably stand to do a bit more to mitigate their carbon footprint — among them, the super-wealthy who make frequent use of carbon-spewing private jets. (And let’s not even get started on yachts.)\n\nWhile private jets are used by rich folks of all kinds, their use among celebrities has come under scrutiny recently, with reports of the likes of Drake and Kylie Jenner taking flights that lasted less than 20 minutes. In response, the sustainability marketing firm Yard put together a new report using data to rank the celebrities whose private jets have flown the most so far this year — and subsequently dumped the most carbon dioxide into the atmosphere. \n\nDrake and Jenner both appear on the list, but they’re actually nowhere near the top, which is occupied by none other than Taylor Swift. According to Yard, Swift’s jet flew 170 times between Jan. 1 and July 19 (the window for the Yard study), totaling 22,923 minutes, or 15.9 days, in the air. That output has created estimated total flight emissions of 8,293.54 tonnes of carbon, which Yard says is 1,184.8 times more than the average person’s total annual emissions. (At least one more flight can be added to that list, too: The flight-tracking Twitter account Celebrity Jets notes that Swift’s plane flew today, July 29.)\n\n“Taylor’s jet is loaned out regularly to other individuals,” a spokesperson for Swift tells Rolling Stone. “To attribute most or all of these trips to her is blatantly incorrect.”\n\nTo create this report, Yard scraped data from Celebrity Jets, which in turn pulls its info from ADS-B Exchange (“the world’s largest public source of unfiltered flight data,” according to its website). Yard based its carbon emissions estimates on a U.K. Department for Transportation estimate that a plane traveling at about 850 km/hour gives off 134 kg of CO2 per hour; that 134 kg estimate was multiplied with both time-spent-in-air and a factor of 2.7 to account for “radiative forcing,” which includes other harmful emissions such as nitrous oxide (2.7 was taken from Mark Lynas’ book Carbon Counter). That number was then divided by 1000 to convert to tonnes. \n\nComing in behind Swift’s plane on Yard’s list was an aircraft belonging to boxer Floyd Mayweather, which emitted an estimated 7076.8 tonnes of CO2 from 177 flights so far this year (one of those flights lasted just 10 minutes). Coming in at number three on the list was Jay-Z, though his placement does come with a caveat: The data pulled for Jay is tied to the Puma Jet, a Gulfstream GV that Jay — the creative director for Puma — reportedly convinced the sneaker giant to purchase as a perk for the athletes it endorses.\n\nWhile Jay-Z is not the only person flying on the Puma Jet, a rep for Yard said, “We attributed the jet to Jay-Z on this occasion because he requested the Puma jet as part of his sign-up deal to become the creative director of Puma basketball. The Puma jet’s tail numbers are N444SC at Jay-Z’s request. N, the standard US private jet registration code, 444, referring to his album of the same name and SC for his birth name, Shawn Carter. Without Jay-Z, this jet would cease to exist.”\n\nThe rest of the celebrities in Yard’s top 10 do appear to own the jets that provided the flight data for the report. To that end, though, it’s impossible to say if the specific owners are the ones traveling on these planes for every specific flight. For instance, Swift actually has two planes that CelebJets tracks, and obviously, she can’t be using both at once.\n\nSo, beyond the Jay-Z/the Puma Jet, next on Yard’s list is former baseball star Alex Rodriguez’s plane, which racked up 106 flights and emitted 5,342.7 tonnes of CO2. And rounding out the top five is a jet belonging to country star Blake Shelton, which has so far taken 111 flights and emitted 4495 tonnes of CO2. The rest of the Top 10 includes jets belonging to director Steven Spielberg (61 flights, 4,465 tonnes), Kim Kardashian (57 flights, 4268.5 tonnes), Mark Wahlberg (101 flights, 3772.85 tones), Oprah Winfrey (68 flights, 3493.17 tonnes), and Travis Scott (54 flights, 3033.3 tonnes). \n\nReps for the other nine celebrities in the top 10 of Yard’s list did not immediately return Rolling Stone’s request for comment. \n\nAs for the two celebs who helped inspire Yard’s study: Kylie Jenner’s jet landed all the way down at number 19 (64 flights, 1682.7 tonnes), sandwiched between Jim Carey and Tom Cruise. And Drake’s plane popped up at number 16 (37 flights, 1844.09 tonnes), in between golfer Jack Nicklaus and Kenny Chesney. While Jenner has yet to address her 17-minute flight, Drake did respond to some criticism on Instagram by noting that nobody was even on the seven-minute, 12-minute, and 14-minute flights his Boeing 767 took during a six-week span. The explanation, in all honesty, doesn’t do him any favors.\n\n“This is just them moving planes to whatever airport they are being stored at for anyone who was interested in the logistics… nobody takes that flight,” Drake said. (A rep for Drake did not immediately return Rolling Stone’s request for further comment.)",
        "comments": [
            {
                "user": "william-o",
                "comment": "Makes \"ride your bike to work day\" feel like a bit of a joke doesn't it.",
                "score": 14872,
                "date": 1659196114.0
            },
            {
                "user": "pm_me_bra_pix",
                "comment": "Unless you live right beside the airport and the other destination is also right beside an airport, how would a 10-15 minute flight be more reasonable than just driving straight to the location? Seems like just using something because \"you can\" at that point.",
                "score": 3460,
                "date": 1659199803.0
            },
            {
                "user": "momoak90",
                "comment": "People are right that individual actions aren't enough to fix things but there's got to be some middle ground between being held personally responsible for all pollution and deciding you can do whatever the fuck you want without consequences.",
                "score": 1612,
                "date": 1659200943.0
            },
            {
                "user": "Derpstick76",
                "comment": "Remember to eat your bugs peasants!",
                "score": 1189,
                "date": 1659203617.0
            },
            {
                "user": "mtcwby",
                "comment": "With aircraft you often can't get all maintenance at its home field and have to fly it there even if it is only 10 minutes. Maintenance especially on more complex aircraft isn't very portable. Back in the days when I had a light plane there were things like avionics where I'd have to fly 15 minutes to another field because it simply wasn't available at mine.",
                "score": 41,
                "date": 1659207701.0
            },
            {
                "user": "ryanino",
                "comment": "But I stopped using plastic straws",
                "score": 485,
                "date": 1659201938.0
            },
            {
                "user": "WisecrackJack",
                "comment": "Now do politicians.",
                "score": 644,
                "date": 1659198077.0
            },
            {
                "user": "pulp_before_sunrise",
                "comment": "Am I wrong or did the article not dispute their defense that she rents out her jet to other people, i.e. it’s not only her who uses it?",
                "score": 1453,
                "date": 1659198840.0
            },
            {
                "user": "Gedunk",
                "comment": ">That output has created estimated total flight emissions of 8,293.54 tonnes of carbon, which Yard says is 1,184.8 times more than the average person’s total annual emissions.\n\nHoly cow. We've all heard how bad private jets are for the environment but this really puts it in perspective. It would take 1185 people to pollute more than Taylor Swift does. Wild.",
                "score": 331,
                "date": 1659200153.0
            },
            {
                "user": "sjp1980",
                "comment": "Jim Carrey has a private jet. Who knew.",
                "score": 542,
                "date": 1659199188.0
            },
            {
                "user": "KB_Shaw03",
                "comment": "Controversial opinion but I feel like Taylor Swift is treated like this Captain America moral compass when in reality she is just a celebrity with fuck you money that probably doesn't actually care about anything unless it makes her look good for her Swifties.",
                "score": 77,
                "date": 1659254376.0
            },
            {
                "user": "GentlmanSkeleton",
                "comment": "Dont worry the planet will \"shake it off\".",
                "score": 61,
                "date": 1659218342.0
            },
            {
                "user": "Bobbitto",
                "comment": "But don't worry guys, paper straws will solve our problems.",
                "score": 144,
                "date": 1659207595.0
            },
            {
                "user": "striderwhite",
                "comment": "Oh come on, celebrities are special, the make us feel less unhappy, they deserve every priviledge in this world! /s",
                "score": 295,
                "date": 1659197080.0
            },
            {
                "user": "Ray_Pingeau",
                "comment": "170 in six months? Does McDonald’s have a fly thru?",
                "score": 59,
                "date": 1659199812.0
            },
            {
                "user": "TomBrady_WinsAgain",
                "comment": "Just more Kardashian PR people at work.\n\nKylie was getting ripped a few days ago so they pushed this article to take the heat off of her.  \n\nFuck OJ for bringing that black hole of a family to the public.",
                "score": 479,
                "date": 1659206658.0
            },
            {
                "user": "rowenstraker",
                "comment": "Regardless of if she was the one in the plane or not, your private jet flew almost every single day in the study timeframe, and it alone put out well over 1000x the average American's emissions",
                "score": 25,
                "date": 1659211360.0
            },
            {
                "user": "lo0ilo0ilo0i",
                "comment": "So her jet is used like an Uber for the rich and famous. Seems like it's a fairly common practice?",
                "score": 226,
                "date": 1659198451.0
            },
            {
                "user": "wicktus",
                "comment": "On individual level you have people taking jets for 12 minutes flight\n\nOn state level you have corporations polluting like batshit crazy\n\nOn international level, no comment\n\nDon’t let that derail your convictions, if you want to drive less, use less planes etc do it, but I will take 0 lessons from any of them especially those stars or those politicians going to Davos or forums in private jets. Such hypocrisy to ask us to use bikes and turn off the AC in scorching heat",
                "score": 74,
                "date": 1659200061.0
            },
            {
                "user": "Beardy_Boy_",
                "comment": "I know that this sort of thing evokes an emotional response in people, but the reality is that the entire aviation industry accounts for just a little over 2% of total carbon emissions.   Celebrity private jet use is a huge red herring, because even eliminating all planes from the sky would have very little impact overall.\n\nThe only thing that will ever make a real difference is the wholesale switch away from fossil fuels as an energy source.",
                "score": 52,
                "date": 1659203100.0
            },
            {
                "user": "goboxey",
                "comment": "I'm sure she's gonna \"shake it off\"",
                "score": 87,
                "date": 1659197214.0
            },
            {
                "user": "niveksng",
                "comment": "Idk why people are taking this the wrong way. This is not saying that all celebs should stop flying private (though for real, most totally could stop), rather, they can stand to do much less of it. This is not saying that these celebs are bad people, rather that they also need to practice what they preach (or at least some of them, the ones that recognize climate change and have spoken about it being bad, if they're climate change deniers this is probably fine in their eyes)\n\nWould this *solve* climate change? No, but it will help. Just like how governments and celebs ask us to \"do our part\", we need to keep those same people in check with the same statement, \"do your part\". Telling us to sacrifice our wellbeing to allow the rich and famous to live posh is not right, and neither is sacrificing their wellbeing, but a good number of these flights are possibly unnecessary and for luxury, not health, and so as they say, every little bit counts. Their impact is far far greater than most other people, so why not remove whole individual's carbon emissions for a year by taking a First Class flight once in a while rather than a private jet? A First Class flight in a plane with others is much more environmentally economical, and you still live to the posh image people have.",
                "score": 52,
                "date": 1659199490.0
            },
            {
                "user": "Individual-Jaguar885",
                "comment": "But she says all the right things and supports all the right people 🤡",
                "score": 139,
                "date": 1659204101.0
            },
            {
                "user": "BakedBurnout",
                "comment": "Instead of being angry at vapid celebrities, why don’t we actually hold the fossil fuel execs accountable and destroy their lives as they have destroyed all of ours?",
                "score": 22,
                "date": 1659211737.0
            },
            {
                "user": "The--Endgame",
                "comment": " Climate Change (Taylor’s Version)",
                "score": 28,
                "date": 1659208040.0
            },
            {
                "user": "williafx",
                "comment": "EAT THE RICH.  OTHERWISE THEY EAT US.",
                "score": 25,
                "date": 1659237124.0
            },
            {
                "user": "hairysnowmonkey",
                "comment": "She is going to break up with that report and write two songs about how the report is mean but she's so over it.",
                "score": 19,
                "date": 1659211323.0
            },
            {
                "user": "MotherofFred",
                "comment": "Rolling Stone should look into which celebrities use Tom Barrack's jet. Before he was arrested and awaiting trial.",
                "score": 14,
                "date": 1659199680.0
            },
            {
                "user": "RevelationStations",
                "comment": "I knew I was right to hate her.",
                "score": 4,
                "date": 1659282995.0
            },
            {
                "user": "CrieDeCoeur",
                "comment": "I don’t give a shit if Taylor loaned her jet out 99% of the time. The point is that in a single year, a single vehicle owned by one person generated a carbon footprint greater than a normal person would in their lifetime. And that’s just one celebrity / wealthy person out of millions of them. To say nothing of myriad corporations that are known polluters. But yeah, me using a fucking straw is the real problem here.",
                "score": 12,
                "date": 1659220438.0
            },
            {
                "user": "Dr_Rosen",
                "comment": "Nothing will change for the good until there is a carbon tax.",
                "score": 27,
                "date": 1659201230.0
            },
            {
                "user": "CaptainBeer_",
                "comment": "This just feels like a way to distract the general public from the big corps who are make up most of the pollution",
                "score": 14,
                "date": 1659212522.0
            },
            {
                "user": "kgunnar",
                "comment": "It seems like at least Taylor Swift has a “normal” private jet, while Drake has his own private commercial airliner.",
                "score": 59,
                "date": 1659196832.0
            },
            {
                "user": "RipredTheGnawer",
                "comment": "Even celebrities like this are having small impacts compared to corporate pollution. They aren’t stopping, and they truly are the ones responsible.",
                "score": 3,
                "date": 1659228337.0
            },
            {
                "user": "vincentwallbanger",
                "comment": "what % of total carbon emissions per year is caused by private jets?",
                "score": 3,
                "date": 1659244963.0
            },
            {
                "user": "Rockcopter",
                "comment": "Dude, I'm telling you, we gotta just eat all these motherfuckers.  All of them.  There aren't even that many, we could do it at one big barbecue.",
                "score": 3,
                "date": 1659246649.0
            },
            {
                "user": "skrapmot",
                "comment": "They seem to think that if they don’t actually fly on their own jet, it’s not their problem, when in reality they are enabling others that may have flown commercial to more wasteful.\nIt would be like me loaning out my polluting gas leaf blower to my neighbors so they don’t need to rake their leaves.",
                "score": 3,
                "date": 1659278005.0
            },
            {
                "user": "SadSquatch420",
                "comment": "Kardashian damage control",
                "score": 3,
                "date": 1659279226.0
            },
            {
                "user": "LuisWaz",
                "comment": "These people are responsible for such a large percentage of the climate problem. It’s stupid to idolize and give these people such praise, love, and money when they’re causing such massive damage to the environment...",
                "score": 3,
                "date": 1659383157.0
            },
            {
                "user": "MasterpieceOk883",
                "comment": "Commercial flight takes up about 3% of the global CO2 emmission, private flight is far less a factor. Gaslighting celebrities isn't the answer. All this article will do is insight harassessment.",
                "score": 9,
                "date": 1659217724.0
            },
            {
                "user": "Redsneeks3000",
                "comment": "Let’s see if a billionaires daughter will be reprimanded./s",
                "score": 42,
                "date": 1659203127.0
            },
            {
                "user": "OneOverX",
                "comment": "ITT: y’all being trained to tell people advocating for more effective policy to go fuck themselves when the real issue is like <100 corporations, a few billionaires, and their politicians",
                "score": 12,
                "date": 1659211923.0
            },
            {
                "user": "dipfearya",
                "comment": "The environment is the problem of us peasants only.",
                "score": 6,
                "date": 1659201510.0
            },
            {
                "user": "EsseElLoco",
                "comment": "Eat. The. Rich.",
                "score": 16,
                "date": 1659218103.0
            },
            {
                "user": "Stanzig",
                "comment": "I thought r/music was about music not tmz.",
                "score": 7,
                "date": 1659202394.0
            },
            {
                "user": "PatchThePiracy",
                "comment": "Once millionaires and billionaires begin taking climate change seriously, I will consider doing so as well. \n\nBut, for now, I’m considered the “bad guy” for eating more than one cheeseburger per week.",
                "score": 12,
                "date": 1659200299.0
            },
            {
                "user": "thatguyad",
                "comment": "Fucking gross.  These people don't give a shit despite what PR teams spin for them.",
                "score": 21,
                "date": 1659199745.0
            },
            {
                "user": "bassicallyinsane",
                "comment": "Only 40 days this year she didn't use it, that's fucking ridiculous",
                "score": 12,
                "date": 1659204012.0
            },
            {
                "user": "bobcat73",
                "comment": "I literally don’t care. Private jet flight is not destroying the environment. This article is basically some stalker nerds justification to track celebrities. If “ENVIRONMENT” was really the concern they would be freaking out about the micro plastics or the ocean garbage patch. Instead these people get to harass famous people on the internets with “hard” questions and be “appalled” by whatever the response by the person or their hack.\n\nno rolling stone reporter ever climbed on a private plane to write a fluff piece about Stillwater? We all know they did.",
                "score": 55,
                "date": 1659201124.0
            },
            {
                "user": "Smokron85",
                "comment": "Finally seeing these celebrities for the pieces of scum sucking filth that they are.",
                "score": 77,
                "date": 1659197517.0
            }
        ]
    },
    {
        "flair": "ama - verified",
        "title": "I'm singer, songwriter and entertainer. I’m Ozzy Osbourne, also known as the Prince of Darkness. My first new solo album in 10 years, Ordinary Man, is out now! Ask Me Anything.",
        "author": "ThisIsOzzyOsbourne",
        "date": 1582652145.0,
        "score": 72366,
        "description": "Hi Reddit. I'm Ozzy Osbourne, also known as the Prince of Darkness. I've won a few Grammys and been inducted in the Rock and Roll Hall of Fame. My new album, Ordinary Man, is finally here and I'm excited to talk to you all about it. Feel free to ask questions about anything and everything.\n\n \n\nListen to the album here: https://ozzy.lnk.to/OrdinaryMan\n\nProof: https://i.redd.it/xvctgxqlxwi41.jpg",
        "comments": [
            {
                "user": "FizzingSlit",
                "comment": "What's something you wish people knew about you?",
                "score": 850,
                "date": 1582653606.0
            },
            {
                "user": "mundi_inbox",
                "comment": "hi ozzy, i wanna say that i love your music! and i wanted to ask what it’s been like to play in front of millions of people trough your majestic career, what’s your favorite show that you can remember and why?",
                "score": 1936,
                "date": 1582653428.0
            },
            {
                "user": "TheBaneOfDanes",
                "comment": "Hey Ozzy! Big fan. Is there someone that you've always wanted to collaborate with on a song? Why?",
                "score": 469,
                "date": 1582656267.0
            },
            {
                "user": "madman3063",
                "comment": "If someone wanted to get into your music but hasn't before, what somg would you recommend they start with? What album?",
                "score": 443,
                "date": 1582655252.0
            },
            {
                "user": "notnotmihai",
                "comment": "Hey Ozzy! What would your 16 year old self think of the life youve lived and the achievements youve had along the way?",
                "score": 2403,
                "date": 1582653388.0
            },
            {
                "user": "Simeossi",
                "comment": "Are you still in contact with the other Black Sabbath members?",
                "score": 726,
                "date": 1582655739.0
            },
            {
                "user": "nick6_gimarelli",
                "comment": "Have any advice to young musicians who are trying to make it in the industry?",
                "score": 1318,
                "date": 1582653396.0
            },
            {
                "user": "Matte_Webber",
                "comment": "Hi Ozzy! \n\nCan you tell me something about your collaboration with Elton John? \n\nI really like both of you, you are legends for me!",
                "score": 3065,
                "date": 1582653402.0
            },
            {
                "user": "whitt_wan",
                "comment": "I assume there haa been many crazy stories made up or exaggerated about you, being the Prince of darkness and all.\n How do you react when you hear wild rumours about yourself? Bat head bitings, prolonged acid taking etc?",
                "score": 333,
                "date": 1582656532.0
            },
            {
                "user": "nogoodusername69",
                "comment": "How many times a day would you say that you scream out \"SHARON!!!\"?",
                "score": 678,
                "date": 1582656273.0
            },
            {
                "user": "Sproll29",
                "comment": "Hey Ozzy,\n\nWhen did you learn how to sing and do you have any tips for song writing? Thank you 😊",
                "score": 322,
                "date": 1582657688.0
            },
            {
                "user": "Stoneylittlemushroom",
                "comment": "Ozzy! Hello, I love you. Do you have any favorite books?",
                "score": 930,
                "date": 1582653416.0
            },
            {
                "user": "prontoon",
                "comment": "Since you have drank with Andre the Giant, are the stories of his ability to put them down true?",
                "score": 1437,
                "date": 1582657247.0
            },
            {
                "user": "Plus_Grand",
                "comment": "Ozzy you've mentioned that this was your first album to be recorded 100% sober. Did you find it easier or harder in your creative process recording sober?",
                "score": 2331,
                "date": 1582653497.0
            },
            {
                "user": "Sanjay_Natra",
                "comment": "How can you be 71 and still have such gorgeous, thick black hair?",
                "score": 296,
                "date": 1582656058.0
            },
            {
                "user": "ThisIsOzzyOsbourne",
                "comment": "Thank you all for your questions!! It's been a pleasure chatting, I love you all.",
                "score": 9228,
                "date": 1582658567.0
            },
            {
                "user": "TheLovelyMule",
                "comment": "Hi Ozzy <3\nI’ve been a big fan since I was a kid but it was always difficult to listen to your music growing up because my mum thought you were in league with Satan and banned it from the house.\nShe’s at my place right now visiting and it would absolutely make my day if you would leave a few words that I could pass along to her >:)",
                "score": 7967,
                "date": 1582655593.0
            },
            {
                "user": "SoulHoover",
                "comment": "Hi Ozzy. Even if you have someone do your business / tour / work / life schedule for you, how do you manage to fit everything in? What is your advice for coping with endless demands on your time?",
                "score": 1006,
                "date": 1582656139.0
            },
            {
                "user": "Blindguardian951",
                "comment": "Why the hell havent you been knighted yet!",
                "score": 248,
                "date": 1582656538.0
            },
            {
                "user": "johnlucasmck",
                "comment": "Mr. Osbourne.\nIn the 10 year gap between Scream and Ordinary Man.\nWhat new influences or inspiration did you find on this 10 year gap?",
                "score": 500,
                "date": 1582653474.0
            },
            {
                "user": "Mamamanager",
                "comment": "Hey Ozzy - do you have any good memories or stories from working with WWF/WWE  at wrestlemania or Raw?",
                "score": 933,
                "date": 1582653735.0
            },
            {
                "user": "irvingstark",
                "comment": "What do you think your life would be like if you never got into rock and roll?",
                "score": 494,
                "date": 1582653978.0
            },
            {
                "user": "kloudrunner",
                "comment": "If you could go back in time and change just one thing what would it be ?  Also hope you feel better pal. Keep rocking.",
                "score": 243,
                "date": 1582657701.0
            },
            {
                "user": "dwaynebank",
                "comment": "Hey Oz, huge fan here.\n\nCongrats on your sobriety. I haven't drank in a year now- what differences have you seen in your life since making that lifestyle change?",
                "score": 905,
                "date": 1582656684.0
            },
            {
                "user": "gabrielmarquesdm",
                "comment": "Hey Ozzy\n\nWhat's your go-to Starbucks order?\n\nLove you, take care!",
                "score": 232,
                "date": 1582656307.0
            },
            {
                "user": "ObedientProle",
                "comment": "Ozzy you are a hero and an inspiration to millions.  I am dying to know what your favorite brand of socks to wear is. I can’t seem to find a pair of socks that I feel comfortable in.\n\nI was wondering what socks are worn by the Prince of Darkness?",
                "score": 1802,
                "date": 1582655455.0
            },
            {
                "user": "ryannaise6669",
                "comment": "Hi Ozzy. If you were to make a movie about your life, who would you pick to play your part?",
                "score": 463,
                "date": 1582653582.0
            },
            {
                "user": "Theleftunite",
                "comment": "What album of your career are you the most proud of, and why? Also, love Ordinary Man!! Listened to the whole album about 8 times already! Much love from Scotland!!",
                "score": 633,
                "date": 1582653437.0
            },
            {
                "user": "beachbum2374",
                "comment": "Hi Ozzy,\n\nI've been a fan of yours forever and I loved Randy. Can you tell us something about Randy that we may not know?",
                "score": 421,
                "date": 1582655419.0
            },
            {
                "user": "kethlen-",
                "comment": "When you think about Lemmy, what's the first memory that comes to your mind?\n\nLove you so much!",
                "score": 1091,
                "date": 1582656307.0
            },
            {
                "user": "BOSSAURESREX",
                "comment": "What's your favorite Beatles song?",
                "score": 206,
                "date": 1582653417.0
            },
            {
                "user": "SkyVerb",
                "comment": "Hey Ozzy, I wanna ask, could you tell us about the hardest moment on your career?",
                "score": 388,
                "date": 1582653457.0
            },
            {
                "user": "bvttlet",
                "comment": "What was the first mosh pit you saw?? I was watching the 1974 California Jam performance y’all had and you kept yelling “COME ON” like you wanted them to start one.",
                "score": 553,
                "date": 1582653160.0
            },
            {
                "user": "MistxLobsters",
                "comment": "If you could relive any moment of your life, what would it be?",
                "score": 386,
                "date": 1582655787.0
            },
            {
                "user": "xx91xx",
                "comment": "I love your new album, do you see a possibility of another in the future?",
                "score": 183,
                "date": 1582653592.0
            },
            {
                "user": "BillBraskyIsMyDad",
                "comment": "Hey Ozzy! What's been the most rewarding part of your music career over the years?",
                "score": 379,
                "date": 1582654013.0
            },
            {
                "user": "The1andlonelywoof",
                "comment": "Hi Ozzy!\n\nWhat's something that makes you laugh?",
                "score": 176,
                "date": 1582655539.0
            },
            {
                "user": "nayaransd",
                "comment": "What comes first for you, the lyrics or melody? I started writing but I always have the lyrics but never the melody and I want to improve on that",
                "score": 490,
                "date": 1582655737.0
            },
            {
                "user": "jacobxlilly",
                "comment": "Hey ozzy! Hope I get a chance to eventually see you in North Carolina soon. Love everything you do. My question to you is what is your favorite gas station snack. From chips to candy or anything in between. \n\nThanks for the inspiration.",
                "score": 602,
                "date": 1582653794.0
            },
            {
                "user": "RRC90Shaw",
                "comment": "Hi Ozzy, as it’s pancake day, what is your favourite things to put on your pancake?",
                "score": 160,
                "date": 1582655217.0
            },
            {
                "user": "KronicDeath",
                "comment": "Hey Ozzy you're the man, I remember seeing you with Rob Zombie at the Joint in Vegas awhile back.  What's your favorite horror movie?",
                "score": 305,
                "date": 1582653930.0
            },
            {
                "user": "fencingemoji",
                "comment": "What is your favorite band besides what you are involved in?",
                "score": 154,
                "date": 1582653485.0
            },
            {
                "user": "Kbit07",
                "comment": "What do you think about Kieth Richards snorting his dad",
                "score": 443,
                "date": 1582653080.0
            },
            {
                "user": "nionelle",
                "comment": "Hey Ozzy, huge fan. Is there anything you miss about the Midlands or the U.K. in general?",
                "score": 152,
                "date": 1582655784.0
            },
            {
                "user": "Otherwise-Cable",
                "comment": "If you could talk to your 18 year old self what would you tell him",
                "score": 560,
                "date": 1582653588.0
            },
            {
                "user": "Sanjay_Natra",
                "comment": "What is one thing you tell to someone that can motivate them to stop doing drugs?",
                "score": 559,
                "date": 1582655722.0
            },
            {
                "user": "Tristater4",
                "comment": "Hi Ozzy! What was your favorite part of working with Andrew Watt on the new record?",
                "score": 139,
                "date": 1582655948.0
            },
            {
                "user": "0liviahung",
                "comment": "My favourite teacher introduced me to your music. Would love it if you say hi to Mr.J!",
                "score": 140,
                "date": 1582657581.0
            },
            {
                "user": "loweam13",
                "comment": "How was it playing Bark at the Moon during an actual eclipse? It looked wild!",
                "score": 403,
                "date": 1582657832.0
            },
            {
                "user": "valexand95",
                "comment": "Hi Mr. Osbourne, love your new album! What is the song “Eat Me” about?",
                "score": 1173,
                "date": 1582653407.0
            },
            {
                "user": "Mustacheman42",
                "comment": "Hey Ozzy, what’s the coolest place you’ve been to in your years of traveling?!",
                "score": 125,
                "date": 1582655716.0
            },
            {
                "user": "BroadcasterX",
                "comment": "Hi Ozzy. Do you have any favorite acting memories from your film cameos?",
                "score": 256,
                "date": 1582653594.0
            },
            {
                "user": "CannibalHillbilly",
                "comment": "Ozzy you are one of my favorite artist and I just wanted to ask what is your favorite song that you have done?",
                "score": 124,
                "date": 1582653449.0
            },
            {
                "user": "jenlaru",
                "comment": "What was your favorite memory with Randy Rhoads? \nLove you Ozzy!!!!!! 🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼",
                "score": 351,
                "date": 1582653748.0
            },
            {
                "user": "nayaransd",
                "comment": "I just wanted to thank you for helping me on my life and saving myself from suicide...I know this is hard to read but you saved my life and you are an inspiration for me!!! Thanks for your art, thanks for your music and thanks for being yourself!!! Keep rocking always 🖤🤘🏻🦇",
                "score": 1369,
                "date": 1582653624.0
            },
            {
                "user": "killerofgiants",
                "comment": "Hi Ozzy! I wanted to say thank you for everything! Your music means so much to me and has gotten me through a lot.\n\nHow did the harmonica part in \"The Wizard\" come to be?",
                "score": 243,
                "date": 1582657577.0
            },
            {
                "user": "iNNeRKaoS",
                "comment": "Hey. Did you burn the trike that tried to kill you?",
                "score": 120,
                "date": 1582657879.0
            },
            {
                "user": "millerswiller",
                "comment": "Of all the dogs you’ve had, which one was your favorite?    \n\n\n\n(Long-time fan!)",
                "score": 120,
                "date": 1582657906.0
            },
            {
                "user": "homeslice2311",
                "comment": "Hey Ozzy, is that train still pretty crazy?",
                "score": 120,
                "date": 1582657065.0
            },
            {
                "user": "NanPakoka",
                "comment": "Hey Ozzy, thanks for all of the great sounds and incredible performances.\n\nHow do you stay creative at this point in your career? Is it a chase to say something new or perfect what you've already created?\n\nThanks for everything. The world still needs you and Bob Dylan.",
                "score": 519,
                "date": 1582655582.0
            },
            {
                "user": "GC64",
                "comment": "What are you up to right now?",
                "score": 514,
                "date": 1582652375.0
            },
            {
                "user": "spicerldn",
                "comment": "Hi Ozzy! My mum has been a huge fan since the 70s, I grew up on Black Sabbath and Ozzy Osborne! Can you say hi to Sandy, please? 😘",
                "score": 422,
                "date": 1582655774.0
            },
            {
                "user": "sovenomouspoison",
                "comment": "what have you been listening lately?",
                "score": 107,
                "date": 1582653503.0
            },
            {
                "user": "darinnchi-",
                "comment": "How are you still with Sharon what's the secret",
                "score": 583,
                "date": 1582654060.0
            },
            {
                "user": "cheesemachine2",
                "comment": "what inspires you to go to the studio?",
                "score": 224,
                "date": 1582653454.0
            },
            {
                "user": "Bedoyairv",
                "comment": "What other careers did you consider before getting into music?",
                "score": 390,
                "date": 1582653957.0
            },
            {
                "user": "kaidman123",
                "comment": "What was it like getting back in the studio after 10 years?",
                "score": 98,
                "date": 1582655328.0
            },
            {
                "user": "jilliu5",
                "comment": "Hey Ozzy, what is your favorite pizza.",
                "score": 95,
                "date": 1582653861.0
            },
            {
                "user": "Zee_Ventures",
                "comment": "Hi Ozzy! I noticed the espresso machine in the background. \n\nHow do you like your coffee/espresso?",
                "score": 95,
                "date": 1582657912.0
            },
            {
                "user": "Carol_Tavano",
                "comment": "You’re considered a huge icon in the music industry and you have a massive fanbase around the world, I’m sure you met so many fans and have some really interesting stories to tell, can you give us some examples of the craziest experiences with fans you’ve ever had? Hope I get to meet you someday it’d be a dream come true Xx",
                "score": 3289,
                "date": 1582653755.0
            },
            {
                "user": "mommapanda22",
                "comment": "How does it feel to be an influence for so many? Your music bonds people, helps people, and just generally makes people happy. I'm 22 and grown around your music and have a little 15 month old of my own and she already loves you",
                "score": 181,
                "date": 1582655267.0
            },
            {
                "user": "MrPeech",
                "comment": "What's some music you listen to, that might surprise people?",
                "score": 257,
                "date": 1582653676.0
            },
            {
                "user": "Decagram",
                "comment": "Do you have any pre-show rituals?",
                "score": 93,
                "date": 1582657025.0
            },
            {
                "user": "Narsquid4",
                "comment": "What is the inspiration for Scary Little Green Men and the Jason Mamoa music video?",
                "score": 461,
                "date": 1582653930.0
            },
            {
                "user": "FairiesWearBoots_",
                "comment": "if you could have any superpower what would it be?",
                "score": 91,
                "date": 1582657619.0
            },
            {
                "user": "Life-Judge",
                "comment": "Hi Ozzy, do you like burrito still ??",
                "score": 176,
                "date": 1582653788.0
            },
            {
                "user": "mbzuber",
                "comment": "Love ya Ozzy! What has been the happiest moment of your life? Your biggest accomplishment?",
                "score": 174,
                "date": 1582656267.0
            },
            {
                "user": "Carol_Tavano",
                "comment": "Hi Ozzy, my name is Carolina I’m 18 years old and I’m a huge fan, your music helped me through so much and I just wanted to thank you for everything \n\nMy question is: I noticed a lot of songs in Ordinary Man are very personal and it kind of looks like you were saying farewell to your fans, that’s what a lot of people thought but then yesterday you said that you plan on releasing more albums in the future, so did we interpret the message wrong? What were you really trying to say with this album? Love you Xx",
                "score": 5655,
                "date": 1582653556.0
            },
            {
                "user": "LastReclaimer",
                "comment": "What was the worst job you had before making music ?",
                "score": 84,
                "date": 1582657079.0
            },
            {
                "user": "rumours423",
                "comment": "What's your favorite Pink Floyd album?",
                "score": 161,
                "date": 1582656256.0
            },
            {
                "user": "Pasta-Man199",
                "comment": "Is it true that you want to make another album next month?",
                "score": 77,
                "date": 1582654020.0
            },
            {
                "user": "Stefko007",
                "comment": "Hi Ozzy!! As a prince of darkness do you believe in paranormal stuff?",
                "score": 79,
                "date": 1582656396.0
            },
            {
                "user": "squirtleismyhomie",
                "comment": "Hey Ozzy! How does it feel to be inducted into the rock n roll hall of fame? Love your work!",
                "score": 220,
                "date": 1582653568.0
            },
            {
                "user": "Phillies1993",
                "comment": "Ozzy could you please say Hi Zach?",
                "score": 77,
                "date": 1582655998.0
            },
            {
                "user": "LastReclaimer",
                "comment": "What does your perfect breakfast look like?",
                "score": 75,
                "date": 1582657620.0
            },
            {
                "user": "PixieMcDragon",
                "comment": "Saw you at Download Festival 2018 and you looked so happy to be there. What was it really like for you?",
                "score": 69,
                "date": 1582657431.0
            },
            {
                "user": "stizzieborden",
                "comment": "Hey Ozzy! I work(ed) for legendary Boston rock station WAAF here in Boston.. Unfortunately, after 50 years of rock, our station was just sold last week to a Christian station.. We had thousands of suggestions for what WAAF’s last song should be.. In the end, the very last song WAAF played before the flip switched Friday night at midnight, was Black Sabbath by Black Sabbath.. WAAF has always supported you, and even I personally have been playing songs off the new album in anticipation of its release.. Just wanted to see if you could speak on what a station like WAAF meant to you and your career, and what you think the future of rock radio is.. Thank you!! \n\n“What is this that stands before me”",
                "score": 76,
                "date": 1582654153.0
            },
            {
                "user": "Whovianguy",
                "comment": "Fondest memory throughout all your years of rockin’?",
                "score": 72,
                "date": 1582657576.0
            },
            {
                "user": "Phillies1993",
                "comment": "What is your favorite type of ice cream?",
                "score": 74,
                "date": 1582655721.0
            },
            {
                "user": "tapedegg",
                "comment": "Hey Ozzy, thanks for the music. The first Bassline I learned to play was from Crazy Train. I love the Black Sabbath stuff. What was the first concert with Black Sabbath like?",
                "score": 196,
                "date": 1582657245.0
            },
            {
                "user": "MNRGAMER",
                "comment": "Hi Ozzy! What’s your favourite Metallica song?",
                "score": 65,
                "date": 1582656619.0
            },
            {
                "user": "toeaway-",
                "comment": "What’s your favorite fruit or vegetable?",
                "score": 63,
                "date": 1582656300.0
            },
            {
                "user": "YourKidDeservedToDie",
                "comment": "Ozzy! Hope you're getting well. \n\nHow wild was seeing Mac Sabbath?!",
                "score": 62,
                "date": 1582656920.0
            },
            {
                "user": "RadiationDM",
                "comment": "Hey Ozzy! How do you like your steak cooked?",
                "score": 61,
                "date": 1582655709.0
            },
            {
                "user": "theenglishyeti",
                "comment": "Favourite led Zeppelin song?",
                "score": 60,
                "date": 1582656629.0
            },
            {
                "user": "Dragic27",
                "comment": "Hey John, I was just curious what magazine you read while using the restroom?",
                "score": 264,
                "date": 1582652675.0
            },
            {
                "user": "onewilybobkat",
                "comment": "Which bands had the largest influence on you growing up?",
                "score": 60,
                "date": 1582655526.0
            },
            {
                "user": "johngarnesdigital",
                "comment": "If you could pinpoint one single moment in time as the pinnacle of your career, what would that be and why?",
                "score": 53,
                "date": 1582656744.0
            },
            {
                "user": "killerofgiants",
                "comment": "From Alice Cooper to Wu-Tang Clan and now to Post Malone and Elton John, your collaborations have always been fresh and exciting. Who would you love to collaborate with in the future?",
                "score": 53,
                "date": 1582652190.0
            },
            {
                "user": "EdsteveTheGreater",
                "comment": "What question do you always wish someone would ask you? And to follow up: what's the answer to that question?",
                "score": 108,
                "date": 1582656122.0
            },
            {
                "user": "dragonsbreath666",
                "comment": "What’s your favorite Sabbath album these days?",
                "score": 105,
                "date": 1582656940.0
            },
            {
                "user": "thepain73",
                "comment": "Ozzy, my aunt Kim loves your music.\n\nWould you tell her hello for me?\n\nUPDATE: She saw it and is so happy. Thanks again!\n\nhttps://i.imgur.com/dKFJaMQ.jpg",
                "score": 316,
                "date": 1582655787.0
            },
            {
                "user": "SKirby00",
                "comment": "Hey Ozzy, what's your favorite way to spend your free time, that's not music related?",
                "score": 52,
                "date": 1582656927.0
            },
            {
                "user": "DasaLP2001",
                "comment": "Hey Ozzy, what made you decide to record a new solo album?",
                "score": 49,
                "date": 1582656680.0
            },
            {
                "user": "VaporwaveVoyager",
                "comment": "Ozzy what’s your favorite space movie?",
                "score": 51,
                "date": 1582657852.0
            },
            {
                "user": "grahambo66",
                "comment": "How does your voice stay the same?",
                "score": 99,
                "date": 1582653394.0
            },
            {
                "user": "sileo009",
                "comment": "What's your favorite car?",
                "score": 47,
                "date": 1582656297.0
            },
            {
                "user": "NecessaryRegister3",
                "comment": "Could you please say hi Andrey? He is my father and has been a fan of you for very long!",
                "score": 48,
                "date": 1582656684.0
            },
            {
                "user": "GuineaPig69",
                "comment": "What's your ideal weekend?",
                "score": 44,
                "date": 1582657461.0
            },
            {
                "user": "T_H_0_M_A_S",
                "comment": "Which singer has the biggest influence on you?",
                "score": 128,
                "date": 1582656251.0
            },
            {
                "user": "Ghostlyglitter31",
                "comment": "Hi Ozzy it's my sisters birthday today. Could you say a few words for her?",
                "score": 40,
                "date": 1582656623.0
            },
            {
                "user": "LastReclaimer",
                "comment": "Coffee or tea ?",
                "score": 44,
                "date": 1582656919.0
            },
            {
                "user": "mrscoggins",
                "comment": "Hi Ozzy! Which tattoo of yours is your favorite?",
                "score": 83,
                "date": 1582653955.0
            },
            {
                "user": "sub_to_naffa",
                "comment": "If you really are Ozzy do you like vegemite",
                "score": 36,
                "date": 1582656958.0
            },
            {
                "user": "Funkybag",
                "comment": "If you could only eat at one restaurant for the rest of your life which one would it be?",
                "score": 42,
                "date": 1582657677.0
            },
            {
                "user": "BlindOdin",
                "comment": "Hi, Ozzy! Wish you all the best!\n\nWhat is your favourite country to visit and why?",
                "score": 108,
                "date": 1582656232.0
            },
            {
                "user": "kethlen-",
                "comment": "What's your favorite Guns N' Roses song?",
                "score": 32,
                "date": 1582657253.0
            },
            {
                "user": "Carol_Tavano",
                "comment": "Do you have any other hobbies besides singing? You’ve been staying home a lot because of your injury, what do you like to do to pass the time?",
                "score": 31,
                "date": 1582656927.0
            },
            {
                "user": "BigMeanPopcornQueen",
                "comment": "Hello! What's your go-to department of any store/shop?",
                "score": 31,
                "date": 1582657683.0
            },
            {
                "user": "LlamaPack",
                "comment": "Strawberry or Pistachio ice cream?",
                "score": 29,
                "date": 1582655562.0
            },
            {
                "user": "kfloyd68",
                "comment": "Hello ozzy my husband was diagnosed with end stage Parkinson’s  and was looking forward to seeing you in Pittsburgh . We are so glad that you are able to take care of the Parkinson’s you have . We have been loyal fans for quite some time now . Listen to the doctor , stay strong and know you have the thoughts and prayers of millions around you . Hope to meet you some day . Love the new album ! Rock on sir 🤟🏼",
                "score": 59,
                "date": 1582653477.0
            },
            {
                "user": "memiorsofaweeaboo",
                "comment": "What should I do for my 21st this weekend?",
                "score": 30,
                "date": 1582657835.0
            },
            {
                "user": "LoroGamer85",
                "comment": "There any new musician or album released in recent years that you really liked?",
                "score": 53,
                "date": 1582657681.0
            },
            {
                "user": "sleepbenertia",
                "comment": "What has been your favourite tour?",
                "score": 26,
                "date": 1582657750.0
            },
            {
                "user": "AmphoraOfaMphibians",
                "comment": "What's your favorite comfort food?",
                "score": 86,
                "date": 1582653724.0
            },
            {
                "user": "Walican132",
                "comment": "Hi Ozzy huge fan, What’s your favorite tour memory?",
                "score": 24,
                "date": 1582657071.0
            },
            {
                "user": "themoosehasarrived",
                "comment": "What would you say is the best concert you’ve ever seen?\n\nAlso, what was the last song you listened to?",
                "score": 22,
                "date": 1582657687.0
            },
            {
                "user": "Dang_M8",
                "comment": "Hey Ozzy, what's one of your favourite cities to visit on tour?",
                "score": 20,
                "date": 1582657229.0
            },
            {
                "user": "mustardjumper",
                "comment": "When was the last time you were scared?",
                "score": 35,
                "date": 1582656549.0
            },
            {
                "user": "VINYL_RU",
                "comment": "Can you sign vinyl ?",
                "score": 44,
                "date": 1582653489.0
            }
        ]
    },
    {
        "flair": "ama - verified",
        "title": "[AMA] I'm really Rick Astley. I swear. And to celebrate my first album since 1993, I'm here to let you Ask Me Anything!",
        "author": "ReallyRickAstley",
        "date": 1475859342.0,
        "score": 69868,
        "description": "Hi Reddit!\n\nYou may have seen - my first album since 1993 is out today! You can get 50 on [iTunes, Amazon or Spotify](http://smarturl.it/RickAstleyS01), or even get the vinyl and signed photograph version on my [website](https://rickastley.tmstor.es/). \n\nBut other than the album, I'm really excited to be hopping on Reddit today to talk with you guys! This is going to be a lot of fun, and I can't wait to get started.\n\nI'll be here at 3pm ET to answer your questions, and u/courtiebabe420 will be joining me in person to help. She'll also help get proof up when we get started later today. \n\nFollow me on [Twitter](https://twitter.com/rickastley), [Facebook](http://www.facebook.com/rickastley), or [Instagram](https://instagram.com/officialrickastley/) and check out my music on [Youtube](https://www.youtube.com/c/RickastleyCoUkOfficial) or [Spotify](https://open.spotify.com/artist/0gxyHStUsqpMadRV0Di1Qt).\n\nOkay - keep the questions coming. See you guys at 3pm (eastern) today!\n\nEdit: [Proof](https://twitter.com/rickastley/status/784460789113430016)\n\nLet's get started!\n\n**Edit 2: That was a lot of fun. I'd love to do it again sometime - all the best.  - Rick**",
        "comments": [
            {
                "user": "callmesketchy",
                "comment": "Do you still rock the same dance moves?",
                "score": 2578,
                "date": 1475866672.0
            },
            {
                "user": "ForIAmBitter",
                "comment": "What's the thing you miss the most from the 80s? ",
                "score": 2389,
                "date": 1475866862.0
            },
            {
                "user": "HowyadoinOK",
                "comment": "Rick you're stuck on a island. You can have 1 book, 1 movie and 1 album. What are your 3?",
                "score": 1661,
                "date": 1475865844.0
            },
            {
                "user": "JoshuaTheBastard",
                "comment": "Hi Rick. You don't age. Are you a vampire?",
                "score": 5178,
                "date": 1475863136.0
            },
            {
                "user": "Jamimann",
                "comment": "Would you like to write a progressive metal album with me?",
                "score": 5869,
                "date": 1475862346.0
            },
            {
                "user": "ThereIMadeAnAccount",
                "comment": "Hi Mr. Astley!\nDo you keep in touch with the background dancers from your videos? Because the bartender from your 'Never Going To Give You Up' video looks like he would be great for birthday parties & stuff. Would love to see you guys do a reunion!",
                "score": 1798,
                "date": 1475862694.0
            },
            {
                "user": "Swish15",
                "comment": "Which music do you listen to and nobody would expect it?",
                "score": 1668,
                "date": 1475865511.0
            },
            {
                "user": "checkonechecktwo",
                "comment": "Who has been the nicest person you've worked with in music? Anyone that surprised you by being really awesome?",
                "score": 2887,
                "date": 1475860002.0
            },
            {
                "user": "dissenter_the_dragon",
                "comment": "Hi Rick, which U.G.K album--in your opinion--has the hardest cuts?",
                "score": 1136,
                "date": 1475862094.0
            },
            {
                "user": "brenroberson",
                "comment": "Have you been approached about taking on the mantle of James Bond after Daniel Craig retires?",
                "score": 1577,
                "date": 1475861736.0
            },
            {
                "user": "starlightsong",
                "comment": "How did you get to be such an awesome guy??",
                "score": 1071,
                "date": 1475866718.0
            },
            {
                "user": "thecruelestanimal",
                "comment": "Are you ever mistaken for Martin Freeman?",
                "score": 796,
                "date": 1475864208.0
            },
            {
                "user": "RunDNA",
                "comment": "Have you thought of opening a Subway-style chain of restaurants called RickRoll?",
                "score": 2986,
                "date": 1475862842.0
            },
            {
                "user": "mega_potato",
                "comment": "Why take such a long break from music? ",
                "score": 1021,
                "date": 1475862913.0
            },
            {
                "user": "comic_sans_sans",
                "comment": "What's your favorite type of sandwich?",
                "score": 1815,
                "date": 1475861646.0
            },
            {
                "user": "y0milky",
                "comment": "Who inspired you to become a musician? Was it a former teacher or family/friends?",
                "score": 972,
                "date": 1475861561.0
            },
            {
                "user": "vexillology101",
                "comment": "Hey Rick. Favourite movies of 2016 so far?",
                "score": 596,
                "date": 1475862855.0
            },
            {
                "user": "1052941",
                "comment": "How's it going man?",
                "score": 1291,
                "date": 1475862706.0
            },
            {
                "user": "BrockHardcastle",
                "comment": "Hi Rick! I have a few questions:\n\n1. Have you ever felt limited being a baritone in a tenors world? What is your song selection process like? I'm a baritone and find it frustrating. However, we are in good company with the likes of yourself, David Byrne, and Paul Buchanan to name a few of my favourites. \n\n2. How was working with SAW? \n\n3. How do you write songs? What's your method? ",
                "score": 2539,
                "date": 1475862458.0
            },
            {
                "user": "MicroCuts7",
                "comment": "This is bound to go swimmingly.  :D\n\nIn your experience, what has been the biggest perceivable change about a) your music and b) the industry since you left it behind 20+ years ago?\n",
                "score": 1827,
                "date": 1475861938.0
            },
            {
                "user": "GorrodeRock",
                "comment": "Is the information about you making only 12 dollars off of the Rickrolling phenomenon true, or if it is true, has it even been updated? This question has puzzled me for a while now.\n\n[Here's an article that was recently posted about it](https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
                "score": 9277,
                "date": 1475859663.0
            },
            {
                "user": "thebad_comedian",
                "comment": "Will you ever give me up?",
                "score": 35174,
                "date": 1475866755.0
            },
            {
                "user": "catapolana",
                "comment": "Hey Rick, how are ya. What are your top 5 all time favorite movies?",
                "score": 496,
                "date": 1475865296.0
            },
            {
                "user": "SpaceCat902",
                "comment": "Hi Rick,\n\nHope you are well sir. Just wanted to give you a shoutout and say I've been a fan since '87 when I got Whenever You Need Somebody on Cassette for my 6th birthday. I listened exclusively to that record, Michael Jackson's Bad , and the Beach Boys' Do It Again for years and remember playing air-keyboard to your album on my mother's ironing board. \n\nWhen my wife and I got married last September, the first dance was Never Gonna Give You Up. Everybody told us it was the best wedding ever.\n\nAnyway, I know this isn't what an AMA is for, but just wanted to say I've always thought you're awesome and it would be an honour to buy you a pint if you ever find yourself in Nova Scotia for some bizarre reason. ",
                "score": 354,
                "date": 1475862815.0
            },
            {
                "user": "blabyrinth",
                "comment": "Hey, Rick! I loooooove 50 and have been listening to it on repeat since it came out. My question is about your latest videos.\n\nI think a lot of people who know your older work would be really surprised by how strange your newer music videos have been (in a good way!). So I'm wondering...\n\n1) What's the story behind the whole dancing, horned devil-y/satyr-y, fantastical underworld theme of the [\"Dance\" music video](https://www.youtube.com/watch?v=5o7WEv5Q5ZE)? \n\n2) Same question, but the you-being-kidnapped theme in [\"Angels on My Side.\"](https://www.youtube.com/watch?v=cc91EfoBh8A)\n\n3) WHAT SONG IS GETTING A VIDEO NEXT???",
                "score": 3004,
                "date": 1475861930.0
            },
            {
                "user": "sodiumvapour",
                "comment": "I'm scared to touch any link man. ",
                "score": 957,
                "date": 1475862273.0
            },
            {
                "user": "SuperHSL_Hope",
                "comment": "Hey Mr. Astley! \n\nA lot of people don't believe me when I say that \"Never Gonna Give You Up\" is one of my favorite songs(mostly cause I'm 19 and I was born after your song was released. The reason I got exposed to your song in the first place was cause of the Family Guy cover done by Brian(Seth MacFarlane). \n\nMy question is: How did you feel about Family Guy bringing back your song? Did the creators from Family Guy approach you about it? Or did they just do it without asking like they normally do a lot stuff Also, what did you think of Brian's rendition of your song?",
                "score": 1034,
                "date": 1475868010.0
            },
            {
                "user": "georgej14",
                "comment": "Hey Rick, what is your favorite breakfast food ",
                "score": 194,
                "date": 1475859700.0
            },
            {
                "user": "hazeleyedwolff",
                "comment": "Hi Rick, what are your favorite two songs, either songs of yours, or others? What genre of music to you listen to the most?",
                "score": 198,
                "date": 1475861255.0
            },
            {
                "user": "Breezy9401",
                "comment": "Hey Rick!  \nMy wife and I got married a couple years ago and our first dance was to [this](https://www.youtube.com/watch?v=YSDOcLfwM-I) acoustic cover of Never Gonna Give You Up sung by Hannah Trigwell.  It's really a perfect song for a wedding and the look on our guest's faces was priceless when they realized what was happening.  Sorry we didn't use the original, but the acoustic cover seemed a *little* more appropriate.  \n  \nDo you have a favorite cover of Never Gonna Give You Up or of any of your other songs?",
                "score": 167,
                "date": 1475866420.0
            },
            {
                "user": "Smokeya",
                "comment": "Hi Rick. Not gonna ask any questions about Rick rolling as im sure this post will be loaded with them.\n\nHows life been treating you?\n\nWhats your favorite ice cream?\n\nIve only assumed you retired, doe this new album mean youll be continuing to make music?\n\nYour extremely well known on the internet, how does that feel?",
                "score": 783,
                "date": 1475859906.0
            },
            {
                "user": "InCauda",
                "comment": "Hey Rick,\n\nWhat inspired you to finally record new music? I feel as though most artists would have capitalized on the sudden resurgence of a hit several years ago and just throw something together as a cash grab. Waiting this long makes me think that this is something that means a lot to you.",
                "score": 24,
                "date": 1475862185.0
            },
            {
                "user": "runjimrun",
                "comment": "Hi Rick! Not a question, just wanted to let you know that I've karaoked Never Gonna Give You Up several times at bars, and even though I can only carry a tune in a bucket (at best) it never fails to pack the dance floor. Thanks for bringing joy to the world!",
                "score": 82,
                "date": 1475862280.0
            },
            {
                "user": "Gungnir5",
                "comment": "Your concert at Town Hall last night was really energetic, and you are a wonderful performer, and artist!  I dare say you rival Barry Manilow at his best!\n\n1) do you think you'll release your covers of \"Uptown Funk\", and \"Highway to Hell\"?  Your Uptown Funk was definitely smoother than a fresh jar of skippy!\n\n2) How do you feel about Manilow's cover of [\"Never gonna give you up\"?] (https://www.youtube.com/watch?v=rx6w3j7cWa0) \n\nThank you for your music! It makes me happy in a way few things do in this world :)",
                "score": 21,
                "date": 1475867213.0
            },
            {
                "user": "quartermasterly",
                "comment": "Hi Rick!! :)\n\nAre there any of your songs other than the blaringly obvious one that you are particularly proud of or would really like people to listen to more? ",
                "score": 37,
                "date": 1475860375.0
            },
            {
                "user": "socalkid71",
                "comment": "Mr. Astley,\n\nThere had to have been a day where you were just minding your own business, sipping your morning coffee, when out of nowhere, a massive internet movement began revolving around you and your work.\n\nWhat was your immediate reaction on the day when you first discovered that you'd become an Internet sensation?",
                "score": 59,
                "date": 1475862744.0
            }
        ]
    },
    {
        "flair": "Discussion",
        "title": "Pearl Jam tickets for the two London shows went on sale at 11:00am GMT today. At 11:00 GMT today tickets were sold out. Already tickets pooping up for resale at 3x the price. What the fuck is this bullshit, fans being gouged whilst pigs try to profit",
        "author": "CheloniaMydas",
        "date": 1512737790.0,
        "score": 66809,
        "description": "My girlfriend sat there this morning for a whole hour not waiting leave her laptop in order to purchase just two tickets but as soon as they were \"live\" they were no longer even available. Pearl Jam is her favourite band and to lose out to people only in to profit is not a good feeling. Genuine fans are being fleeced for money above the price the band themselves deemed fair for the tickets\n\nYes this was mainly just a rant but this behavior is disgusting.\n\nOn top of the 3x price hike these do not include fees.... what the fuck are the fees for? Do they pay the bots they set up to grab the tickets? \n\nedit: yes I know I spelled popping up wrong\n\nedit 2: I have seen some tickets for now 6x/7x the price of the original although these were only a few so far\n\nedit 3: sorry for the slightly colourful language in the title I was and still am angry at the situation",
        "comments": [
            {
                "user": "polarphantom",
                "comment": "Oh yes, had the exact same experience trying to get tickets for Flight of the Conchords in London. Went on sale at 10:00am, I had been all ready to go for 10 minutes, at 10:00:00001 they were ALL 'sold out' and ALREADY up on a resale site for 3x-4x the price being advertised on the same page. \n\nInteresting fact, after some digging I found that both the site I was on and the resale site are both owned by ticketmaster. \n\nI'm sure it's just a coincidence though.....",
                "score": 2560,
                "date": 1512745586.0
            },
            {
                "user": "roadtrip-ne",
                "comment": "I signed up for a presale ticket release (different band) joined the fan club, tweeted it, and other things to get the best spot in line I could. \n\nI was number 103 inline for a venue that holds 10,000. Each buyer was limited to 4 tickets max. I called at my allotted time on the dot and tickets were sold out. How does that work? At maximum they should have only been able to presale 412 tickets at max, but nope presale sold out. \n\nAnd I was in Group 1 of like 12 groups. I kept trying for 3 hours and sold out each time I called in. \n\n*Edit: Logged in, 408 Max when not counting myself. \n\nLesson learned: The Fan Club, Tweeting and Posting on Facebook to better your chances is just free publicity for the band you are trading in for no reward. Why a band would want to do this to their most loyal fans- not sure. ",
                "score": 10489,
                "date": 1512741242.0
            },
            {
                "user": "ConradtheMagnificent",
                "comment": "I actually liked the system they had when I was in Japan. I had to actually include my name on several of the tickets I bought, and it was printed on those tickets at the time of purchase. ",
                "score": 929,
                "date": 1512742548.0
            },
            {
                "user": "paulerxx",
                "comment": "inb4 Pearl Jam sues again",
                "score": 2847,
                "date": 1512739328.0
            },
            {
                "user": "Einsteins_coffee_mug",
                "comment": "I haven’t gone to a concert in years now because I’m sick of this. \n\n$30 General admission tickets become $110 after price hikes and added “fees.” \n",
                "score": 9108,
                "date": 1512739352.0
            },
            {
                "user": "newuser040",
                "comment": "I recently went to a concert where they countered scalpers by stating everybody can (at most) buy 2 tickets, and when entering the venue the name of the buyer (which is printed on the ticket) will be checked with your ID card. Sure this is inconvenient and makes it a lot harder to get tickets with a larger group of people (and also slows down entry in the venue significantly), but it makes it practically impossible for scalpers to resell the tickets. ",
                "score": 91,
                "date": 1512744970.0
            },
            {
                "user": "MadDogFargo",
                "comment": "I know how much fun it is to go see your favorite big name band at a huge arena or whatever, I went to many of those shows in the days of my youth.  Then I started getting turned off by the rising prices and the crazy monopolistic exploitative behavior of Ticketmaster etc, and discovered my city's local music scene.  For five or ten bucks I can get into a bar, see a couple of bands, drink a few reasonably-priced beers, have a great time and go home.  I can do this every weekend if I want because hey, it doesn't cost me hundreds of frickin dollars every time.  I can meet the guys in the band if I want and talk to them about their music because they're not jaded superstars with security entourages who have tens of thousands of people wanting to talk to them after every show.  And yeah, I know, these guys aren't Pearl Jam or anything, but honestly the world is full of musicians and songwriters who are almost as talented as the marquee names but will never make it anywhere because they just didn't get lucky.  And besides, these guys need your $5 way more than Pearl Jam needs your $100.  I know it sucks OP, but the only way to win is not to play the game.  Support your local music scene!",
                "score": 2271,
                "date": 1512745112.0
            },
            {
                "user": "Applewapples",
                "comment": "I work in the industry.. bots are a huge problem.  The fees from Ticketmaster are usually negotiated with the promoter, venue, and others in play. With a high profile show like this it isn't unusual for there to be a high amount of bot activity and third party resale. Which sucks, because there's also a huge chance of fraud.",
                "score": 387,
                "date": 1512743438.0
            },
            {
                "user": "reaper0345",
                "comment": "It should be standard practice to do what Glastonbury festival does. You have to pre-register with photo id. Then your photo is printed on the ticket. If your face is not on the ticket, then you don't get in. It would destroy the secondary ticket market. ",
                "score": 53,
                "date": 1512747456.0
            },
            {
                "user": "RedefineMeshIron",
                "comment": "I heard a podcast about this yesterday. Among other things, Ticketmaster plays the part of the Bad Cop in regards to ticket sales. The artist doesn't want to appear to be gouging their fans, so face value is set lower and the difference is made up with all those fees. Is definitely worth a listen.\n\nhttp://freakonomics.com/podcast/live-event-ticket-market-screwed/",
                "score": 473,
                "date": 1512742813.0
            },
            {
                "user": "StonyShinobi",
                "comment": "I'd be pooping for resale, if I could be, as well.",
                "score": 991,
                "date": 1512740427.0
            },
            {
                "user": "rawr_rawr_6574",
                "comment": "Happened to me for a fall out boy concert in Boston. I bought them within the first 2 days of the sale of tickets. Could only find resales. Closer to the concert some tickets did become available through ticket master again, which raises more questions but whatever. I think the ticket companies have to be in on it. It happens to fast and frequent.",
                "score": 378,
                "date": 1512741794.0
            },
            {
                "user": "Ongazord",
                "comment": "This happens every time, but the ticket price crashes way down about a week to a few days before concert\n\nMost recently happened to me for Tool, Radiohead.\n\nBasically they do this so they can try and make bank off of fans who wouldn’t miss this for the world and freak out when the tickets are sold out. Don’t believe the hype and scalp tix closer to the show",
                "score": 793,
                "date": 1512741672.0
            },
            {
                "user": "Summamabitch",
                "comment": "Have t seen a show in years because of this bullshit. It’s sad more than anything. ",
                "score": 126,
                "date": 1512741862.0
            },
            {
                "user": "TellYouWhatitShwas",
                "comment": "There is an interesting Freakonomics podcast about it that just came out this week. They explore the causes for the broken ticket market.\n\nBasically, artists want to set prices artificially low to make their fans happy, Venues and managers want to charge fees to cover costs, Ticketmaster takes the blame, and scalpers exploit the secondary market because ticket prices are underpriced based on market force and demand. However, artists are not blameless. Everyone benefits from the secondary market, to the point that managers are responsible for listing many tickets on secondary markets themselves. It is a broken system that no one has any incentive to fix, because they are all making money off of it. ",
                "score": 97,
                "date": 1512744514.0
            },
            {
                "user": "huntol52",
                "comment": "Hate on him as an artist all you want, but Kid Rock did it right. His last tour he put up all the money upfront and handled every aspect of the show. From concessions, to beer, to ticket sales. Every ticket cost $25. Gotta respect the dude for making it affordable for all his fans.",
                "score": 35,
                "date": 1512753732.0
            },
            {
                "user": "therealbuttersnips",
                "comment": "How is this legal?\n\nIt is illegal in Denmark ",
                "score": 323,
                "date": 1512740723.0
            },
            {
                "user": "itsgottabetheroses",
                "comment": "Everyone here should know about the website [Cashortrade.org](https://cashortrade.org/)\n\nNo scalpers, face value only, fan to fan",
                "score": 114,
                "date": 1512743519.0
            },
            {
                "user": "the_undad_20",
                "comment": "People need to stop buying resale. Otherwise it will continue. ",
                "score": 166,
                "date": 1512741230.0
            },
            {
                "user": "DynamiczX124",
                "comment": "This is exactly the reason why I wait for festivals now. There’s a much better chance of getting the tickets straight from the venue, as well as seeing more acts for a relatively lower amount. E.g i’m travelling to Amsterdam next year for Pinkpop festival primarily because of Pearl Jam and Foo Fighters. However i’m going to get to also see Bruno Mars and loads of other acts at the same time, for the price of what a usual Pearl Jam ticket costs. \n\nSingle gigs just aren’t worth it to me anymore. ",
                "score": 61,
                "date": 1512745611.0
            },
            {
                "user": "kgolovko",
                "comment": "Grateful Dead in the late 80’s and onward (probably earlier too) would require you send a letter via USPS asking for tickets with a check.  \n\nThere wasn’t ever anything saying corporate entities couldn’t buy large blocks of tickets, but I’ve got to think that corporate checks would be questioned.\n\nAdditionally the tickets were awesome - always different, sometimes with sparkles on them.  Not just something printed on a generic ticket with their local dot matrix printer like when you waited in line for tickets to other shows (I did say 80’s...)",
                "score": 68,
                "date": 1512742104.0
            },
            {
                "user": "athanathios",
                "comment": "The funny part is Pearl Jam have been all over these practices since the 90s",
                "score": 46,
                "date": 1512741435.0
            },
            {
                "user": "enquiringapollo",
                "comment": "I've resorted to trying to get presale tickets for every show that I can.",
                "score": 9,
                "date": 1512742772.0
            },
            {
                "user": "kyleadam",
                "comment": "I just laugh at this point. There is such a simple solution to this but until artists stand up to the bullshit in the industry I’ll be boycotting theater size shows and bigger. Go to local shows. Bars, basement venues, etc. See great, unpolished music from young artists. More heart for a fraction of the price. Sometimes you even find someone who ends up being your favorite artist for a while. ",
                "score": 9,
                "date": 1512747824.0
            },
            {
                "user": "DrunkenGolfer",
                "comment": "What I don’t understand is why the pricing is not set to match demand at the start.  By under-pricing tickets they create an arbitrage opportunity that is exploited by scalpers and the like.  If the market will pay $500 for your ticket, charge $500.  If that is not acceptable, sell your ticket as a pass tied to an ID.",
                "score": 89,
                "date": 1512740374.0
            },
            {
                "user": "Steinhaut",
                "comment": "The last time Prince (R.I.P.) went on tour, you could order the tickets online, however you would only get a confirmation email that you had purchased the right to enter the show. \n\nAt the venue, you had to provide the credit card which you used to buy the ticket and it would then print out the ticket.\n\nFrom what I understand you had zero scalpers at that event, however I might be wrong. \n\nWonder why other bands do not use this method/technology",
                "score": 14,
                "date": 1512746241.0
            },
            {
                "user": "Schnawsberry",
                "comment": "We need to go back to the days of standing in line at the local store to wait for tickets to sell. Limit the amount per purchaser, and if you want to buy overpriced tickets to a sold out show go find a scalper outside the venue.",
                "score": 8,
                "date": 1512749185.0
            },
            {
                "user": "Destroyer_Wes",
                "comment": "Ticket pooping huh? ",
                "score": 12,
                "date": 1512743177.0
            },
            {
                "user": "sash187",
                "comment": "I thought Pearl Jam was the one that was so against this shit...weren't they going to sell their own tickets and go to other venues or something? ",
                "score": 11,
                "date": 1512744454.0
            },
            {
                "user": "IwishIwasSethRollins",
                "comment": "pooping",
                "score": 45,
                "date": 1512742051.0
            },
            {
                "user": "travisdust",
                "comment": "I have a friend that “Re-sells” event tickets for a living. When Pearl Jam came to my hometown, I had a few different browsers pulled up on my computer and my phone waiting for them to go on sell at 10:00 am. Refreshed windows until I got the best available and got two tickets in the lower bowl of the arena. Not too bad for $160. The show sold out in 5-10 minutes.\n\nI contacted him to see what he got. Somehow he got 12 tickets in the best section of the arena and marked the price up almost 400% to sell them on stubhub.\n\nThese dudes have some kind of access that the general public does not. Anytime I’ve asked him about it he’s gotten real standoffish and is definitely not willing to disclose how he’s able to do this consistently enough to make a living doing it. \n\n*Coincidently I’m wearing the shirt that I bought at that concert.",
                "score": 6,
                "date": 1512748790.0
            },
            {
                "user": "jibber4568",
                "comment": "Something is inheritably wrong for this to happen. I don't have a problem with tickets selling out but to be sold out within  mins and at the same time to appear all over resale sites tells me this whole system is screwed.\n\nI too was trying to get a ticket for the London show and had the same result.\n\nI was so angry with the siutation I have created a petition that if enough support is generated will have to be discussed in the house of commons. \n\nI've also purchased a domain and plan to build a site to try and increase visability of the problem.\n\nI'm awaiting approval for the petition and will post here once done. Site will take a little longer but but will be posting it everywhere once done. We need to stop these theives that are only in it for the money. \n\nMusic is for the fans and nothing else. Let's get it back!!",
                "score": 4,
                "date": 1512749425.0
            },
            {
                "user": "oZanderhoff",
                "comment": "GUTS is doing everything they can to stop this! They are a team in Amsterdam that have built technology which allows artists to sell tickets directly to fans or people can use their own application to buy tickets. They are getting many events working with them and thanks to the blockchain technology they have developed it really puts an end to ticket touting. GUTS is used a lot in the Netherlands, with over 100k tickets being sold each year so far (1 Million by 2019). The protocol that powers the system which they have built called the GET protocol allows artists to sell tickets to their fans directly. The cryptocurrency GET powers the smart tickets which aim to get rid of ticket touting as they have several pieces of technology in place to prevent the re-selling of tickets but because of their awesome system it is very easy and non complicated, in fact to the ticket buyer there is no hints of blockchain or crypto as it is all handled in the background, which makes it perfect for everyone! The website is here: https://guts.tickets/. They act as both a B2B and B2C ticketing solution which is awesome as event companies can either choose to use the protocol and sell directly or use the already built application that GUTS has, as an investor of GET both ways benefit you as GET is always bought off the market when each ticket is created which helps build demand for the currency. There is also a buy back event that occurs where a % of all GET bought using the Event Organiser contract which is burnt! Some videos of GUTS in progress: https://vimeo.com/gutstickets I've written an article on GUTS here: https://decentralize.today/guts-revolutionizing-the-ticketing-industry-e07218a9c74d",
                "score": 17,
                "date": 1512747989.0
            },
            {
                "user": "Afrocrow",
                "comment": "Many years ago I was desperate for Smashing Pumpkins tickets as it was going to be the band's last tour.\n\nTickets were due to be released at 9am **exclusively** through Ticketmaster.\n\nI called in at 8.55am and got a really friendly ticketmaster rep on the phone. I explained how desperate I was and he kept me on the phone, refreshing the page on his computer constantly until it ticked over to 9am. All the time we chatted the screen said wait. As soon as 9am hit, he refreshed the page.\n\n\"Sold Out\"\n\nHe broke the news and sounded really apologetic. I asked how this could happen. We should literally have been one of the first to get a ticket. He put me on hold for all of 10 seconds.\n\n\"My manager told me he has had all of the tickets put aside for promotions. That means he will give out the tickets to radio shows, tv companies but more likely his friends, probably.\"\n\n\"It's a ten thousand seater venue, how many friends does he have?\" I asked.\n\n\"Ebay friends.\" He replied, sounding like this wasn't his first rodeo.\n\nI checked ebay straight after the phone call. The tickets were already up. They were starting at $200. This was nearly 20 years ago so adjusted for inflation and the fact I was a poor student that is around $16 million I think /s\n\nTake away from this is that I did not go to see the Smashing Pumpkins because of pride to not pay the touts... and my wallet said^nooooooo^way^son",
                "score": 11,
                "date": 1512749938.0
            },
            {
                "user": "MikeDinSD",
                "comment": "Pooping lol",
                "score": 4,
                "date": 1512743644.0
            },
            {
                "user": "RedHawwk",
                "comment": "I'm surprised something like that isn't illegal",
                "score": 5,
                "date": 1512747671.0
            },
            {
                "user": "ClubZen",
                "comment": "pooping",
                "score": 5,
                "date": 1512750377.0
            },
            {
                "user": "ImJupi",
                "comment": "sad that the tickets are pooping :( ",
                "score": 3,
                "date": 1512750379.0
            },
            {
                "user": "slitrobo",
                "comment": "I hate getting poopy tickets.",
                "score": 5,
                "date": 1512751141.0
            },
            {
                "user": "Goodkat203",
                "comment": "Stop going to concerts. That is the only solution. If you keep paying these absurd rates, then they will keep charging them.",
                "score": 6,
                "date": 1512751790.0
            },
            {
                "user": "Sleth",
                "comment": "Back in the 80s, we called that scalping. It's illegal, unless you're a corporation. ",
                "score": 7,
                "date": 1512744365.0
            },
            {
                "user": "metrocat2033",
                "comment": "hah you said pooping",
                "score": 14,
                "date": 1512742993.0
            },
            {
                "user": "panopticon86",
                "comment": "Buying tickets is bullshit these days. Convenience fees and all this shit. There is nothing convenient about paying 3x the price for tickets. ",
                "score": 6,
                "date": 1512744461.0
            },
            {
                "user": "ItsJustGizmo",
                "comment": "PJ fan here. This shit boiled my fucking blood. I was lucky to see them in 2010 in belfast, I’ve grown up n got kids now, and I wanted to go see em again.... \n\nNOPE!",
                "score": 2,
                "date": 1512746986.0
            },
            {
                "user": "Lisu",
                "comment": "Doing this in Norway is illegal. If you resell tickets you must offer them for the same price or cheaper. It does happen, but much less prevalent.",
                "score": 5,
                "date": 1512748855.0
            },
            {
                "user": "underdabridge",
                "comment": "Sigh. \n\nThis happens because TICKETS ARE UNDERPRICED. There are really two ways to solve this.  \n\n1)  Bands should be able to charge the actual market clearing price for their show. Best thing would be to use an auction, really. The fans with the most money who value the concert enough get to go. \n\nBUT Rock music, with its socialist aesthetic won't allow that so instead a bunch of sleazy middle men get involved. \n\nHow about we just stop the sleazy middle men?  Well then, besides being impossible, most fans *still* don't get to see their favorite bands because there is a *shortage*.  It's basically just putting in place a lottery.  Some random subset gets to see the band. But hey, at least the rich people aren't getting to buy their way to this totally non-essential luxury purchase even though totally non-essential luxury purchases is exactly what being rich *should* get you. (And does, with all the American Express Pre-Sales and bullshit)\n\nSo, instead, consider 2.  \n\n2) Bands could play more shows in each city.  That's right.  Want Pearl Jam tickets. Well, Pearl Jam is playing for three weeks at $20 a ticket. Everyone can go! No shortage! Yay!\n\nOh wait, except now there is a shortage of venues for artists to play in, and pearl Jam actually needs to work more to potentially make the same or less money. That seems to be an unlikely thing for most sellers to agree with. \n\ntl;dr  You're fucked. \n\n\n\n",
                "score": 3,
                "date": 1512750563.0
            },
            {
                "user": "GreenFox1505",
                "comment": "Stop going to concerts. You'll break both the scalpers (for obvious reasons) and the music industry who will be incentivised to stop the gouging. This market exists because fans allow it to exist.",
                "score": 3,
                "date": 1512757576.0
            },
            {
                "user": "exotics",
                "comment": "Garth Brooks - country singer.. has a great way of dealing with this.  First his tickets are priced cheap.. but then if they sell out.. he adds another show.. and another.. and another.. and another.  He had 11 shows in Edmonton, Alberta.  Screw the scalpers!",
                "score": 5,
                "date": 1512760305.0
            },
            {
                "user": "MoralMiscreant",
                "comment": "All we fans have to do is abstain from buying resale tickets for one year. Just dont buy them. If the fuckers lose money they will stop buying up every available ticket.\n",
                "score": 4,
                "date": 1512763496.0
            },
            {
                "user": "Leprecano",
                "comment": "Chiming in from Colorado with a similar issue.. my best friend uses a power wheel chair, and every time we would try to get accessible seats at Red Rocks (front row or last row), the front row seats were gone in seconds.  We have been able to get front row a time or two, only to find people that didn't necessarily need that section seated with us.  We have been told by people that they ended up paying at least 4x the cost to be able to get those tickets.  After a couple of years of complaining we were able to get them to change their policy for the front row.  The 2018 concert season will see them requiring proof of need for accessible seats.  We can change the system!",
                "score": 3,
                "date": 1512772659.0
            }
        ]
    },
    {
        "flair": "article",
        "title": "Swedish newspaper says Avicii is dead.",
        "author": "CrazyChicken007",
        "date": 1524244797.0,
        "score": 66077,
        "description": "Here is the article: https://www.dn.se/kultur-noje/avicii-ar-dod/\n\nEDIT: Found another one from the biggest newspaper in Sweden: https://www.svt.se/kultur/uppgift-artisten-avicii-ar-dod\n\n~~I will post an english one as fast as I can.~~\n\nThis is the first english article I found: https://www.hollywoodreporter.com/news/avicii-dead-swedish-musician-was-28-1104501\n\nEDIT2: Here are some more english articles: \n\n[Time](http://time.com/5248599/avicii-dies/)\n\n[Bloomberg](https://www.bloomberg.com/news/articles/2018-04-20/urgent-producer-and-dj-known-as-avicii-has-been-found-dead)\n\n[Variety](http://variety.com/2018/music/news/avicii-dead-at-28-1202772767/)\n\n[CNN](https://edition.cnn.com/2018/04/20/entertainment/avicii-dj-dead/index.html)\t\n\n[BBC](http://www.bbc.co.uk/news/world-europe-43841194)",
        "comments": [
            {
                "user": "TooShiftyForYou",
                "comment": "His publicist just confirmed it:\n\n*\"It is with profound sorrow that we announce the loss of Tim Bergling, also known as Avicii,\" his publicist Diana Baron said in a statement. \"He was found dead in Muscat, Oman this Friday afternoon local time, April 20th. The family is devastated and we ask everyone to please respect their need for privacy in this difficult time. No further statements will be given.\"*\n\nJust 28 years old, RIP.\n\n[Source](https://www.billboard.com/articles/news/dance/8358389/avicii-dead-tim-bergling)",
                "score": 8143,
                "date": 1524245648.0
            },
            {
                "user": "Felix_Tholomyes",
                "comment": "All Swedish newspapers are reporting the same, looks real unfortunately.\n\nHe was found dead in Oman",
                "score": 15358,
                "date": 1524245205.0
            },
            {
                "user": "quantumcoke",
                "comment": "I live in a big university town in Sweden called Lund known for its crazy parties. Within 5 minutes of his passing you could hear Levels busting through the speakers in every party on the block. Avicii, the soundtrack of so many teenage drunken nights.",
                "score": 4155,
                "date": 1524248432.0
            },
            {
                "user": "cadetolliver",
                "comment": "Rest in peace man, 28 is too damn young for anyone to go.",
                "score": 1956,
                "date": 1524245301.0
            },
            {
                "user": "Erlendftw",
                "comment": "RIP Tim Bergling.. Will never forget how Levels affected the music industry when it came out.",
                "score": 4826,
                "date": 1524245633.0
            },
            {
                "user": "asdfbrotherr",
                "comment": "RIP, he helped make a couple of summers really memorable for alot of people.\n\nVila i frid. ",
                "score": 4950,
                "date": 1524245206.0
            },
            {
                "user": "ponneee",
                "comment": "Really sad, reliable newspaper as well :(",
                "score": 3287,
                "date": 1524244970.0
            },
            {
                "user": "StratifiedBuffalo",
                "comment": "What. The. Hell.",
                "score": 6106,
                "date": 1524244829.0
            },
            {
                "user": "hcass-",
                "comment": "What?! So sad :( Condolences to his loved ones.\n\nA memory that makes me smile:\n\nDuring my freshman year of college, my best guy friend had a shower playlist that was just Avicii's song 'Wake Me Up' 10 times in a row. He listened to it every single day and would loofah himself to the beat, for all of his dorm to hear. ",
                "score": 696,
                "date": 1524245986.0
            },
            {
                "user": "ThePeanutFish",
                "comment": "For anyone not speaking Swedish, he was found dead in Muscat, Oman this afternoon, local time. He was 28 years old. DN (Dagens Nyheter, perhaps the most reputable daily newspaper in Sweden) writes that the info comes from his PR-contact.\n\n",
                "score": 588,
                "date": 1524245517.0
            },
            {
                "user": "Nossi_Mormont",
                "comment": "Actually saw a documentary about him the other day. He has had problems with anxiety for a long time, not saying that is the reason though...\n\nSo sad to hear about this! Hope his family is doing ok.",
                "score": 1140,
                "date": 1524245287.0
            },
            {
                "user": "glassen75",
                "comment": "*I tried carrying the weight of the world, but I only have two hands. Hope I get the chance to travel the world, but I don’t have any plans. Wish I could stay forever this young, not afraid to close my eyes. Life’s a game made for everyone and love is a prize.* \n\nVila i frid, Tim. ",
                "score": 2144,
                "date": 1524245915.0
            },
            {
                "user": "KyloRad",
                "comment": "This is truly sad. I know a lot of people were turned off by how mainstream EDM went, but Tim was a truly talented producer and musician, on top of just being a button pressing DJ. I will never forget his first BBC Radio 1 Essential Mix, which pretty much turned me on to dance music.\n\nRest In Peace brother\n\n\nEdit:\n\nLink to essential mix- everyone needs to be jamming this today.\n\nhttps://m.soundcloud.com/hasino/avicii-essential-mix-11-12-2010",
                "score": 496,
                "date": 1524246275.0
            },
            {
                "user": "Vozrozhdenie",
                "comment": "Translation of the [DN](https://www.dn.se/kultur-noje/avicii-ar-dod/) article:\n\n>\"It is with great sorrow that we have to announce that Tim Bergling, known as the artist Avicii, is dead. He was in Muscat, Oman and was found dead during Friday afternoon local time,\" writes his press contact Ebba Lindqvist on Friday night.\n\n>\"The family is devastated and we ask you to be considerate and leave them alone in this difficult time. No more statements will be made \", said the press statement.\n\n>Avicii became famous throughout the world as a disc jockey, remixer and music producer. The magazine DJ Mag has for many years rated Avicii as one of the world's premier DJs.",
                "score": 517,
                "date": 1524245356.0
            },
            {
                "user": "doyousketchybro",
                "comment": "This is the first musician death that’s hit me pretty hard. I started listening to Avicii in undergrad and whenever I hear his music I reminisce about those good times. Driving to class, intramural sports, meet ups with friends and his songs would come on the radio. They’d get me pumped.... RIP Avicii ",
                "score": 344,
                "date": 1524248732.0
            },
            {
                "user": "Drhernes",
                "comment": "Fuck. Only 28 too. I'm in disbelief.",
                "score": 313,
                "date": 1524245529.0
            },
            {
                "user": "Poundhead",
                "comment": "Will never forget all the amazing summer nights I’ve spent listening to his music. What a terrible loss. Vila i frid",
                "score": 586,
                "date": 1524245013.0
            },
            {
                "user": "NotLaFontaine",
                "comment": "Ever since I was a kid, I've had the dream to travel the world.  I remember the first time I heard \"Wake Me Up.\"  It immediately found a special place in my heart.  I remember listening to that song as I looked at videos, blogs and daydreamed about travel.  It helped fuel my wanderlust and hold on to the seemingly naive dream that I would be able to do more than take a 2 week vacation abroad every year.\n\nI'm happy to say I've been traveling continuously since July of 2014.  I still listen to \"Wake Me Up\" when I'm on a train or bus and the song makes me smile and feel something.  \n\nThanks for a relatable song and for the motivation, Avicii.  RIP, brother.\n\n\n",
                "score": 364,
                "date": 1524247399.0
            },
            {
                "user": "ZappySnap",
                "comment": "So, I'm not generally into this genre of music, and I honestly had never even heard of him (forgive me...I'm middle aged). But listening to some of his music on Spotify and his stuff is fantastic.  \n\nSorry to hear of his passing.",
                "score": 48,
                "date": 1524256311.0
            },
            {
                "user": "JamesIgnatius27",
                "comment": "> One day my father—he told me,\n\n> \"Son, don't let it slip away\"\n\n>He took me in his arms, I heard him say,\n\n> \"When you get older\n\n> Your wild heart will live for younger days\n\n>Think of me if ever you're afraid.\"\n\n> He said, \"One day you'll leave this world behind\n\n> So live a life you will remember.\"\n\n> My father told me when I was just a child\n\n> These are the nights that never die\n\n> My father told me\n\nAbsolutely tragic. Rest in peace.",
                "score": 122,
                "date": 1524246242.0
            },
            {
                "user": "3982NGC",
                "comment": "Sweet jesus. How?",
                "score": 366,
                "date": 1524245127.0
            },
            {
                "user": "adk32",
                "comment": "“Hey Brother” is one of those songs that helped me out of a dark place in life and inspired me to live selflessly for my own friends who I call my brothers and sisters in life. \n\nRIP Avicii, a young life gone far too soon.",
                "score": 205,
                "date": 1524247492.0
            },
            {
                "user": "marmalade_monkey",
                "comment": "For anyone just learning of him now here are some of my favorites from high school for me: \n\nLevels: https://youtu.be/_ovdm2yX4MA\n\nWake me up: https://youtu.be/IcrbM1l_BoI\n\nThe Nights: https://youtu.be/UtF6Jej8yb4\n\nHey Brother: https://youtu.be/YxIiPLVR6NA\n\nAlso his entire stories album is amazing, I listened to if for weeks on repeat my freshman year of college.\n https://www.youtube.com/playlist?list=PLVHf2SUQa5j23exhAHNC13cscnrFLyp_s\n\nBroken Arrows, Trouble, and Sunset Jesus are some of my favorites\n\nRIP Avicii, thanks for all the music and memories",
                "score": 73,
                "date": 1524251017.0
            },
            {
                "user": "rush2sk8",
                "comment": "https://www.billboard.com/articles/news/dance/8358389/avicii-dead-tim-berglund\n\nBillboard article",
                "score": 94,
                "date": 1524245304.0
            },
            {
                "user": "MrGoatFace",
                "comment": "I'm so distraught.\n\nEven though this is unconventional, Avicii got me through one of the toughest times in my life. When I was 20, I was contemplating ending my life. During this time, I was also working as a gogo dancer, and for Halloween that year, I got booked to perform at his show! Even though this wasn't a permanent fix for my depression, it did give me a chance to \"put off my death until I could dance for Avicii\".\n\nLeading up to the show, I kept the promise to myself, and I think it saved my life. Because after the show, somehow, I found the strength to get help. \n\nThanks for letting me part with you, Avicii! You had an incredible impact on my life. ♥️ \n\nEdit: idk if that was inappropriate to post, but I just wanted to share how he made a positive impact on my life. Not a lot of big artists allow performers on stage, but he was elated to have us as dancers!",
                "score": 120,
                "date": 1524260673.0
            },
            {
                "user": "FanKingDraftDuel",
                "comment": "\"So wake me up when it's all over\" has now become quite poetic.  ",
                "score": 182,
                "date": 1524246481.0
            },
            {
                "user": "dsco",
                "comment": "So sad. Just saw a documentary about him taking a break from it all after being pushed to his limits by the music industry.",
                "score": 301,
                "date": 1524245068.0
            },
            {
                "user": "BiiGSeaN86",
                "comment": "Always been a big fan of his Music. I’m absolutely shocked at just finding this out and it’s been reported to be true on a lot of reliable news sites. Sad day indeed.",
                "score": 27,
                "date": 1524246171.0
            },
            {
                "user": "rumcake_",
                "comment": "He lived more in his 28 years than most of us will in a lifetime. \n\nRip",
                "score": 53,
                "date": 1524249010.0
            },
            {
                "user": "G4L1L30_G4L1L31",
                "comment": "One of the most influential artists that EDM has ever known. He will be remembered in history. Far too young sadly.",
                "score": 27,
                "date": 1524248521.0
            },
            {
                "user": "Exception1228",
                "comment": "Not to piggyback, but my friend Larry died today too.  Never i my life have I met someone so full of joy and promise.  Larry was a fighter.  He survived a whole year of cancer and chemo and never once compalined about his situation.   He was the most optimistic, inspiring person I know, and he will be missed dearly.  He had just gotten engaged recently and had a very promising career and life ahead of him.",
                "score": 1579,
                "date": 1524247262.0
            },
            {
                "user": "AB6Daf",
                "comment": "Wake me up when it's all over.",
                "score": 191,
                "date": 1524245615.0
            },
            {
                "user": "b0rnforthis",
                "comment": "oh my god i got into EDM because of him 7 years ago. RIP Tim",
                "score": 57,
                "date": 1524245981.0
            },
            {
                "user": "HeyHoeLetsGo",
                "comment": "Omg, this cant be real. It’s too sad. Wft",
                "score": 92,
                "date": 1524245086.0
            },
            {
                "user": "DoorMattt",
                "comment": "What the fuck. Only 28, that's no age at all",
                "score": 55,
                "date": 1524246079.0
            },
            {
                "user": "JustSerif",
                "comment": "Had Avicii troll me once at private party my industry hired him for... After his set he saw me striking out getting a couple girl's numbers and popped up from out of nowhere ( I was lightly drunk, so my awareness was not high - evident by my presumed success rate at wooing; so he could have come from literally anywhere)\n\nAccording to Avicii, who also tried to convince me he was just a local dj who played there every weekend, if you try the number once and don't get an answer, that's o.k, the number is still good; she might just be busy or not around her phone. If you try it a second time at a later date and she doesn't pick up, don't worry, there is still a chance she was just busy again. If you try it a third time to the same result, throw that number away - it's no good. \n\nThanks buddy, I'll think of you fondly when striking out in the future.",
                "score": 91,
                "date": 1524248494.0
            },
            {
                "user": "J3t5et",
                "comment": "I had the good fortune of seeing him several times across the US. His shows, his music brought such incredible positivity to so many. \n\nSeek Bromance is the anthem of that time in my life and I’ll forever be grateful for those experiences.\n\nGone, but not forgotten ❤️ Rest In Peace ",
                "score": 15,
                "date": 1524252037.0
            },
            {
                "user": "Redhawk911",
                "comment": "The Fuck? :(",
                "score": 41,
                "date": 1524245487.0
            },
            {
                "user": "best_jeppe",
                "comment": "Not the biggest fan of his music but this is so weird. Did he have any history of drug abuse? And what is it with talented artists dying at the age of 27 - 28?",
                "score": 149,
                "date": 1524245337.0
            },
            {
                "user": "_TIMBER_",
                "comment": "Incredibly sad news. I feel terrible for his family. I hope they find solace in the fact that he made so many people happy and that his music will live on forever.",
                "score": 11,
                "date": 1524245595.0
            },
            {
                "user": "brown_paper_bag_920",
                "comment": "Damn, Avicii was the shit... Levels has to be one of the greatest EDM jams of all time... :(",
                "score": 12,
                "date": 1524248907.0
            },
            {
                "user": "Anthony212",
                "comment": "I remember when he released Seek Bromance under Tim Berg. Rip buddy. ",
                "score": 14,
                "date": 1524257432.0
            },
            {
                "user": "Uebeltank",
                "comment": "What. This just seems *unreal*. Insanely tragic and truly a great loss.",
                "score": 31,
                "date": 1524245663.0
            },
            {
                "user": "KalleJoKI",
                "comment": "out of all people in the world, i didnt expect fucking avicii to die. absolutely horrible",
                "score": 43,
                "date": 1524246232.0
            },
            {
                "user": "jbaum311",
                "comment": "\"Son, one day you'll leave this world behind, so live a life you will remember...\"",
                "score": 12,
                "date": 1524250789.0
            },
            {
                "user": "diego_02",
                "comment": "His friend Nicky Romero (dj/producer) received 2 full folder with music from Avicii in the last couple of months said Romero in a interview in a Dutch talk shiw",
                "score": 10,
                "date": 1524263672.0
            },
            {
                "user": "Maryme244",
                "comment": "I am so fucking saddened by this. I have never felt personal grief from a celebrity's death before, but I think I attach his music to so many of my memories from high school, college, and beyond. My late teens/early 20s were when I began to really cultivate my love for electronic dance music and music festivals. I saw Avicii at EDC Las Vegas 2015 and that weekend will go down as one of my greatest weekends ever. His music played a major role in enriching my life. I've listened to most of his songs today and I am flooded with rich memories from each song. I hope he knew the profound impact his music had on people. Rest easy. ",
                "score": 11,
                "date": 1524271553.0
            },
            {
                "user": "tbezza",
                "comment": "[Deterioration of his health from 2011 to when he retired in 2014](https://edmnews.it/avicii-lotta-contro-la-malattia-e-annuncia-un-nuovo-album-ed-un-singolo/) ",
                "score": 10,
                "date": 1524248308.0
            },
            {
                "user": "thanksforthework",
                "comment": "My little sisters boyfriend at the time was really into the song “Wake me up”. He would always play it in the car. They broke up after a few years, and though they went to different universities, they remained friends. He began struggled with depression, and ended up killing himself. It was very rough on my mother and sister. I like that song, but it really took on another meaning for me after that. Whenever I hear it, unless I’m alone, I change the radio station or skip it. Some people just hear catchy EDM music, which is fine, but Tim’s music really resonated with a lot of people for many different reasons. Sad to hear such a talented man was taken away too soon. ",
                "score": 10,
                "date": 1524251478.0
            },
            {
                "user": "Turrican76",
                "comment": "So sad. Just recently watched the documentary on Netflix which was really intense and showed him struggling with the success and the stress. Really felt for him as it seemed everybody was forcing him to tour like crazy just for the money. It ended with him quitting touring and enjoying his life. Unfortunately it didn't last long... RIP",
                "score": 11,
                "date": 1524260863.0
            },
            {
                "user": "SamVegas",
                "comment": "https://www.billboard.com/articles/news/dance/8358389/avicii-dead-tim-berglund\n\nDamn this came out of nowhere",
                "score": 8,
                "date": 1524245505.0
            },
            {
                "user": "Vinnny_Chu",
                "comment": "The Golden Ages of EDM really is dead now :(. Keep spinnin up there Avicii \nRIP Dance God",
                "score": 9,
                "date": 1524261284.0
            },
            {
                "user": "bdazle21",
                "comment": "many good times have been had to Avicii's tracks...very very sad news to wake up to ",
                "score": 8,
                "date": 1524262640.0
            },
            {
                "user": "Banner-Man",
                "comment": "Holy shit I thought it just meant like him as an artist is dead (like not relevant) I came to be mad but now I'm just really sad.  Rest in peace Avicii you will be missed.",
                "score": 8,
                "date": 1524263883.0
            },
            {
                "user": "therevolutionaryJB",
                "comment": "He has been a major alcoholic since like age 14. Probably some major organ damage there. My best guess is liver failure. Rip he was a wonderful artist and all the guys on r/headphones will really miss his smooth style of EDM.  Rest easy Tim.",
                "score": 8,
                "date": 1524268499.0
            },
            {
                "user": "ItsComingHomeLads",
                "comment": "This is really sad. And the mocking comments are making it even worse.\n\nRIP Avicii. You created the new wave of EDM and your legacy will not be forgotten. ",
                "score": 9,
                "date": 1524274798.0
            },
            {
                "user": "casual_microwave",
                "comment": "Holy shit :(\n\nMy heart just dropped reading this",
                "score": 15,
                "date": 1524246156.0
            },
            {
                "user": "spezey",
                "comment": "I really wanted to see him live once :(\nreally sad R.I.P.",
                "score": 8,
                "date": 1524245821.0
            },
            {
                "user": "Godly_Panda",
                "comment": "Rip Avicii\n\nLet you rest now",
                "score": 8,
                "date": 1524248551.0
            },
            {
                "user": "PapaGeorgio23",
                "comment": "Regardless if you liked his music or not, this is just sad, 28 years old? Fuck.... life can be so shit to some people, rest in peace! :(",
                "score": 8,
                "date": 1524263007.0
            },
            {
                "user": "HawkeyeNation",
                "comment": "This one hurts a lot. Every time I hear “Wake me up,” I’m reminded of simpler times and it instantly puts me at ease. This really sucks. ",
                "score": 8,
                "date": 1524267313.0
            },
            {
                "user": "Ddslayer6",
                "comment": "Just unbelievable, one of the best DJ's this world has ever seen, countless Summer Hits, and great house music, this is so sad, Avicii was the first artist who introduced me into House, im shook.",
                "score": 21,
                "date": 1524245825.0
            },
            {
                "user": "glassen75",
                "comment": "*wake me up when it’s all over*",
                "score": 48,
                "date": 1524245735.0
            },
            {
                "user": "rootless_tree",
                "comment": "Makes me think about that line in Mike Posner's song,  *I took a pill in Ibiza to show Avicii I was cool. And when I finally got sober, felt ten years older, but fuck it, it was something to do*... Very sad. All that partying eventually catches up with a person. ",
                "score": 20,
                "date": 1524247215.0
            },
            {
                "user": "Pillens_burknerkorv",
                "comment": "Oh man. I just saw a documentary about him yesterday.\nIt ended that after some dark times, things were turning around for him. That’s just too sad...",
                "score": 12,
                "date": 1524245778.0
            },
            {
                "user": "aWaros",
                "comment": "This is one of the things that you just do not see coming.. Too young..",
                "score": 14,
                "date": 1524245907.0
            },
            {
                "user": "ealuscerwen",
                "comment": "This is really weird, really unexpected. It sounds super morbid, but he almost joined the club of 27. I wonder how he died. Some of my friends are saying that there were rumors thay he was apparently very depressed? ",
                "score": 14,
                "date": 1524246125.0
            },
            {
                "user": "ThomasRollen",
                "comment": "RIP. Avicii will always have a special place in my heart. So sad to see him die so young. Vila i frid <3.",
                "score": 6,
                "date": 1524245425.0
            },
            {
                "user": "deadbabieslol",
                "comment": "My EDM phase was totally kickstarted by Avicii. I remember seeing him in 2011 in Camden, my first EDM show, when I was still in high school.\n\nYou gave me some great memories Tim. You will be missed.",
                "score": 7,
                "date": 1524248898.0
            },
            {
                "user": "TheLittleGoodWolf",
                "comment": ">EDIT: Found another one from the biggest newspaper in Sweden:\n\nJust a heads up SVT is not a newspaper it's a public service TV station, pretty much our version of the BBC.",
                "score": 8,
                "date": 1524251552.0
            },
            {
                "user": "Highlife2tall",
                "comment": "He just missed the 27 club",
                "score": 6,
                "date": 1524262056.0
            },
            {
                "user": "Shark140",
                "comment": "It's just crazy. His music is so staple to people my age, especially songs like Wake Me Up. \n\nNow that he's passed away, and especially at his age, you feel like you've lost something important. \n\nRest in peace Tim Bergling. ",
                "score": 7,
                "date": 1524265596.0
            },
            {
                "user": "Mitchmatchedsocks",
                "comment": "He performed at my college's \"Spring Party Weekend\" my freshman year, back when Levels was his only \"hit\". My junior and senior year my friends and I would do this really goofy dance to Wake Me Up where sometimes we'd just jump around scream the lyrics, or we'd do a \"swing your partner round-and-round\" type of square dance to it. Way too young to go.",
                "score": 7,
                "date": 1524268303.0
            },
            {
                "user": "hpmalet",
                "comment": "One day you'll leave this world behind,\nSo live a life you will remember.\n\nRest in peace. I've run quite a few kms listening to his songs",
                "score": 14,
                "date": 1524247117.0
            },
            {
                "user": "demacish",
                "comment": "https://www.svtplay.se/video/17478602/avicii-true-stories Really good documentary about him.\n\nNot sure if people outside Sweden are able to watch it without VPN",
                "score": 14,
                "date": 1524246350.0
            }
        ]
    },
    {
        "flair": "Discussion",
        "title": "Chris Brown arrested after a show in Florida on a felony battery warrant. Can we please end this piece of trash's career already?",
        "author": "robbman21",
        "date": 1530894370.0,
        "score": 63498,
        "description": "Link to CNN article.\n\nhttps://www.cnn.com/2018/07/06/entertainment/chris-brown-arrested-in-florida/index.html",
        "comments": [
            {
                "user": "eggn00dles",
                "comment": "R Kelly still has a career",
                "score": 3253,
                "date": 1530897118.0
            },
            {
                "user": "CptMalReynolds",
                "comment": "I woke up Chris breezy. Holy shit I'm in jail!",
                "score": 16827,
                "date": 1530895745.0
            },
            {
                "user": "TheGaelicBeagle",
                "comment": "Two girls I work with this morning were discussing how the cops just cant seem to leave him alone, and then struck up a conversation about how evidence against him is likely all fake.  Like WTF?",
                "score": 9236,
                "date": 1530895616.0
            },
            {
                "user": "sweetcheekstees",
                "comment": "If he were just some regular dude off the street he'd have lengthy jail sentences already, throw in some fame and some money and he's just a \"troubled artist\". POS.",
                "score": 7374,
                "date": 1530894642.0
            },
            {
                "user": "OriginalAngryBeards",
                "comment": "For me, he's in the same category of dirtbag as R.Kelly, a musician who has fame, money, and a fanatic fanbase that will excuse any transgression. With that in mind, I submit the boondocks' take on R.Kelly.\n\nhttps://www.dailymotion.com/video/x530g8c",
                "score": 381,
                "date": 1530899029.0
            },
            {
                "user": "heyyouwtf",
                "comment": "Yesterday my wife and I were talking about him assaulting Rihana. I never read the police report until it was posted on Reddit. It was way worse than I had thought in my head. This guy is a piece of shit I don't understand why people are still fans. ",
                "score": 214,
                "date": 1530904315.0
            },
            {
                "user": "BluePantera",
                "comment": "The assault happened back in 2017 when Brown allegedly hit a photographer. Just a little context, still a garbage move.",
                "score": 1549,
                "date": 1530895791.0
            },
            {
                "user": "RedHoneyLoop",
                "comment": "Post this on every thread about this POS\n\n\n\nBrown was driving a vehicle with Robyn F. as the front passenger on an unknown street in Los Angeles. Robyn F. picked up Brown's cellular phone and observed a three-page text message from a woman who Brown had a previous sexual relationship with.\n\nA verbal argument ensued and Brown pulled the vehicle over on an unknown street, reached over Robyn F. with his right hand, opened the car door and attempted to force her out. Brown was unable to force Robyn F. out of the vehicle because she was wearing a seat belt. When he could not force her to exit, he took his right hand and shoved her head against he passenger window of the vehicle, causing an approximate one-inch raised circular contusion.\n\nRobyn F. turned to face Brown and he punched her in the left eye with his right hand. He then drove away in the vehicle and continued to punch her in the face with his right hand while steering the vehicle with his left hand. The assault caused Robyn F.'s mouth to fill with blood and blood to splatter all over her clothing and the interior of the vehicle.Brown looked at Robyn F. and stated, 'I'm going to beat the sh- out of you when we get home! You wait and see!'\n\nThe detective said Robyn F. then used her cell phone to call her personal assistant Jennifer Rosales, who did not answer.Robyn F. pretended to talk to her and stated, 'I'm on my way home. Make sure the police are there when I get there.' After Robyn F. faked the call, Brown looked at her and stated, 'You just did the stupidest thing ever! Now I'm really going to kill you!'\n\nBrown resumed punching Robyn F. and she interlocked her fingers behind her head and brought her elbows forward to protect her face. She then bent over at the waist, placing her elbows and face near her lap in [an] attempt to protect her face and head from the barrage of punches being levied upon her by Brown.\n\nBrown continued to punch Robyn F. on her left arm and hand, causing her to suffer a contusion on her left triceps (sic) that was approximately two inches in diameter and numerous contusions on her left hand.\n\nRobyn F. then attempted to send a text message to her other personal assistant, Melissa Ford. Brown snatched the cellular telephone out of her hand and threw it out of the window onto an unknown street.Brown continued driving and Robyn F. observed his cellular telephone sitting in his lap. She picked up the cellular telephone with her left hand and before she could make a call he placed her in a head lock with his right hand and continued to drive the vehicle with his left hand.Brown pulled Robyn F. close to him and bit her on her left ear. She was able to feel the vehicle swerving from right to left as Brown sped away. He stopped the vehicle in front of 333 North June Street and Robyn F. turned off the car, removed the key from the ignition and sat on it.\n\nBrown did not know what she did with the key and began punching her in the face and arms. He then placed her in a head lock positioning the front of her throat between his bicep and forearm. Brown began applying pressure to Robyn F.'s left and right carotid arteries, causing her to be unable to breathe and she began to lose consciousness.\n\nShe reached up with her left hand and began attempting to gouge his eyes in an attempt to free herself. Brown bit her left ring and middle fingers and then released her. While Brown continued to punch her, she turned around and placed her back against the passenger door. She brought her knees to her chest, placed her feet against Brown's body and began pushing him away. Brown continued to punch her on the legs and feet, causing several contusions.\n\nRobyn F. began screaming for help and Brown exited the vehicle and walked away. A resident in the neighborhood heard Robyn F.'s plea for help and called 911, causing a police response. An investigation was conducted and Robyn F. was issued a Domestic Violence Emergency Protective Order.",
                "score": 727,
                "date": 1530896164.0
            },
            {
                "user": "DieTheVillain",
                "comment": "His shitty fans will defend his shitty behavior, and his shitty career will continue.... shittily\n",
                "score": 7001,
                "date": 1530894785.0
            },
            {
                "user": "zio_caleb",
                "comment": "when the fuck are you gonna grow up so your daughter doesn’t need to see her daddy being a POS ",
                "score": 305,
                "date": 1530895441.0
            },
            {
                "user": "TheSonic311",
                "comment": "I teach Middle School in the hood. None of my female students believe me when I tell them Chris Brown is a piece of human garbage. They all defend him and say the girl probably had it coming. Kind of sickening.",
                "score": 128,
                "date": 1530900177.0
            },
            {
                "user": "twincityteeco",
                "comment": "-eyeroll- WHYYYY are people still buying tickets to his shows and allowing this scum to continue to thrive?? WHYYYY???!!!??",
                "score": 792,
                "date": 1530894556.0
            },
            {
                "user": "OpalDragons",
                "comment": "It should’ve ended a fucking decade ago when he beat Rihanna half to death.",
                "score": 32,
                "date": 1530899298.0
            },
            {
                "user": "joliedame",
                "comment": "Fuck this piece of trash. He needs to be in fucking prison. ",
                "score": 16,
                "date": 1530905673.0
            },
            {
                "user": "2monkeysandafootball",
                "comment": "SUPRISE MOTHERFUCKER!!!",
                "score": 31,
                "date": 1530896754.0
            },
            {
                "user": "NameThatThing",
                "comment": "we all know that celebrities are above the law, whether we admit it or not. that's just how fame and money works. ",
                "score": 36,
                "date": 1530911525.0
            },
            {
                "user": "Alphafuckboy",
                "comment": "If theres one thing Reddit hates its chris breezy... get em boys.",
                "score": 261,
                "date": 1530895239.0
            },
            {
                "user": "MegaTonMurderer",
                "comment": "Here is LIVING FUCKING PROOF that you can get away with ANYTHING if you have money! How are people still paying this piece of shit to sing and dance knowing how horrible he is??  I 100% agree with OP. End his career people!!",
                "score": 83,
                "date": 1530898919.0
            },
            {
                "user": "TakeoGaming",
                "comment": "On my way to work the Dj on the radio reported the story with a laugh and said \"as if this comes as a surprise\" then played his new song!\n\nWtf? Why promote this guy still?! ",
                "score": 50,
                "date": 1530900029.0
            },
            {
                "user": "lostmycookie90",
                "comment": "In before rabid fans excuse his behavior away. He's not a good person, his music is mediocre, has racked up multiple assault charges, and yet just another example of money and fame keeping society rejects out of prison.",
                "score": 116,
                "date": 1530894548.0
            },
            {
                "user": "Tyrantkv",
                "comment": "Nothing ever happens to him.  He gets assigned rehab and then nothing.  Time and time again.  Fucked up thing is if someone sucker punched him the way he does people they'd go to jail.",
                "score": 16,
                "date": 1530911487.0
            },
            {
                "user": "arkaytees",
                "comment": "Trash.",
                "score": 33,
                "date": 1530894689.0
            },
            {
                "user": "zamtrul",
                "comment": "Chris brown is a piece of shit, but people are being so hypocritical when xxx died they worshiped him like a god even after his thug activities, beating hit pregnant girlfriend, and beating up a gay person. ",
                "score": 109,
                "date": 1530896868.0
            },
            {
                "user": "vivalacamm",
                "comment": "I encourage everyone in this sub to read the Police Report on his beating of Rihanna. It’s disgusting. \n\n\nPolice report below, if anyone hasn't read it:\n\n\nChristopher Brown and Robyn F. (Rihanna) have been involved in a dating relationship for approx one and half years. On Sunday, February 8, 2009 at 0025 hours, Brown was driving a vehicle with Robyn F. as the front passenger on an unknown street in Los Angeles. Robin F. picked up Brown’s cellular telephone and observed a three page text message from a woman who Brown had a previous sexual relationship with. A verbal argument ensued and Brown pulled the vehicle over on an unknown street, reached over Robyn F. with his right hand, opened the car door and attempted to force her out. Brown was unable to force Robyn F. out of the vehicle because she was wearing a seat belt. When he could not force her to exit he took his right hand and shoved her head against the passenger window of the vehicle causing an approximate one inch raised circular contusion. Robyn F. turned to face Brown and he punched her in the left eye with his right hand. He then drove away in the vehicle and continued to punch her in the face with his right hand while steering the vehicle with his left hand. The assault caused Robyn F’s mouth to fill with blood and blood to splatter all over her clothing and the interior of the vehicle.\n\nBrown looked at Robyn F. and stated, “I am going to beat the shit out of you when we get home! You wait and see!” Robyn F. picked her cellular telephone and called her personal assistant, Jennifer Rosales at [redacted]. Rosales did not answer the telephone but while her voicemail greeting was playing, Robyn F. pretended to talk to her and stated, “I’m on my way home. Make sure the cops are there when I get there.” (This statement was made while the greeting was playing and was not captured as a message). After Robyn F. faked the call, Brown and looked at her and stated, “You just did the stupidest thing ever! Now I’m really going to kill you.” Brown resumed punching Robyn F. and she interlocked her fingers behind her head and brought her elbows forward to protect her face. She then bent over at the waist, placing her elbows and face near her lap in attempt to protect her face and head from the barrage of punches being levied upon her by Brown. Brown continued to punch Robyn F. on her left arm and hand causing her to suffer a contusion on her left triceps that was approximately two inches in diameter and numerous contusions on her left hand. Robyn F. then attempted to send a text message to her other personal assistant, Melissa Ford. Brown snatched the cellular telephone out of her hand and threw it out of the window onto an unknown street.\n\nBrown continued driving and Robyn F. observed his cellular phone sitting in his lap. She picked up the cellular telephone with her left hand and before she could make a call he placed her in a head lock with his right hand and continued to drive the vehicle with his left hand. Brown pulled Robyn F. close to him and bit her on her left ear. She was able to feel the vehicle swerving from right to left as Brown sped away. He stopped the vehicle in front of [redacted] and Robyn F. turned off the car, removed the key from the ignition and sat on it. Brown did not know what she did with the key and began punching her in the face and arms. He then placed her in a head lock positioning the front of her throat between his bicep and forearm. Brown began applying pressure to Robyn F’s. left and right carotid arteries causing her to be unable to breathe and she began to lose consciousness. She reached up with her left hand and began attempting to gauge his eyes in an attempt to free herself. Brown bit her left ring and middle fingers and then released her. While Brown continued to punch her, she turned around and placed her back against the passenger door. She brought her knees to her chest, placed her feet against Brown’s body and began pushing him away. Brown continued to punch her on the legs and feet causing several contusions. Robyn F. began screaming for help and Brown exited the vehicle and walked away. A resident in the neighborhood heard Robyn F.’s plea for help and called 911, causing a police response. An investigation was conducted and Robyn F. was issued a Domestic Violence Emergency Protective Order (EPO).",
                "score": 13,
                "date": 1530903087.0
            },
            {
                "user": "spectrosoldier",
                "comment": "Fucking hell. Chris Brown seems to have more lives than a cat career wise, which surprises and disgusts me.",
                "score": 6,
                "date": 1530905649.0
            },
            {
                "user": "Quankers",
                "comment": ">Can we please end this piece of trash's career already? \n\nStop paying him money, and yes, you can.  Obviously, he has an audience.",
                "score": 9,
                "date": 1530911298.0
            },
            {
                "user": "Eddie_shoes",
                "comment": "When XXX died, everyone came out in support of him despite using BBQing tools to rape/injure/scare a girl. He beat her to the point of losing consciousness. I doubt many people will stop listening to Chris Brown because he punched a photographer, as sad as it may be.",
                "score": 15,
                "date": 1530899660.0
            },
            {
                "user": "Waynker87",
                "comment": "I liked Lil' Dicky until he did a collab with Chris Brownstain. ",
                "score": 8,
                "date": 1530897000.0
            },
            {
                "user": "Wildeyewilly",
                "comment": "Why are his misdeeds so underplayed and under punished?! An \"incident\" with his then girlfriend? No he beat the ever loving shit out of her. Practically to the poi t to call it attempted murder. This mother fucker needs to be removed from society. He has no business being in the public let alone the public eye.\n\nI always try to stay positive, and never wish for anything to anyone that I wouldn't wish for myself. But for Chris Brown I really hope the worst of terrible things for him.",
                "score": 24,
                "date": 1530896094.0
            },
            {
                "user": "tseremed",
                "comment": "Money and good legal representation. ",
                "score": 5,
                "date": 1530897039.0
            },
            {
                "user": "Alh840001",
                "comment": "I'm doing my part to provide him zero support. Like, ever.",
                "score": 3,
                "date": 1530904192.0
            },
            {
                "user": "hotstickywaffle",
                "comment": "Shouldn't he be in jail at this point either way? ",
                "score": 4,
                "date": 1530904241.0
            },
            {
                "user": "a_shootin_star",
                "comment": "Maybe he should go buy a motorcycle.",
                "score": 4,
                "date": 1530905520.0
            },
            {
                "user": "spicywookiee",
                "comment": "God damn it. This wasn’t Chris guys, it was Lil Dicky. ",
                "score": 21,
                "date": 1530899346.0
            },
            {
                "user": "FuzzyGunNuts",
                "comment": "To the top. Fuck this turd slurpee.",
                "score": 9,
                "date": 1530899914.0
            },
            {
                "user": "etr4807",
                "comment": "What? That doesn’t sound like the Chris Brown I know. ",
                "score": 11,
                "date": 1530899404.0
            },
            {
                "user": "FanofK",
                "comment": ">Singer[ Chris Brown ](https://www.cnn.com/2013/08/23/us/chris-brown-fast-facts/index.html)has been charged with felony battery for allegedly punching a man last year, police said Friday.  \n>  \n>Brown  struck the man for taking Brown's picture without permission in a Tampa  nightclub, Tampa police spokesman Stephen Hegarty said. Brown,  29, was arrested Thursday night in West Palm Beach after a concert at  the Coral Sky Ampitheatre at the South Florida Fairgrounds, Hegarty  said. \n\nOh, ok.. reading the comments i thought something way worse happened.. I mean you should not go around punching people, but I thought he did something way worse from the comments ",
                "score": 7,
                "date": 1530898626.0
            },
            {
                "user": "DarthDume",
                "comment": "I stop listening to anyone who collabs with him. Fuck Lil Dicky",
                "score": 44,
                "date": 1530896635.0
            },
            {
                "user": "swaggaliciouskk",
                "comment": "I realized one thing on reddit. Nothing unites people more in anger and toxicity on this site than when Chris Brown is mentioned. \n\n",
                "score": 17,
                "date": 1530896787.0
            },
            {
                "user": "JuanLob0",
                "comment": "In this thread: 140 comments from people who didn't read the article\n\nHe was arrested on a warrant for punching a papparazi in the face a year ago, which.. isn't really OK but most of these comments are clearly not related to the article.",
                "score": 31,
                "date": 1530896551.0
            },
            {
                "user": "Nicrubes",
                "comment": "Had to be a Friday ",
                "score": 3,
                "date": 1530899256.0
            },
            {
                "user": "djentbat",
                "comment": "The Rihanna thing happened in middle school for me, but I found so crazy in high school they were still a few girls who loved him. I couldn’t understand it honestly ",
                "score": 3,
                "date": 1530903311.0
            },
            {
                "user": "ShrekMemes420",
                "comment": "No because you morons keep letting him back in. ",
                "score": 3,
                "date": 1530904223.0
            },
            {
                "user": "tiny10boy",
                "comment": "At this point, any woman dumb enough to get involved with him gets no sympathy from me.",
                "score": 3,
                "date": 1530905722.0
            },
            {
                "user": "bradargent",
                "comment": "Chris wishes he had XXX’s fanbase right now.",
                "score": 3,
                "date": 1530906033.0
            },
            {
                "user": "TheHubbleGuy",
                "comment": "I don’t understand why his career continued past the point where he beat Rihanna to a pulp. ",
                "score": 3,
                "date": 1530907207.0
            },
            {
                "user": "christinakitsune",
                "comment": "Chris Brown is such a piece of shit. You think after the whole thing with Rihanna he'd  actually learn his God damn lesson but years later, almost a decade later he still the same piece of shit ... apparently he treated Karrueche Tran really horribly to like physically abusing her and shit...can somebody just end his career and stop making him relevant because he is just not worth anything he's just a piece of human garbage ",
                "score": 3,
                "date": 1530908518.0
            },
            {
                "user": "iamsodavid",
                "comment": "I get why people want to end certain artists careers, but that's not going to happen with the push of a button. If you don't want to support him, stop listening to him.",
                "score": 3,
                "date": 1530909094.0
            }
        ]
    }
]